[
    {
        "title": "Ayam Goreng Honey Butter Ala Korea",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/ayam-goreng-honey-butter-ala-korea",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Ayam_Honey_Butter_Korea_IG.jpg",
            "masa_penyediaan": "25 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "35 minit",
            "hidangan": "5 orang",
            "ingredients": {
                "Bahan Untuk Ayam Goreng": [
                    "sedikit garam",
                    "1 sudu besar kicap cair",
                    "½ sudu kecil serbuk lada hitam",
                    "2 biji telur",
                    "½ cawan tepung gandum",
                    "½ cawan tepung jagung atau tepung kentang",
                    "1 sudu kecil baking powder",
                    "10 ketul kepak ayam"
                ],
                "Bahan Untuk Salutan Ayam": [
                    "3 sudu besar butter (salted)",
                    "2-3 ulas bawang putih",
                    "3 sudu kecil chilli flakes",
                    "1 sudu kecil gula",
                    "2 sudu besar kicap manis",
                    "1-2 sudu besar madu",
                    "2 sudu besar bijan"
                ]
            },
            "instructions": {
                "Untuk Ayam Goreng Honey Butter": [
                    "Cincang halus atau parut bawang putih.",
                    "Gaul sekata ayam dengan sedikit garam, kicap cair, lada hitam, telur, tepung gandum, tepung jagung, dan baking powder.",
                    "Goreng atau sangai bijan sehingga naik bau bijan.",
                    "Sesudah itu, panaskan minyak dan goreng ayam lalu angkat.",
                    "Goreng ayam untuk kali kedua dengan menggunakan api sederhana lalu angkat dan tos minyak.",
                    "Panaskan butter lalu masukkan bawang putih, serbuk cili kasar, kicap manis, gula dan madu.",
                    "Bila bahan sudah sebati, masukkan ayam dan tutup api.",
                    "Gaul dan salut ayam goreng dengan kesemua bahan.",
                    "Kemudian, hidang ayam goreng honey butter dan tabur bijan yang telah disangai."
                ],
                "Untuk Serbuk Cili Buatan Sendiri": [
                    "Basuh dan tos kering cili daripada air selepas dibasuh.",
                    "Goreng tanpa minyak sehingga cili kering menjadi kering, garing dan rangup.",
                    "Bila dah garing, kisar kasar cili kering dan siap serbuk cili buatan sendiri."
                ]
            },
            "tips_and_guides": [
                "Selain tepung jagung, tepung perapan ayam juga boleh digantikan dengan tepung kentang",
                "Jika tidak mahu menggoreng cili kering menggunakan atas api, boleh bakar guna oven.",
                "Ketika mahu menggoreng ayam, jangan masukkan terlalu banyak ayam kedalam minyak bagi mengelakkan suhu minyak turun dan salutan ayam menjadi lembik dan hancur.",
                "Tambah sedikit garam jika menggunakan “unsalted butter” kedalam masakan."
            ]
        }
    },
    {
        "title": "Begedil Ayam Sedap",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/begedil-ayam-sedap",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/731d22d3f40d13130adad26538c249ba0a07c15a.jpeg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "15 minit",
            "jumlah_masa": "35 minit",
            "hidangan": "15 keping",
            "ingredients": {},
            "instructions": {
                "Untuk Masak Ayam": [
                    "Panaskan 2 sudu besar minyak masak dan goreng bawang besar sehingga lembut.",
                    "Masukkan ayam kisar dan goreng sehingga ayam masak. Perasakan dengan sedikit garam."
                ],
                "Untuk Masak Begedil": [
                    "Dalam kuali yang lain, panaskan minyak masak (anggaran 1 mangkuk). Goreng kentang sehingga kekuningan dan lembut. Angkat dan masukkan ke dalam mangkuk besar.",
                    "Ketika kentang masih panas, hancurkan kentang dengan cara melenyek kentang sehingga halus menggunakan potato masher atau garfu.",
                    "Masukkan bawang goreng, daun sup, ayam (yang dimasak tadi) dan serbuk lada putih. Perasakan dengan garam secukup rasa.",
                    "Ambil sedikit adunan dan buat bulat. Kemudia leperkan sedikit dan susun di atas pinggan atau dulang.",
                    "Panaskan minyak. Pecahkan telur dan kacau dengan garfu supaya sebati. Celup begedil di dalam telur dan goreng di dalam minyak yang panas sehingga kekuningan. Tunggu sehingga bahagian bawah begedil keras sedikit baru dialihkan untuk mengelak begedil dari hancur."
                ]
            },
            "tips_and_guides": [
                "Goreng Bawang Dahulu - Pastikan bawang besar dan ayam dimasak hingga kering agar adunan begedil tidak terlalu lembik.",
                "Gunakan Kentang Tempatan - Kentang tempatan lebih sesuai dan memberikan tekstur padat serta rasa yang lebih ‘lemak’ untuk begedil berbanding kentang import.",
                "Lenyek Kentang Panas - Kentang yang masih panas lebih mudah dilenyek halus dan menyerap perasa dengan lebih baik.",
                "Sesuaikan Kelembapan Adunan - Jika adunan terlalu lembik, tambahkan bawang goreng atau daun sup untuk menyerap kelembapan.",
                "Rehatkan Adunan - Bentuk begedil dan biarkan seketika supaya ia lebih kukuh sebelum digoreng.",
                "Suhu Minyak Sederhana - Goreng dengan api sederhana agar begedil masak sekata, tidak cepat garing di luar tetapi mentah di dalam.",
                "Telur sebagai ‘Gam’ - Celupan telur membantu mengekalkan bentuk dan memberi permukaan gorengan yang cantik.",
                "Elak ‘Overcrowd’ Kuali - Goreng secara berperingkat untuk mengekalkan suhu minyak stabil.",
                "Alternatif Daun Herba - Gantikan daun sup dengan daun bawang atau gunakan kedua-duanya untuk menambah rasa dan warna.",
                "Simpan Lebihan - Susun begedil yang telah dibentuk dalam bekas bertutup dan simpan di peti sejuk untuk kegunaan seterusnya."
            ]
        }
    },
    {
        "title": "Ayam Masak Phat Phet Kuah Merah",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/ayam-masak-phat-phet-kuah-merah",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/8a6319dc-3f88-441d-bb99-2c601687b9bd-1736476022893.jpg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "40 minit",
            "jumlah_masa": "1 jam",
            "hidangan": "10 orang",
            "ingredients": {
                "Bahan Utama": [
                    "6-8 batang kacang panjang",
                    "½ hingga 1 ekor ayam, dipotong kecil",
                    "1-2 sudu kecil garam",
                    "Serbuk kunyit secukupnya",
                    "½ sudu besar serbuk cili",
                    "Air asam jawa secukupnya",
                    "1 sudu besar gula melaka",
                    "Garam secukup rasa",
                    "Serbuk penyedap (optional)",
                    "2-3 helai daun limau purut",
                    "1 biji cili merah (untuk hiasan)"
                ],
                "Bahan Untuk Kisar": [
                    "6 tangkai cili padi merah",
                    "3 tangkai cili merah besar",
                    "2 ketul kunyit hidup (atau ½ sudu besar serbuk kunyit)",
                    "1 inci lengkuas, dihiris nipis",
                    "2 batang serai, dihiris nipis",
                    "3 helai daun limau purut",
                    "5-6 biji bawang merah kecil",
                    "5 ulas bawang putih",
                    "Belacan sebesar ibu jari (optional)",
                    "½ sudu kecil lada hitam"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Masukkan ayam yang telah digoreng, kacau sebati. Tambah air mengikut kepekatan kuah yang diingini.",
                    "Kisar halus bahan untuk dikisar dengan sedikit air hingga halus. Ketepikan.",
                    "Perap ketulan ayam dengan garam dan serbuk kunyit. Goreng ayam separuh masak dalam minyak yang betul-betul panas. Angkat dan ketepikan.",
                    "Dalam kuali yang sama, tinggalkan sedikit minyak dan tumis bahan kisar hingga pecah minyak dan naik bau.",
                    "Masukkan serbuk cili, kacau rata. Tambah sedikit air dan teruskan menumis hingga pecah minyak.",
                    "Masukkan air asam jawa, gula melaka, garam dan serbuk penyedap. Koyakkan daun limau purut dan masukkan. Biar mereneh hingga kuah pekat.",
                    "Masukkan kacang panjang yang dipotong 2 inci. Masak sebentar supaya sayur kekal rangup.",
                    "Akhir sekali, perah limau nipis (jika suka) dan tabur dengan hirisan cili merah.",
                    "Hidangkan panas-panas dengan nasi putih."
                ]
            },
            "tips_and_guides": [
                "Tahap kepedasan boleh dilaras dengan menukar nisbah cili padi dan cili merah besar",
                "Untuk aroma yang lebih wangi, gunakan kunyit hidup berbanding serbuk",
                "Pastikan minyak betul-betul panas semasa menggoreng ayam untuk elakkan melekat",
                "Jangan masak kacang panjang terlalu lama untuk mengekalkan kerangupan",
                "Boleh tambah terung bulat Thai untuk variasi yang lebih authentic",
                "Jika kuah terlalu pekat, boleh tambah air mengikut citarasa",
                "Belacan boleh ditinggalkan untuk yang kurang gemar atau alahan",
                "Boleh ganti gula melaka dengan gula perang biasa"
            ]
        }
    },
    {
        "title": "Ayam Goreng Teknik Brine",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/ayam-goreng-teknik-brine",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Ayam_Goreng_Teknik_Brine.jpg",
            "masa_penyediaan": "2 jam",
            "masa_memasak": "10 minit",
            "jumlah_masa": "2 jam 10 minit",
            "hidangan": "10 orang",
            "ingredients": {
                "Bahan Rendaman Ayam": [
                    "800g-1kg ayam",
                    "Air sejuk",
                    "1 sb garam",
                    "1 sb gula"
                ],
                "Bahan Untuk Goreng": [
                    "Garam secukup rasa",
                    "1-2 sk serbuk kunyit",
                    "1 sb tepung goreng serbaguna",
                    "Sedikit air",
                    "5-10 biji bawang merah kecil",
                    "15 tangkai cili padi",
                    "3 helai daun pandan",
                    "5 tangkai daun kari"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Larutkan gula dan garam dalam air sejuk (masuk air sampai tenggelam ayam).",
                    "Rendam ayam dalam larutan.",
                    "Sejukkan dalam peti sejuk minimum 2 jam atau semalaman.",
                    "Hiris nipis bawang merah.",
                    "Gunting daun pandan anggaran 1 inci panjang.",
                    "Cili padi buang tangkai je.",
                    "Tapis dan toskan ayam tadi.",
                    "Perasakan ayam dengan garam, serbuk kunyit, serbuk seasoning, tepung goreng ayam segera dan sedikit air.",
                    "Panaskan minyak dan mula goreng ayam.",
                    "Bila ayam dah garing masukkan hirisan bawang merah dan kacau sampai bawang kekuningan.",
                    "Masukkan cili padi, daun pandan dan daun kari.",
                    "Bila dah naik bau semua bahan boleh angkat dan tos minyak."
                ]
            },
            "tips_and_guides": [
                "Untuk ayam bahagian peha Che Nom kelar sikit sampai kena tulang sebab kita nak bagi ayam cepat masak.",
                "Kalau takde tepung goreng segera boleh ganti dengan tepung beras tapi lebihkan garam.",
                "Masa goreng kena tutup rapat dan minyak kena teggelam untuk dapat ayam yang juicy."
            ]
        }
    },
    {
        "title": "Rendang Ayam Cili Api Hijau",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/rendang-ayam-cili-api-hijau",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Rendang_Ayam_Cili_Api_Hijau.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "40 minit",
            "jumlah_masa": "1 jam 10 minit",
            "hidangan": "1 orang",
            "ingredients": {
                "Bahan Rendang": [
                    "1 ekor ayam",
                    "2 inci halia",
                    "8-10 biji bawang merah",
                    "4 ulas bawang putih",
                    "1 inci lengkuas",
                    "1 ketul kunyit hidup",
                    "3 batang serai (hiris nipis)",
                    "2 batang serai (ketuk)",
                    "1 helai daun kunyit",
                    "20-30 tangkai cili padi hijau",
                    "2 cawan santan pekat (dari 1 biji kelapa)",
                    "ATAU 1 kotak kecil santan",
                    "1 asam keping",
                    "Garam secukup rasa",
                    "1 sb kerisik",
                    "Sedikit gula melaka"
                ],
                "Bahan Sangai": [
                    "1 sb biji ketumbar",
                    "1/2 sb jintan putih",
                    "1/2 sb jintan manis"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Potong kasar bawang merah kecil, bawang putih, halia.",
                    "Potong nipis lengkuas, kunyit hidup dan serai.",
                    "Masukkan bahan potong, cili padi hijau dan sedikit air ke dalam blender. Kisar halus semua bahan.",
                    "Sangai biji ketumbar, jintan manis dan jintan putih. Kemudian kisar halus dengan blender kering.",
                    "Ketuk serai untuk tumis.",
                    "Panaskan minyak dan tumis serai sampai naik bau. Kemudian masukkan pulak bahan kisar halus dan tumis sampai pecah minyak.",
                    "Bila dah pecah minyak, masukkan ayam, rempah sangai dan sedikit air. Tutup dengan tudung kuali  dan masak sampai ayam kecut.",
                    "Tambah santan pekat, asam keping dan garam. Sambung reneh rendang sampai ayam masak dan kuah pekat.",
                    "Masukkan kerisik dan gula melaka.",
                    "Akhir sekali tabur dengan daun kunyit."
                ]
            },
            "tips_and_guides": [
                "Cili padi Che Nom campur cili padi thai (tak pedas sangat) dan cili kampung @ cabai burung (pedas).",
                "Kuah jangan terlalu pekat sebab nanti bila rendang dah sejuk dia akan pekat sikit lagi.",
                "Minyak pun kena menimbul tunjuannya nak bagi rendang tahan lama dan rasa pon sedap."
            ]
        }
    },
    {
        "title": "Set Ayam Panggang Ala Nandos",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/ayam-panggang-ala-nandos",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Ayam_Panggang_Ala_Nandos.jpg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "50 minit",
            "jumlah_masa": "1 jam 5 minit",
            "hidangan": "10 orang",
            "ingredients": {
                "Bahan Ayam Panggang": [
                    "1 ekor ayam, anggaran berat 1.7-1.8kg",
                    "2 sb serbuk smoked paprika",
                    "1/2 sb serbuk thyme atau rosemary kering",
                    "1/2 sb serbuk cayenne",
                    "1/2 sb serbuk parsley kering (pilihan)",
                    "1 sk serbuk lada hitam",
                    "4 sb minyak zaitun extra virgin",
                    "2 sk garam",
                    "1 sb serbuk pati ayam",
                    "2 sb jus lemon"
                ],
                "Bahan Sayur Panggang": [
                    "Sedikit garam",
                    "Minyak zaitun extra virgin",
                    "Brokoli",
                    "Lobak merah",
                    "Lada benggala",
                    "Bawang holland",
                    "Bawang putih",
                    "Cendawan butang",
                    "Sedikit serbuk lada hitam"
                ],
                "Bahan Gravy": [
                    "1 sb mentega",
                    "1 sb tepung gandum",
                    "Kuah ayam panggang",
                    "1/2 cwn air (tambah sikit-sikit)"
                ]
            },
            "instructions": {
                "Ayam Bakar": [
                    "Basuh bersih ayam, trim lebihan lemak atau kulit dan lap kering dengan tisu dapur.",
                    "Bancuh rempah untuk perapan ayam, smoked paprika, serbuk thyme (atau rosmary kering), serbuk cayenne serbuk black pepper, minyak zaitun extra virgin, lemon, garam dan serbuk pati ayam.",
                    "Gaul bahan bahan perapan tadi sekeliling ayam.",
                    "Perap dalam peti sejuk 2 jam atau semalaman.",
                    "Untuk bakar Che Nom guna cooling rack dan lapik dengan aluminium foil, kemudian tebuk lubang untuk air ayam panggang dripping kebawah.",
                    "Susun ayam atas tray, letak ayam bahagian kulit sebelah kebawah kemudian bakar selama 50 minit suhu 220 °C.",
                    "Kemudian terbalikkan pulak ayam (side kulit pulak bahagian atas) kemudian sambung bakar sampai ayam masak perang."
                ],
                "Sayur Panggang": [
                    "Potong brokoli, carrot, capsicum, bawang holland dan cendawan butang.",
                    "Cincang halus bawang putih.",
                    "Panaskan sikit minyak zaitun kemudian masak brokoli, carrot dan capsicum. Masak sampai nampak grill mark.",
                    "Kemudian masukan bawang holland, cendawan dan bawang putih. Boleh tambah olive oil kalau kering.",
                    "Bila semua dah layu bolehlah angkat.",
                    "Drizzle sikit lagi dengan olive oil, serbuk black pepper dan garam."
                ],
                "Gravy Sauce": [
                    "Keluarkan air dripping dari ayam bakar.",
                    "Panaskan butter dan tumis tepung gandum.",
                    "Bila dah sebati dan jadi pes, boleh tuang masuk air dripping ayam tadi dan sedikit air untuk kuah.",
                    "Ok dah siap! dah boleh hidang."
                ]
            },
            "tips_and_guides": [
                "Berapa lama nak bakar bergantung juga jenis oven dan saiz ayam.",
                "Nak tau ayam panggang ni dah masak ke tidak, boleh cucuk dengan pisau sampai ke tulang, dan tengok air yang keluar, kalau clear maknanya dah masak, kalau ada kesan merah bakar semula."
            ]
        }
    },
    {
        "title": "Ayam Masak Ketumbar",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/ayam-masak-ketumbar",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Ayam_Masak_Ketumbar.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "1 jam",
            "hidangan": "8 orang",
            "ingredients": {
                "Bahan Utama": [
                    "1/2 ekor / 800g potongan ayam",
                    "1 sk garam",
                    "1 sk serbuk kunyit",
                    "2-3 biji bawang merah kecil",
                    "4 ulas bawang putih",
                    "1/2 inci halia",
                    "2 sb sos tiram",
                    "2 sb kicap manis",
                    "5 tangkai cili padi",
                    "2 sb ketumbar",
                    "Sedikit air (untuk kuah)",
                    "3 tangkai cili merah",
                    "1/2 biji bawang besar",
                    "Daun bawang atau daun ketumbar, hiasan"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Gaul ayam dengan garam dan kunyit. Ketepikan dan perap ayam dulu.",
                    "Tumbuk kasar bawang merah, bawang putih dan halia.",
                    "Potong kasar bawang holland dan cili besar untuk taburan akhir.",
                    "Sangai ketumbar sampai naik bau, tuang masuk dalam lesung batu dan tumbuk sederhana halus.",
                    "Panaskan minyak dan goreng ayam separuh masak.",
                    "Bila ayam dah separuh masak, boleh keluarkan dan ketepikan dulu.",
                    "Keluarkan minyak ayam goreng (kalau rasa banyak).",
                    "Tumis bawang dan halia tumbuk tadi.",
                    "Bila bahan tumis dah garing, masukkan cili padi, sos tiram dan ayam goreng.",
                    "Tambah kicap manis, biji ketumbar tumbuk dan air (untuk kuah).",
                    "Tutup tudung kuali dan biar ayam masak sebati dengan kuah.",
                    "Akhir sekali tabur bawang holland, cili merah dan daun sup untuk hiasan."
                ]
            },
            "tips_and_guides": [
                "Jangan goreng ayam penuh kuali nanti ayam lambat masak dan lambat garing, seeloknya split 2 dan masak sikit-sikit."
            ]
        }
    },
    {
        "title": "Ayam Percik",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/ayam-percik-bazar-ramadhan",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Ayam_Percik.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "40 minit",
            "jumlah_masa": "1 jam 10 minit",
            "hidangan": "10 orang",
            "ingredients": {
                "Bahan Untuk Ayam": [
                    "1 ekor ayam (bahagian paha)",
                    "2 sudu kecil garam",
                    "1/2 sudu besar gula",
                    "1 sudu besar serbuk pati ayam",
                    "1/2 sudu besar serbuk cili",
                    "1 sudu besar sos tiram",
                    "Sedikit perahan limau nipis"
                ],
                "Bahan Untuk Kisar": [
                    "2 biji bawang merah besar",
                    "1 inci halia",
                    "1 inci lengkuas",
                    "4 ulas bawang putih",
                    "1 kunyit hidup",
                    "2 batang serai",
                    "3-4 biji buah keras"
                ],
                "Bahan Untuk Kuah": [
                    "1 mangkuk kecil minyak masak",
                    "2 senduk cili kisar",
                    "1 sudu besar serbuk cili",
                    "Sedikit air asam jawa",
                    "Garam secukup rasa",
                    "Gula melaka secukup rasa",
                    "1 tin Susu Isian Sejat F&N",
                    "Sedikit bancuhan tepung jagung (untuk pekatkan kuah jika perlu)"
                ]
            },
            "instructions": {
                "Ayam": [
                    "Kisar halus bawang besar, halia, lengkuas, bawang putih, kunyit hidup, serai buah keras dengan air separuh tenggelam.",
                    "Gaul ayam dengan garam, gula, serbuk pati ayam, serbuk cili, sos tiram, separuh bahan kisar dan sedikit perahan limau nipis.",
                    "Perap ayam selama 1/2 – 1 jam.",
                    "Kukus ayam anggaran 15 minit."
                ],
                "Kuah": [
                    "Panaskan minyak dan tumis bahan kisar halus, cili kisar dan serbuk cili. Masak sampai pecah minyak.",
                    "Masukkan sedikit air asam jawa, garam dan gula melaka. Sambung masak sampai kering.",
                    "Tuang masuk kuah perapan ayam dan susu isian sejat F&N.",
                    "Tambah air bencuhan tepung jagung, masak sampai kuah mendidih dan boleh tutup api."
                ],
                "Bakar": [
                    "Bakar ayam kedua-dua belah (tanpa kuah percik).",
                    "Celup ayam dalam kuah percik dan bakar lagi sekali kedua-dua belah.",
                    "Tambah lagi kuah atas ayam masa bakar.",
                    "Dah siap panggang, boleh angkat dan hidang."
                ]
            },
            "tips_and_guides": [
                "Che Nom guna 4 ketul bahagian whole leg, dah macam sukatan 1 ekor. Tapi untuk resepi kuah percik ni sebenarnya cukup untuk 2 ekor ayam",
                "Sebelum perap kelar dulu isi ayam, tujuannya untuk rempah perap cepat menyerap dan ayam cepat masak.",
                "Che nom kukus ayam dulu untuk pastikan ayam cepat masak dan masak sempurna dalam.",
                "Kalau suka kuah yang cair, boleh tambah sedikit air masa masak kuah."
            ]
        }
    },
    {
        "title": "Ayam Goreng Korea Cheese Bertali",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/ayam-goreng-korea-cheese",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Ayam_Korea_Cheese_Bertali.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "40 minit",
            "jumlah_masa": "1 jam 10 minit",
            "hidangan": "7 orang",
            "ingredients": {
                "Bahan Ayam Goreng": [
                    "700g ayam bahagian peha dan kepak",
                    "1/2 inci halia",
                    "1 ulas bawang putih",
                    "1/2 sk lada hitam",
                    "3 sb tepung goreng ayam segera original",
                    "Sedikit air",
                    "Tepung segera secukupnya (utk gaul)"
                ],
                "Bahan Sos Gochujang": [
                    "1-2 sb bijan",
                    "3 sb minyak masak",
                    "1 ulas bawang putih",
                    "3 sb pes gochujang",
                    "Sedikit air",
                    "1/2 sb gula perang",
                    "2 sb madu",
                    "1 sb kicap manis",
                    "250g Anchor Extra Stretch Mozzarella Cheese"
                ]
            },
            "instructions": {
                "Ayam Goreng": [
                    "Gaul ayam dengan halia parut,  bawang putih parut, lada hitam, tepung goreng segera original dan sedikit air.",
                    "Perap dalam peti sejuk 15 minit.",
                    "Salut ayam perap dengan tepung goreng segera.",
                    "Goreng ayam sampai perang kemudian angkat dan toskan.",
                    "Goreng ayam kali kedua sampai rangup dan ketepikan dulu (kalau tak nak goreng 2 kali, boleh goreng sekali sampai betul-betul rangup)."
                ],
                "Sos Salutan": [
                    "Cincang kasar bawang putih.",
                    "Panaskan minyak dan tumis bawang putih.",
                    "Masukkan pes gochujang, air sikit, gula perang, madu dan kicap manis. Masak sampai naik buih.",
                    "Masukkan ayam goreng dan bijan sangai kemudian tos sebati.",
                    "Cairkan Anchor Extra Stretch+ Mozzarella Cheese.",
                    "Tarik keju dan lilit disekeliling ayam."
                ]
            },
            "tips_and_guides": [
                "Kelar bahagian peha ayam untuk cepat masak bila goreng.",
                "Beli tepung goreng yang original, sebab nanti kita akan salut dengan sos gachujang, kacau lah rasa kalau kita guna tepung berempah pedas.",
                "Salut ayam bila minyak dah panas dan pastikan minyak cukup, anggaran tenggelam ayam.",
                "Goreng ayam sampai keluar darah dari tulang dan warna bertukar gelap."
            ]
        }
    },
    {
        "title": "Ayam Masak Cabai Bersantan",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/ayam-masak-cabai-bersantan",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Ayam_Masak_Cabai_Bersantan.jpg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "50 minit",
            "hidangan": "5 orang",
            "ingredients": {
                "Bahan Utama": [
                    "Gula",
                    "1/2 ekor ayam",
                    "1 sk serbuk kunyit",
                    "1 sk garam",
                    "4 tangkai cili padi",
                    "2-3 tangkai cili merah besar",
                    "1/2 biji bawang besar",
                    "3 ulas bawang putih",
                    "Sedikit belacan",
                    "2 cwn santan sederhana cair",
                    "ATAU 1/2 kotak krim santan",
                    "1 helai daun kunyit",
                    "1 keping asam gelugor",
                    "Sedikit serbuk kunyit",
                    "2 sb sos tiram",
                    "Garam",
                    "Perasa, jika suka"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Potong kasar cili besar, cili padi, bawang besar dan bawang putih.",
                    "Hiris nipis daun kunyit.",
                    "Gaul ayam dengan serbuk kunyit dan garam.",
                    "Tumbuk kasar bahan potong tadi dengan sedikit belacan.",
                    "Panaskan minyak dan goreng ayam separuh masak.",
                    "Bila dah separuh masak, boleh angkat dan ketepikan.",
                    "Minyak goreng tadi keluarkan, tinggal anggaran ½ cwn.",
                    "Tumis bahan tumbuk kasar sampai garing.",
                    "Masukkan ayam goreng dan gaul biar sekata.",
                    "Masukkan asam keping, santan dan serbuk kunyit.",
                    "Masuk sos tiram, garam dan perasa.",
                    "Perlahankan api dan masak sampai kuah pekat dan meresap dengan ayam anggaran 10 minit.",
                    "Tabur hirisan daun kunyit dan tutup api."
                ]
            },
            "tips_and_guides": [
                "Kalau guna kuali stainless steel untuk goreng, minyak kena cukup panas baru lah bahan goreng tak melekat. Kena betul-betul panas sebelum goreng."
            ]
        }
    },
    {
        "title": "Ayam Bawang Nasi Kandar",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/ayam-bawang-nasi-kandar",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Ayam_Bawang_Nasi_Kandar.jpg",
            "masa_penyediaan": "40 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "1 jam 10 minit",
            "hidangan": "10 orang",
            "ingredients": {
                "Bahan Kisar Halus": [
                    "1 biji bawang merah besar",
                    "3 biji bawang merah kecil",
                    "5 ulas bawang putih",
                    "2 inci halia"
                ],
                "Bahan Ayam Goreng": [
                    "1 kilo ayam",
                    "2 sk garam",
                    "2 sk serbuk kunyit"
                ],
                "Bahan Lain": [
                    "3 biji bawang merah besar",
                    "Rempah 4 sekawan(1 kayu manis, 2 bunga lawang, 5 biji pelaga, 3 cengkih)",
                    "1 helai daun pandan",
                    "1 tangkai daun kari",
                    "2 sb serbuk cili",
                    "1 sb serbuk kari daging",
                    "1 sk serbuk jintan manis",
                    "1/2 sk serbuk jintan putih",
                    "1/2 sb garam masala",
                    "3 sb sos cili",
                    "2 sb sos tomato",
                    "2 sb sos tiram",
                    "2-3 sb kicap manis",
                    "Sedikit air",
                    "Garam secukup rasa",
                    "1/2-1 sb gula",
                    "Serbuk perasa, jika suka",
                    "Daun ketumbar"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Perap ayam dengan garam dan serbuk kunyit.",
                    "Potong kasar bawang besar, bawang merah kecil, bawang putih dan halia.",
                    "Kisar halus bahan potong kasar dengan sedikit air.",
                    "Bawang merah besar, hiris nipis.",
                    "Potong kasar daun ketumbar.",
                    "Goreng bawang merah besar sampai perang. Kemudian angkat dan tos minyak.",
                    "Goreng ayam sampai garing. Angkat dan ketepikan.",
                    "Tumis rempah 4 sekawan dan daun pandan sampai naik bau.",
                    "Masuk daun kari dan bahan kisar halus. Kacau sampai kering.",
                    "Masukkan rempah garam masala, serbuk kari daging, serbuk cili, serbuk jintan manis dan serbuk jintan putih.",
                    "Tambah air sikit beberapa kali dan tumis  sampai rempah masak dan pecah minyak.",
                    "Masukkan sos cili, sos tomato, sos tiram dan kicap manis.",
                    "Perasakan dengan gula dan garam.",
                    "Masukkan ayam goreng dan bawang goreng (masukkan separuh dulu bawang goreng). Salut biar sekata.",
                    "Boleh tutup api dan tabur lagi dengan bawang goreng dan daun ketumbar untuk hiasan."
                ]
            },
            "tips_and_guides": [
                "Che Nom guna 4 ketul ayam bahagian whole leg, kalau potong biasa dalam 8 ketul.",
                "Masa angkat bawang goreng, kena godak-godak sikit penapis biar minyak mudah tersejat."
            ]
        }
    },
    {
        "title": "Asam Pedas Ayam Johor",
        "page_url": "https://resepichenom.com/kategori/ayam",
        "recipe_url": "https://resepichenom.com/resepi/asam-pedas-ayam-johor",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Asam_Pedas_Ayam.jpg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "50 minit",
            "hidangan": "10 orang",
            "ingredients": {},
            "instructions": {
                "Penyediaan Utama": [
                    "Serai potong 2 dan ketuk.",
                    "Hiris nipis lengkuas, halia, kunyit, bawang merah kecil dan bawang putih.",
                    "Belah 2 bunga kantan dan tomato.",
                    "Gunting cili kering dan rebus 5-8 minit.",
                    "Rendam asam jawa dengan air panas dan ramas.",
                    "Kisar halus bawang merah, bawang putih, halia, kunyit, lengkuas, cili kering dan air.",
                    "Panaskan minyak dan tumis serai",
                    "Masuk bahan kisar halus dan air.",
                    "Masak sampai pecah minyak. Ulang 3 kali tambah air dan masak sampai kering.",
                    "Masukkan ayam dan sambung masak sampai ayam kecut.",
                    "Masukkan bunga kantan, daun kesum, air asam jawa, garam, serbuk seasoning dan air untuk lebih berkuah.",
                    "Reneh sampai ayam masak dan kuah pekat.",
                    "Masuk tomato dan bendi. Kacau sekejap dan boleh tutup api."
                ]
            },
            "tips_and_guides": [
                "Lengkuas kalau keras sangat, hiris nipis-nipis biar senang hancur.",
                "Bahagian batang bunga kantan kalau nak masuk jugak pon boleh, wangii.",
                "Kalau nak lebih berkuah dan cair boleh tambah air."
            ]
        }
    }
]