[
    {
        "recipe_url": "https://myresipi.com/sambal-tempe-kentang/",
        "details": {
            "title": "RESEPI SAMBAL TEMPE KENTANG",
            "image_url": "https://media.myresipi.com/2025/01/sambal-tempe-kentang-1-e1737350103420-600x637.jpg",
            "ingredients": {
                "Bahan-bahan sambal:": [
                    "Cili merah besar",
                    "Cili padi",
                    "Bawang merah",
                    "Bawang putih",
                    "Belacan"
                ],
                "Bahan-bahan lain:": [
                    "Kentang",
                    "Tempe",
                    "Ikan bilis",
                    "Pes asam jawa",
                    "Garam",
                    "Gula",
                    "Serbuk perasa",
                    "Serbuk kunyit"
                ]
            },
            "instructions": [
                "Mula-mula, kisar semua bahan sambal yang telah disediakan (cili merah besar, cili padi, bawang merah, bawang putih dan belacan) menggunakan pengisar.",
                "Sementara itu, goreng kentang, tempe dan ikan bilis dalam minyak panas hingga garing. Kentang dan tempe boleh dipotong kecil atau mengikut saiz yang diinginkan.",
                "Jika suka kacang tanah dalam sambal, boleh masukkan sekali semasa goreng.",
                "Panaskan sedikit minyak dalam kuali, kemudian masukkan bahan kisar yang telah disediakan tadi. Tumis hingga bahan-bahan tersebut masak dan naik bau harum.",
                "Setelah itu, masukkan garam, serbuk perasa, pes asam jawa dan sedikit gula. Tambahkan serbuk kunyit untuk memberi warna dan sedikit rasa.",
                "Setelah sambal tumis cukup masak, masukkan kentang, tempe dan ikan bilis yang telah digoreng tadi.",
                "Kacau rata supaya sambal meresap ke dalam semua bahan gorengan.",
                "Setelah semua bahan tercampur rata dan sambal sudah cukup rasa, sambal tempe anda sudah siap untuk dihidangkan!",
                "Mudah kan? Selamat mencuba!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-sotong-masak-kicap-pedas/",
        "details": {
            "title": "RESEPI SOTONG MASAK KICAP PEDAS",
            "image_url": "https://media.myresipi.com/2025/01/resepi-sotong-masak-kicap-pedas-1-600x662.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Sotong (bersihkan dan dipotong mengikut saiz yang diingini)",
                    "Minyak (untuk menumis)",
                    "Bawang merah 5-6 biji (dikisar)",
                    "Bawang putih 3-4 ulas (dikisar)",
                    "Cili api ikut tahap kepedasan yang diingini (dikisar)",
                    "Cili kisar 1 senduk",
                    "Sos cili 1 sudu besar",
                    "Sos tiram 1-2 sudu besar",
                    "Kicap manis secukupnya (untuk memberi warna gelap)",
                    "Asam jawa sedikit (kuantiti mengikut selera)",
                    "Garam secukup rasa",
                    "Gula secukup rasa (sedikit sahaja untuk seimbangkan pedas)",
                    "Air sotong (jangan dibuang, akan digunakan dalam kuah)",
                    "Hirisan bawang merah (untuk hiasan)",
                    "Cili api (untuk hiasan)"
                ]
            },
            "instructions": [
                "Pertama, matikan air sotong. Tak perlu letak minyak, hanya gunakan api sederhana besar.",
                "Bila sotong keluarkan air dan hampir separa masak, terus tutup api. Jangan biarkan terlalu lama, hanya dalam seminit dua sahaja.",
                "Tapis sotong dan asingkan air sotong ke dalam mangkuk. Jangan buang air sotong, kita akan guna nanti untuk kuah.",
                "Blender bawang merah, bawang putih dan cili api. (Tip: lebihkan bawang merah kalau nak kuah pekat dan banyak)",
                "Panaskan minyak dalam kuali. Bila minyak panas, masukkan bahan yang telah diblender tadi (bawang merah, bawang putih dan cili api).",
                "Tumis sekejap sehingga wangi.",
                "Masukkan satu senduk cili kisar.",
                "Tambahkan sos cili (1 sudu besar), sos tiram dan kicap manis secukupnya. Kicap akan memberikan warna gelap pada sotong.",
                "Masukkan sedikit asam jawa (ikut selera kemasaman yang diinginkan).",
                "Setelah kuah agak masak, masukkan air sotong yang telah dipisahkan tadi.",
                "Tambahkan garam dan gula secukup rasa. Gula sedikit sahaja untuk mengimbangi rasa pedas dari cili api.",
                "Bila kuah hampir kering, tambahkan sedikit air lagi supaya kuah tetap ada.",
                "Kacau kuah hingga semuanya mendidih dan rasa sudah cukup padu.",
                "Masukkan sotong yang telah ditapis tadi. Kacau perlahan dan biarkan sotong dalam kuah selama seminit.",
                "Setelah itu, masukkan hirisan bawang merah dan cili api (jika suka pedas).",
                "Apabila sotong sudah sebati dengan kuah dan rasa sudah padu, tutup api.",
                "Sotong masak kicap pedas siap dihidangkan!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/ayam-masala/",
        "details": {
            "title": "RESIPI AYAM MASALA",
            "image_url": "https://media.myresipi.com/2025/01/ayam-masala-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "1 ekor ayam",
                    "½ cawan yogurt",
                    "Halia (dikisar)",
                    "Bawang putih (dikisar)",
                    "Bawang goreng",
                    "Ketumbar",
                    "Jintan manis",
                    "Jintan putih",
                    "Minyak masak",
                    "2 labu bawang besar (dihiris)",
                    "Daun bay atau salam",
                    "Rempah 4 sekawan (bunga cengkih, bunga lawang, kayu manis, buah pelaga)",
                    "3 sudu besar serbuk cili",
                    "1 sudu besar serbuk kunyit",
                    "1 cawan air",
                    "Garam secukup rasa",
                    "Sedikit gula perang",
                    "Daun ketumbar"
                ]
            },
            "instructions": [
                "1. Mula-mula, sebatikan ayam bersama yogurt, bawang goreng, halia dan bawang putih yang telah dikisar dalam satu bekas, kemudian perap selama 1 jam.",
                "2. Sementara itu, boleh sangai ketumbar, jintan manis dan jintan putih, kemudian tumbuk halus.",
                "3. Seterusnya, panaskan minyak dan tumis bawang besar yang telah dihiris bersama daun bay atau salam dan rempah 4 sekawan.",
                "4. Apabila sudah naik bau, masukkan serbuk cili, serbuk kunyit dan rempah-ratus yang telah ditumbuk tadi, kemudian masak sehingga pecah minyak atau garing.",
                "5. Selepas itu, masukkan ayam yang telah diperap tadi dan tambah air, kemudian biarkan ia mereneh.",
                "6. Akhir sekali, perasakan dengan garam secukup rasa bersama sedikit gula perang dan tabur daun ketumbar. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-sambal-ikan/",
        "details": {
            "title": "RESEPI SAMBAL IKAN SEDAP DAN PADU",
            "image_url": "https://media.myresipi.com/2025/01/resepi-sambal-ikan-1-600x800.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "6 ekor ikan cencaru saiz sederhana (goreng dengan serbuk kunyit dan garam)",
                    "12 biji bawang merah kecil (hiris atau blend)",
                    "6 ulas bawang putih (hiris atau blend)",
                    "3 senduk kecil cili kisar",
                    "Minyak untuk menumis (gunakan minyak yang digunakan untuk menggoreng ikan)",
                    "½ labu bawang holland (hiris atau blend)",
                    "1-2 sudu air asam jawa",
                    "Gula melaka asli (untuk rasa manis, ikut selera)",
                    "Garam dan perasa (secukup rasa)"
                ]
            },
            "instructions": [
                "Hiris atau blend 12 biji bawang merah kecil dan 6 ulas bawang putih. Bawang merah kecil lebih manis dan menjadikan sambal lebih manis secara semulajadi, jadi tak perlu banyak gula.",
                "Panaskan minyak yang digunakan untuk menggoreng ikan, kemudian tumis bawang hiris hingga naik bau.",
                "Bila bawang dah kuning dan harum, masukkan 3 senduk kecil cili kisar. Tingkatkan sedikit api.",
                "Setelah cili garing, tambah sedikit air dan biarkan sambal mereneh 2-3 kali. Perlahankan api jika perlu. Setelah sambal agak kering, tambah lagi sedikit air dan teruskan mereneh. Masukkan setengah labu bawang Holland yang dihiris (atau blend). Bawang Holland akan memberikan rasa manis dan kelembutan pada sambal.",
                "Masukkan 1-2 sudu air asam jawa untuk rasa masam yang segar.",
                "Untuk rasa manis, tambahkan gula melaka asli. Gula melaka memberi rasa lemak-lemak pada sambal. Tambahkan garam dan perasa mengikut selera.",
                "Akhir sekali, masukkan ikan yang telah digoreng tadi dan renehkan seketika agar sambal meresap ke dalam ikan."
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/sayur-campur-goreng/",
        "details": {
            "title": "RESIPI SAYUR CAMPUR GORENG",
            "image_url": "https://media.myresipi.com/2025/01/sayur-campur-goreng-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Bawang putih",
                    "Bawang holland",
                    "Fishball",
                    "Lobak merah",
                    "Sos tiram",
                    "Air",
                    "Kubis bunga",
                    "Brokoli",
                    "Cili merah",
                    "Garam",
                    "Serbuk perasa"
                ]
            },
            "instructions": [
                "1. Mula-mula, tumis bawang putih dan bawang holland sehingga naik bau.",
                "2. Selepas itu, masukkan fishball dan masak sebentar.",
                "3. Masukkan lobak merah, sos tiram dan sedikit air, kemudian masak sebentar.",
                "4. Masukkan kubis bunga, brokoli dan cili merah, kemudian masak sehingga sayur separuh lembut.",
                "5. Akhir sekali, perasakan dengan garam dan serbuk perasa jika perlu. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/kari-ayam-pedas-tanpa-santan/",
        "details": {
            "title": "RESEPI KARI AYAM PEDAS TANPA SANTAN",
            "image_url": "https://media.myresipi.com/2025/01/kari-ayam-pedas-tanpa-santan-1-e1737081619240-600x422.jpg",
            "ingredients": {
                "Bahan-bahan untuk diblender:": [
                    "1 ½ biji bawang besar",
                    "1 ½ inci halia (lebih kurang)",
                    "2 ulas bawang putih",
                    "1 batang serai",
                    "12 tangkai cili kering (dibuang biji dan rendam dalam air panas)"
                ],
                "Bahan-bahan lain:": [
                    "Daun kari",
                    "3 sekawan (kulit kayu manis, bunga lawang, buah pelaga – tapi saya tak masukkan buah pelaga)",
                    "2 paket kecil serbuk kari ayam/daging Babas (25g)",
                    "Serbuk cili (mengikut citarasa)",
                    "4 sudu kecil gula merah",
                    "½ sudu kecil gula pasir",
                    "Garam secukup rasa",
                    "2/3 biji kentang (dipotong)",
                    "1-2 biji cili besar (optional)",
                    "1 biji tomato (optional, saya tak masukkan)"
                ]
            },
            "instructions": [
                "Panaskan minyak dalam periuk. Setelah minyak panas, tumis 3 sekawan (kulit kayu manis, bunga lawang) bersama daun kari. Tumis sehingga wangi.",
                "Masukkan bahan yang diblender tadi dan masak sehingga pecah minyak.",
                "Setelah pecah minyak, masukkan serbuk kari, serbuk cili dan sedikit air. Masak lagi hingga tumisan pecah minyak.",
                "Tambahkan ayam dan sedikit air. Masak sehingga ayam empuk.",
                "Masukkan gula merah dan kentang. Anda boleh tambahkan sedikit lagi serbuk cili mengikut selera.",
                "Masak kentang hingga empuk. Kemudian, perasakan dengan garam dan gula pasir.",
                "Optional: Anda boleh menambah cili besar atau tomato, tetapi saya hanya masukkan cili besar.",
                "Kari ayam pedas tanpa santan siap untuk dihidangkan!",
                "Kurangkan air kerana tidak menggunakan santan, supaya kuah tidak terlalu cair. Kuah akan menjadi lebih pekat dan sedap.",
                "Jika tidak suka terlalu pedas, boleh kurangkan cili."
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/sotong-bakar-sambal/",
        "details": {
            "title": "RESIPI SOTONG BAKAR SAMBAL",
            "image_url": "https://media.myresipi.com/2025/01/sotong-bakar-sambal-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Sotong (saiz besar)",
                    "10 tangkai lada kering (dikisar)",
                    "4 ulas bawang kecil",
                    "1 biji bawang besar",
                    "4 ulas bawang putih",
                    "4 biji buah keras",
                    "1 batang serai",
                    "2 sudu besar sos tiram",
                    "Air asam jawa secukupnya",
                    "Garam dan gula",
                    "Sedikit minyak masak"
                ]
            },
            "instructions": [
                "1. Mula-mula, bersihkan sotong dan kelar, tapi jangan sampai putus, kelar sedikit saja.",
                "2. Selepas itu, kisar semua bahan iaitu lada, bawang, buah keras dan serai.",
                "3. Kemudian, masukkan sos tiram dan air asam jawa.",
                "4. Perasakan garam dan gula, kemudian masukkan minyak masak.",
                "5. Seterusnya, ratakan sambal ke atas pemanggang, letakkan sotong dan tutup permukaan sotong dengan lebihan sambal.",
                "6. Masaklah lebih kurang 5 hingga 6 minit.",
                "7. Bagi mengeringkan air sotong, buka tutup pemanggang dan teruskan memanggang (balik-balikkan sotong) sehingga masak. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-ayam-masak-halia/",
        "details": {
            "title": "RESEPI AYAM MASAK HALIA",
            "image_url": "https://media.myresipi.com/2025/01/resepi-ayam-masak-halia-1-400x533.jpeg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Bawang putih (ditumbuk kasar)",
                    "Halia (dihiris)",
                    "Ayam",
                    "Cili kering",
                    "Kicap manis/pekat",
                    "Sos tiram",
                    "Minyak bijan",
                    "1 kiub pati ayam",
                    "Cendawan shitake",
                    "Sedikit air",
                    "Sedikit gula",
                    "Cili padi (jika suka pedas)",
                    "Daun bawang"
                ]
            },
            "instructions": [
                "Tumiskan bawang putih yang ditumbuk kasar.",
                "Selepas itu, masukkan juga hirisan halia untuk ditumis bersama bawang putih.",
                "Kemudian, masukkan ayam dan gaul sebati dengan bahan tumis tadi. (Jangan masukkan air.)",
                "Seterusnya, masukkan pula cili kering dan tutup periuk.",
                "Selepas buka penutup periuk, akan nampak air ayam sudah keluar menjadi kuah.",
                "Langkah seterusnya, masukkan kicap manis atau pekat, sos tiram, minyak bijan dan kiub ayam.",
                "Gaul sehingga semua bahan mesra dan bercampur sebati. Kemudian, tutup periuk sekali lagi untuk biarkan bahan-bahan meresap ke dalam ayam.",
                "Bila bukak penutup periuk, masukkan pula cendawan shitake dan tambahkan sedikit air.",
                "Jangan lupa perasakan dengan sedikit gula.",
                "Jika suka pedas, boleh tambahkan cili api.",
                "Tutup periuk dan perlahankan api. Biarkan selama 6-7 minit.",
                "Akhir sekali, masukkan daun bawang. (Lagi banyak, lagi sedap.)",
                "Sedia untuk dihidangkan, selamat mencuba!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/sambal-kerang/",
        "details": {
            "title": "RESIPI SAMBAL KERANG",
            "image_url": "https://media.myresipi.com/2025/01/sambal-kerang-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Cili kering",
                    "Bawang besar",
                    "Bawang putih",
                    "Halia",
                    "Kerang",
                    "3 sudu besar santan",
                    "Garam",
                    "Gula",
                    "Ajinomoto (tak letak pun tak apa)"
                ]
            },
            "instructions": [
                "1. Mula-mula, kisar cili kering, bawang besar, bawang putih, halia dan kerang sehingga lumat.",
                "2. Selepas itu, panaskan minyak dan tumis bahan yang sudah dikisar tadi.",
                "3. Apabila sudah tumis, masukkan garam, gula dan ajinomoto, kemudian masak sampai pecah minyak.",
                "4. Setelah itu, masukkan santan dan gaul sebati.",
                "5. Tunggu sampai 5 minit dan masukkan kerang, kemudian kacau-kacau.",
                "6. Akhir sekali, tunggu sampai betul-betul masak. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/ayam-percik-air-fryer/",
        "details": {
            "title": "RESIPI AYAM PERCIK AIR FRYER",
            "image_url": "https://media.myresipi.com/2025/01/ayam-percik-air-fryer-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "2 bahagian paha ayam penuh",
                    "2 ulas bawang putih",
                    "6 ulas bawang merah atau 1 bawang besar",
                    "3 inci halia",
                    "2 batang serai (dipotong kecil)",
                    "2 sudu cili boh (nak tambah pedas, letak lebih)",
                    "¼ cawan santan pekat",
                    "Gula dan garam secukup rasa",
                    "2 sudu besar minyak masak"
                ]
            },
            "instructions": [
                "1. Mula-mula, kisar bawang putih, bawang merah atau bawang besar, halia dan serai bersama cili boh, santan pekat, gula dan garam secukup rasa.",
                "2. Selepas itu, sapukan bahan perapan pada kedua-dua bahagian paha ayam penuh.",
                "3. Kemudian, letak minyak masak dalam 2 sudu besar dan gaulkan dengan ayam bersama bahan perapan.",
                "4. Seterusnya, perap ayam selama lebih 2 jam. Semakin lama perap, semakin sedap isi ayam.",
                "5. Setelah itu, bakar ayam dalam air fryer dengan menggunakan suhu 170ºC selama 15 minit.",
                "6. Akhir sekali, alihkan ayam dan bakar sebelah lagi dengan suhu yang sama selama 10 minit saja. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-tomyam-campur-ala-kedai-siam/",
        "details": {
            "title": "RESEPI TOMYAM CAMPUR ALA KEDAI SIAM",
            "image_url": "https://media.myresipi.com/2025/01/resepi-tomyam-campur-ala-kedai-siam-1-400x533.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Bawang holland",
                    "Bawang putih",
                    "Lengkuas",
                    "Serai",
                    "Akar ketumbar",
                    "Daun limau purut",
                    "Isi ayam",
                    "Pes tomyam",
                    "Thai cili paste",
                    "Lobak merah",
                    "Sotong",
                    "Udang",
                    "Susu cair",
                    "Sos sotong",
                    "Cili yang diketuk",
                    "Tomato",
                    "Cendawan",
                    "Daun ketumbar"
                ]
            },
            "instructions": [
                "Panaskan air dalam periuk. Masukkan bawang holland, bawang putih yang diketuk, lengkuas, serai, akar ketumbar dan daun limau purut.",
                "Kemudian, tambahkan juga isi ayam.",
                "Selepas bahan-bahan tadi sudah mendidih dan mengeluarkan aroma yang harum, letakkan pes tomyam dan thai chili paste.",
                "Seterusnya, masukkan lobak merah, sotong dan udang.",
                "Letakkan juga susu cair dan sos sotong.",
                "Tambahkan juga cili yang diketuk jika suka pedas.",
                "Jangan lupa letakkan tomato yang sudah dibelah empat.",
                "Jika suka, boleh juga tambahkan cendawan.",
                "Kacau sebati sehingga semua bahan bercampur mesra.",
                "Akhir sekali taburkan dengan daun ketumbar.",
                "Siap dan sedia untuk dihidangkan. Selamat mencuba!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/menu-telur-mata-cabai-bawang/",
        "details": {
            "title": "MENU TELUR MATA CABAI BAWANG",
            "image_url": "https://media.myresipi.com/2025/01/menu-telur-mata-cabai-bawang-1-600x686.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "4 biji telur",
                    "1 labu bawang merah saiz sederhana (dihiris)",
                    "3 ulas bawang putih (dihiris)",
                    "1 biji cili semerah (dipotong)",
                    "2 biji cili api hijau Thailand (dipotong)",
                    "Sedikit mushroom seasoning (atau perasa pilihan)"
                ]
            },
            "instructions": [
                "Goreng 4 biji telur mengikut keinginan (saya suka telur kuning masih cair), kemudian ketepikan.",
                "Panaskan sedikit minyak. Tumis bawang merah dan bawang putih yang dihiris hingga wangi.",
                "Tambahkan cili semerah dan cili api hijau Thailand yang dipotong. Tumis hingga bahan layu.",
                "Perasakan dengan sedikit mushroom seasoning atau perasa pilihan.",
                "Angkat dan taburkan bahan tumisan atas telur goreng tadi.",
                "Hidangkan dengan nasi putih panas. Siap untuk dinikmati!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/bawal-masak-stim/",
        "details": {
            "title": "RESIPI BAWAL MASAK STIM",
            "image_url": "https://media.myresipi.com/2025/01/bawal-masak-stim-1.jpg",
            "ingredients": {
                "Bahan A:": [
                    "Cili padi",
                    "Bawang putih",
                    "Halia",
                    "Minyak"
                ],
                "Bahan B:": [
                    "Sos tiram",
                    "Secubit garam",
                    "Sedikit air putih",
                    "Ikan bawal emas"
                ]
            },
            "instructions": [
                "1. Mula-mula, tumis Bahan A iaitu cili padi, bawang putih dan halia dengan sedikit minyak.",
                "2. Selepas naik bau, letak bahan tumis tadi ke dalam mangkuk.",
                "3. Kemudian, masukkan bahan B iaitu sos tiram, garam dan air putih.",
                "4. Selepas itu, kacau-kacau dan gaul sekali dengan ikan bawal emas.",
                "5. Seterusnya, letak dalam bekas yang sesuai untuk distimkan.",
                "6. Akhir sekali, stim sampai ikan masak. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-mi-goreng-sedap/",
        "details": {
            "title": "RESEPI MI GORENG SEDAP",
            "image_url": "https://media.myresipi.com/2025/01/resepi-mi-goreng-sedap-1-400x533.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "2-3 ulas bawang putih (ketuk)",
                    "Cili giling",
                    "Sos cili dan sos 3 rasa (jenama Mahsuri)",
                    "Ayam",
                    "Udang",
                    "Mi kuning",
                    "Sawi",
                    "Kicap mee",
                    "Kiub ayam (jenama pilihan)"
                ]
            },
            "instructions": [
                "Mula-mula, panaskan minyak dan tumis bawang putih dan cili giling sehingga naik bau wangi.",
                "Kemudian, masukkan udang dan ayam. Kacau rata dan masak sehingga berubah warna. (Tip: Nak lagi sedap, boleh tambah sotong!)",
                "Masukkan sos cili, sos 3 rasa, dan kiub ayam. Kacau sebati dan biarkan seketika sehingga bahan-bahan mesra.",
                "Masukkan mi kuning dan sedikit air panas. Gaul rata supaya mi lembut dan terserap perasa.",
                "Akhir sekali, masukkan sawi dan kicap mee. Kacau lagi sehingga semua bahan masak sekata dan mi berwarna cantik.",
                "Untuk elakkan mi kembang, bila dah nak siap, letak air panas, kacau sedikit dan tutup api."
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-makaroni-bakar-mini/",
        "details": {
            "title": "RESEPI MAKARONI BAKAR MINI",
            "image_url": "https://media.myresipi.com/2025/01/resepi-makaroni-bakar-mini-3-400x533.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "1 pek macaroni (400 gram) – saya guna jenama Kimball",
                    "1 tin sos Prego – Traditional",
                    "1 tin sos Prego – Cendawan",
                    "3-4 ketul cendawan butang (dipotong dadu)",
                    "Ayam cincang Ramly (boleh juga guna daging cincang, pilihan)",
                    "Sosej (dipotong dadu)",
                    "1 biji bawang besar (dicincang)",
                    "Serbuk oregano/parsley (jika tiada, tidak mengapa)",
                    "4-5 biji telur",
                    "Cheese slice (jenis apa pun boleh)",
                    "Mozarella cheese (untuk topping, jika mahu)",
                    "Saiz cup kecil"
                ]
            },
            "instructions": [
                "Rebus macaroni hingga lembut. Masukkan 1 sudu garam dan 2-3 sudu minyak untuk mengelakkan ia melekat. Setelah lembut, toskan.",
                "Tumiskan bawang besar hingga naik bau.",
                "Masukkan ayam cincang, kacau hingga masak, kemudian tambah sosej dan cendawan.",
                "Tuangkan sos Prego, kacau rata. Jika sos terlalu pekat, tambah sedikit air. Perasakan dengan garam dan gula secukupnya.",
                "Gaulkan macaroni dengan sos tersebut hingga sebati, kemudian matikan api.",
                "Masukkan macaroni ke dalam bekas asing kerana ia perlu digaul dengan telur.",
                "Gaulkan macaroni dengan telur hingga sebati, kemudian agihkan ke dalam cup kecil.",
                "Letakkan sehelai cheese slice di atas setiap cup dan taburkan sedikit mozarella cheese serta serbuk parsley.",
                "Bakar pada suhu 170°C selama 30 minit. Siap untuk dinikmati!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/sambal-daun-kayu-tempoyak/",
        "details": {
            "title": "RESIPI SAMBAL DAUN KAYU TEMPOYAK",
            "image_url": "https://media.myresipi.com/2025/01/sambal-daun-kayu-tempoyak-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Cili api",
                    "Kunyit hidup (serbuk pun boleh)",
                    "Serai",
                    "Bawang kecil",
                    "Pucuk ubi",
                    "Daun kunyit",
                    "Ikan bilis (digoreng garing atau tak, terpulang)",
                    "Petai",
                    "Santan pekat",
                    "Tempoyak",
                    "Asam keping"
                ]
            },
            "instructions": [
                "1. Mula-mula, kisar cili api, kunyit hidup, serai dan sedikit ikan bilis dengan sedikit air.",
                "2. Selepas itu, mayang atau hiris halus bawang kecil, pucuk ubi dan daun kunyit.",
                "3. Kemudian, rebus pucuk ubi sampi empuk.",
                "4. Dalam kuali atau periuk, masukkan sedikit minyak dan tumis bahan kisar serta bawang kecil yang telah dihiris tadi.",
                "5. Apabila bahan tumis sudah naik bau, masukkan tempoyak.",
                "6. Seterusnya, tumis lagi sampi naik minyak sedikit dan masukkan santan pekat.",
                "7. Setelah itu, masukkan asam keping, perasa Maggi, garam dan gula.",
                "8. Apabila kuah sudah mendidih, masukkan pucuk ubi, daun kunyit, ikan bilis dan petai. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-salad-timun-dan-tuna/",
        "details": {
            "title": "RESEPI SALAD TIMUN DENGAN TUNA",
            "image_url": "https://media.myresipi.com/2025/01/resepi-salad-timun-dengan-tuna-2-400x533.jpeg",
            "ingredients": {
                "Bahan-bahan:": [
                    "1 1/2 batang timun jepun",
                    "1 biji bawang merah",
                    "2 ulas bawang putih",
                    "2 hingga 3 sudu besar cream cheese",
                    "2 sudu besar yogurt asli",
                    "1 tin tuna chunks",
                    "1 sudu besar jus lemon",
                    "Blackpepper, garam dan chili flakes secukupnya",
                    "1 sudu teh capers (optional)"
                ]
            },
            "instructions": [
                "Sediakan semua bahan yang diperlukan seperti dalam senarai di atas.",
                "Hiris nipis timun jepun dan bawang merah.",
                "Kemudian, cincang halus bawang putih.",
                "Selepas itu, satukan semua bahan yang sudah tersedia ke dalam satu bekas.",
                "Gaul sehingga semua bahan bercampur dengan mesra dan sebati.",
                "Siap dan sedia untuk dihidangkan. Selamat mencuba!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/kari-sotong-mamak//",
        "details": {
            "title": "RESIPI KARI SOTONG MAMAK",
            "image_url": "https://media.myresipi.com/2025/01/kari-sotong-mamak-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Sotong",
                    "Bawang besar",
                    "Bawang putih",
                    "Rempah kari ikan",
                    "Daun kari",
                    "Halba campur",
                    "Air asam jawa",
                    "Cili besar"
                ]
            },
            "instructions": [
                "1. Mula-mula, kisar bawang putih dan bawang besar.",
                "2. Selepas itu, panaskan sedikit minyak dan tumis seketika halba campur.",
                "3. Kemudian, masukkan daun kari dan tumis lagi sehingga naik bau.",
                "4. Masukkan bahan kisar dan tumis lagi sekejap.",
                "5. Letak cili kisar atau serbuk cili bersama rempah kari ikan. Kali ini, kacau sebati.",
                "6. Tuang sedikit air dan kali ini, tumis sehingga pecah minyak.",
                "7. Apabila sudah pecah minyak, masukkan garam, Maggi cukup rasa, sedikit gula dan sebatikan.",
                "8. Masukkan pula air asam jawa dan kacau lagi bagi rata.",
                "9. Apabila bahan rempah sudah merenih, masukkan sotong dan kacau rata.",
                "10. Seterusnya, tutup seketika agar sotong masak. Jangan masak lama sangat sebab nanti sotong keras, masak sekejap saja.",
                "11. Letakkan cili besar yang telah dipotong halus dan renihkan sebentar saja. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-nasi-goreng-cina/",
        "details": {
            "title": "RESEPI NASI GORENG CINA",
            "image_url": "https://media.myresipi.com/2025/01/resepi-nasi-goreng-cina-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Nasi",
                    "5 ulas besar bawang putih (ketuk-ketuk dengan lesung batu, kemudian cincang halus)",
                    "2 hingga 3 sudu besar serbuk Maggi cukup rasa",
                    "1 hingga 2 sudu besar minyak bijan",
                    "Udang hidup",
                    "4 hingga 5 biji telur",
                    "1 mangkuk sayur campur"
                ]
            },
            "instructions": [
                "1. Mula-mula, panaskan minyak, tumis bawang putih sampai naik bau dan garing sikit.",
                "2. Kemudian, masukkan udang dan biarkan masak sekejap.",
                "3. Selepas itu, ketepikan udang dan masukkan telur. Kecikkan api sedikit untuk telur masak elok, kemudian pecah-pecahkan telur tersebut.",
                "4. Masukkan nasi dan sayur campur, kemudian gaul rata.",
                "5. Seterusnya, taburkan Maggi cukup rasa dan kacau sekejap.",
                "6. Setelah itu, masukkan minyak bijan dan kacau lagi.",
                "7. Akhir sekali, boleh rasa dan jika nak, tambah lagi serbuk Maggi cukup rasa atau minyak bijan mengikut citarasa masing-masing. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/terung-masak-sambal-berlada//",
        "details": {
            "title": "RESIPI TERUNG MASAK SAMBAL BERLADA",
            "image_url": "https://media.myresipi.com/2025/01/terung-masak-sambal-berlada-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Terung",
                    "Minyak masak",
                    "Bawang merah",
                    "Bawang putih",
                    "Cili merah",
                    "Cili padi",
                    "Ikan bilis",
                    "Asam jawa",
                    "Garam",
                    "Sedikit gula perang"
                ]
            },
            "instructions": [
                "1. Mula-mula, goreng terung dan ikan bilis sehingga garing terlebih dahulu, angkat dan toskan, ketepikan dahulu.",
                "2. Selepas itu, kisar bawang merah, bawang putih, cili merah dan cili padi secara kasar saja.",
                "3. Kemudian, boleh masak bahan kisar cili sampai garing.",
                "4. Seterusnya, masukkan terung dan ikan bilis yang telah digoreng tadi.",
                "5. Akhir sekali, letak sedikit asam jawa, garam dan gula perang untuk seimbangkan rasanya. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/ayam-masak-kunyit-halia/",
        "details": {
            "title": "RESIPI AYAM MASAK KUNYIT HALIA",
            "image_url": "https://media.myresipi.com/2025/01/ayam-masak-kunyit-halia-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "½ ekor ayam (potong kecil-kecil, bersihkan)",
                    "1 sudu kecil secukup rasa MAGGI",
                    "1 sudu kecil serbuk kunyit",
                    "Bawang besar (hiasan)",
                    "1 sudu kecil garam",
                    "1 senduk atau 2 sudu besar cili boh",
                    "Cili (hiasan)",
                    "1 ibu jari halia (hiris)",
                    "1 asam keping",
                    "½ cawan minyak masak",
                    "1½ cawan air"
                ]
            },
            "instructions": [
                "1. Mula-mula, potong ½ ekor ayam ayam secara kecil-kecil dan bersihkan.",
                "2. Selepas itu, masukkan semua bahan kecuali bahan hiasan.",
                "3. Kemudian, masukkan air dalam 1½ cawan (bagi ayam separa tenggelam) untuk rebuskan dengan bahan-bahan.",
                "4. Seterusnya, rebuskan ayam dalam 10 hingga 15 minit sehingga air rebusan ayam kering.",
                "5. Setelah itu, perasakan ikut cara masing-masing jika nak tambah gula atau garam.",
                "6. Hiris bahan hiasan dan masukkan minyak masak, tapi pastikan api masih perlahan.",
                "7. Masak lebih kurang dalam 5 minit supaya ayam sedikit garing dan kering.",
                "8. Akhir sekali, hiaskan dengan bawang besar dan cili yang telah dihiris tadi. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/daging-dendeng-balado-cili-hijau/",
        "details": {
            "title": "RESIPI DAGING DENDENG BALADO CILI HIJAU",
            "image_url": "https://media.myresipi.com/2025/01/daging-dendeng-balado-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "500 gram daging lembu (dihiris nipis, direbus selama 10 minit, kemudian tumbuk daging supaya lebih empuk)",
                    "3 helai daun limau purut",
                    "100 gram cili hijau (jika nak pedas, boleh tambah lada cayenne hijau)",
                    "1 tomato hijau",
                    "6 ulas bawang merah"
                ],
                "Bahan rempah kisar:": [
                    "3 ulas bawang putih",
                    "1 sudu kecil ketumbar",
                    "1 ruas halia"
                ]
            },
            "instructions": [
                "1. Mula-mula, hiris nipis daging lembu, rebus selama 10 minit, kemudian tumbuk daging supaya lebih empuk (air rebusan daging jangan dibuang dulu).",
                "2. Setelah selesai ditumbuk, goreng sebentar lebih kurang 5 minit.",
                "3. Selepas itu, kisar kasar cili hijau, bawang merah (tak terlalu halus) dan hiris tomato hijau.",
                "4. Kemudian, tumis rempah kisar sehingga masak.",
                "5. Masukkan daun limau purut, cili hijau dan tomato, kemudian tumis sehingga agak layu.",
                "6. Seterusnya, masukkan daging yang telah digoreng bersama ½ cawan air rebusan untuk merebus daging.",
                "7. Akhir sekali, perasakan dengan garam, gula, serbuk stok dan masak sehingga kuah menyerap, kemudian sesuaikan rasanya. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/telur-dadar-tebal/",
        "details": {
            "title": "RESIPI TELUR DADAR TEBAL",
            "image_url": "https://media.myresipi.com/2025/01/telur-dadar-tebal-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "2 biji telur",
                    "1 sudu besar tepung jagung",
                    "1 sudu besar air",
                    "2 sudu besar sos ikan",
                    "Minyak masak (untuk menggoreng)"
                ]
            },
            "instructions": [
                "1. Mula-mula, masukkan 1 sudu besar tepung jagung ke dalam mangkuk. Letak sekadar penuh saja.",
                "2. Selepas itu, masukkan 1 sudu besar air dan sebatikan dengan tepung tadi sampai tak berketul.",
                "3. Kemudian, pecahkan 2 biji telur dan letakkan 2 sudu besar sos ikan (rahsia telur dadar sedap). Jika tiada, boleh ganti dengan garam, serbuk perasa, ajinomoto atau mushroom seasoning sebab sedap juga.",
                "4. Seterusnya, kacau kuat-kuat dengan menggunakan garfu sampai adunan naik berbuih lebih kurang selama seminit.",
                "5. Pastikan minyak sudah betul-betul panas dan masukkan telur dengan cara angkat tinggi, kemudian tuang. Jika nak telur dadar gebu dan garing, kena letak minyak lebih sedikit.",
                "6. Selepas bahagian bawah sudah garing, boleh terbalikkan telur dadarnya. Jika belum, tunggu sampai ia garing.",
                "7. Akhir sekali, tunggu bahagian sebelah bawah garing lagi. Terpulang nak letak bawang, daun sup atau cili. Angkat dan toskan. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/ikan-siakap-pedas-manis//",
        "details": {
            "title": "RESIPI IKAN SIAKAP PEDAS MANIS",
            "image_url": "https://media.myresipi.com/2025/01/ikan-siakap-pedas-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "1 ekor ikan siakap",
                    "1 biji bawang besar",
                    "3 ulas bawang putih",
                    "4 sudu cili kisar",
                    "3 biji cili padi (dipecahkan, jika nak lebih pedas, tambah saja)",
                    "2 helai daun limau",
                    "4 sudu sos cili (boleh tambah jika nak)",
                    "½ inci halia",
                    "1/3 batang kayu manis Ceylon",
                    "1 biji bunga lawang"
                ]
            },
            "instructions": [
                "1. Mula-mula, panaskan minyak dan goreng ikan siakap sehingga garing, angkat dan ketepikan dahulu.",
                "2. Selepas itu, guna sedikit minyak goreng ikan tadi dan masukkan bawang besar, bawang putih, halia, kayu manis Ceylon serta bunga lawang.",
                "3. Tumis bahan-bahan tersebut sehingga wangi, kemudian masukkan terus cili kisar dan masak sampai pecah minyak.",
                "4. Guna api sederhana saja untuk mengelakkan sambal tak masak. Setelah pecah minyak, masukkan sos cili dengan cili padi dan kacau rata.",
                "5. Masukkan ikan siakap dan kacau bagi sebati dengan sambal, kemudian biar sekejap lebih kurang dalam 30 saat.",
                "6. Seterusnya, masukkan sedikit air (saya masukkan lebih sedikit tapi tak cair).",
                "7. Akhir sekali, masukkan sedikit garam (fungsi garam dapat naikkan rasa dan bau masakan). Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/sup-ayam-thai/",
        "details": {
            "title": "RESEPI SUP AYAM THAI",
            "image_url": "https://media.myresipi.com/2024/12/sup-ayam-thai-1-600x600.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "1 ekor ayam (dipotong kecil)",
                    "1 batang serai (diketuk)",
                    "2 helai daun limau purut",
                    "2 biji tomato (dipotong kecil)",
                    "1 batang celery (dipotong kecil)",
                    "1 biji lobak merah (dipotong bulat)",
                    "2 kiub pati ayam",
                    "1 pek sup bunjut Adabi",
                    "2 sudu besar sos ikan Thai",
                    "1 sudu kecil gula",
                    "Garam secukup rasa",
                    "Air secukupnya"
                ],
                "Bahan tumis:": [
                    "3 ulas bawang putih (tumbuk)",
                    "1 inci halia (tumbuk)",
                    "3 biji bawang merah (hiris)",
                    "1 biji bawang besar (hiris)",
                    "2 tangkai cili padi (ketuk kasar)",
                    "1 batang serai (hiris halus)"
                ],
                "Bahan tambahan:": [
                    "Daun ketumbar (untuk hiasan)",
                    "Daun sup (untuk hiasan)",
                    "Cili potong (untuk hiasan)",
                    "1 biji limau nipis (perahan jus)"
                ]
            },
            "instructions": [
                "Panaskan sedikit minyak dan tumis semua bahan tumis di atas api perlahan. Tumis sehingga bahan-bahan garing, layu dan mengeluarkan bau wangi.",
                "Setelah itu, masukkan air secukupnya dan biarkan mendidih.",
                "Masukkan ayam, daun saderi (celery) dan lobak merah (carrot). Biarkan ayam dan lobak merah masak dengan sempurna.",
                "Kemudian, masukkan kiub pati ayam, sup bunjut Adabi, garam, gula dan sos ikan Thai. Kacau rata.",
                "Akhir sekali, masukkan daun ketumbar, daun sup, cili potong, tomato, daun limau purut dan perahan asam limau nipis. Kacau seketika dan biarkan seketika di atas api."
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/cara-masak-sup-kaki-ayam/",
        "details": {
            "title": "CARA MASAK SUP KAKI AYAM TANPA TUMIS",
            "image_url": "https://media.myresipi.com/2024/12/cara-masak-sup-kaki-ayam-1-600x800.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Kaki ayam",
                    "Sup bunjut",
                    "Bawang putih",
                    "Halia",
                    "Daun bawang",
                    "Garam",
                    "Air"
                ]
            },
            "instructions": [
                "Pastikan kaki ayam dibersihkan dengan teliti. Potong kuku dan cuci bersih.",
                "Masukkan kaki ayam yang telah dibersihkan ke dalam periuk. Tuang air secukupnya.",
                "Masukkan bawang putih, sup bunjut, garam secukup rasa, halia dan daun bawang.",
                "Didihkan dan kemudian renehkan sup sehingga kaki ayam empuk. Jangan terlalu lama sampai hancur tulangnya.",
                "Tutup api dan hidangkan sup kaki ayam panas-panas.",
                "Selamat mencuba!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/sup-sayur-campur/",
        "details": {
            "title": "RESEPI SUP SAYUR CAMPUR",
            "image_url": "https://media.myresipi.com/2024/12/sup-sayur-campur-1-e1735180890142-600x628.jpg",
            "ingredients": {
                "Bahan tumbuk halus:": [
                    "Bawang putih",
                    "Bawang merah"
                ],
                "Bahan-bahan:": [
                    "Lobak merah",
                    "Kubis",
                    "Bebola daging",
                    "Kentang",
                    "Daun bawang"
                ]
            },
            "instructions": [
                "Hiris semua bahan sayur.",
                "Haluskan perasa bawang besar.",
                "Tumis bawang besar hingga naik bau. Masukkan air dan masak hingga air mendidih.",
                "Masukkan semua sayur yang telah dipotong. Masak hingga empuk, kemudian masukkan garam, perasa dan gula pasir.",
                "Sup sayur sedia untuk dihidangkan."
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-masak-lemak-ayam-cili-padi/",
        "details": {
            "title": "RESEPI MASAK LEMAK AYAM CILI PADI",
            "image_url": "https://media.myresipi.com/2024/12/resepi-masak-lemak-2.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "1 ekor ayam",
                    "5 ulas bawang merah",
                    "8 tangkai cili merah hidup",
                    "15 tangkai cili padi hijau (jika tak tahan pedas, guna 7 tangkai saja)",
                    "½ inci kunyit hidup",
                    "Garam",
                    "½ cawan santan pekat",
                    "1 cawan santan cair (santan segar atau santan kotak)",
                    "Kentang",
                    "Tomato",
                    "Daun kunyit"
                ]
            },
            "instructions": [
                "1. Mula-mula, kisar atau tumbuk bawang merah, cili merah hidup, cili padi hijau dan kunyit hidup.",
                "2. Selepas itu, tumis minyak masak dengan bahan yang ditumbuk.",
                "3. Kemudian, masukkan ayam, kentang dan santan cair.",
                "4. Seterusnya, kacau dengan api perlahan sampai mendidih.",
                "5. Setelah mendidih dan agak-agak ayam dan kentang sudah empuk, masukkan santan pekat dan tunggu sampai mendidih lagi sekali.",
                "6. Akhir sekali, masukkan tomato dan tabur daun kunyit. Jika pekat sangat, tambah air mengikut selera masing-masing. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-ikan-bilis-kentang-terung-tempe-berlado/",
        "details": {
            "title": "RESEPI IKAN BILIS KENTANG TERUNG BERLADO",
            "image_url": "https://media.myresipi.com/2024/12/resepi-ikan-bilis-kentang-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Ikan bilis",
                    "Kentang (dipotong dadu)",
                    "Terung (dipotong memanjang)",
                    "Tempe",
                    "Bawang putih",
                    "Bawang merah",
                    "Cili api merah",
                    "Cili besar",
                    "Belacan",
                    "Bawang holland (dihiris besar)",
                    "Garam",
                    "Gula"
                ]
            },
            "instructions": [
                "1. Mula-mula, kisar kasar bawang putih, bawang merah, cili api merah, cili besar, belacan dan ketepikan dahulu.",
                "2. Selepas itu, goreng ikan bilis, kentang, terung dan tempe sehingga garing (semua bahan ini tak perlu gaul dengan kunyit), angkat dan toskan.",
                "3. Kemudian, tumis bahan kisar sampai garing dan naik bau.",
                "4. Seterusnya, masukkan garam, gula dan bawang holland.",
                "5. Akhir sekali, masukkan bahan yang telah digoreng tadi dan gaul sebati. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-perap-ayam-bakar/",
        "details": {
            "title": "RESEPI PERAP AYAM BAKAR",
            "image_url": "https://media.myresipi.com/2024/12/resepi-perap-ayam-bakar-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Ayam atau daging",
                    "Bawang merah",
                    "Bawang putih",
                    "Cili kering",
                    "Serai",
                    "Serbuk kunyit",
                    "Garam",
                    "Gula (kena lebih)"
                ]
            },
            "instructions": [
                "1. Mula-mula, kisar serai, bawang merah, bawang putih dan cili kering dengan sedikit air.",
                "2. Selepas itu, tuangkan bahan kisar ke dalam bekas lain.",
                "3. Masukkan garam, gula dan serbuk kunyit, kemudian kacau sebati.",
                "4. Seterusnya, masukkan potongan ayam atau daging dan perap seketika (boleh perap semalaman jika nak lebih sedap).",
                "5. Akhir sekali, boleh dibakar dengan menggunakan arang, ketuhar atau panggang dalam kuali saja. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resipi-sup-ayam/",
        "details": {
            "title": "RESIPI SUP AYAM",
            "ingredients": {
                "Bahan Tumis:": [
                    "Bawang merah kecil (hiris)",
                    "Bawang putih (hiris)",
                    "Bawang besar (hiris – sedikit sahaja untuk elak rasa terlalu manis)",
                    "Halia (hiris)",
                    "4 sekawan (kulit kayu manis, bunga lawang, buah pelaga, cengkih)"
                ],
                "Bahan Sup": [
                    "Rempah sup (Adabi) – bancuh dengan sedikit air",
                    "Lada hitam (dikisar halus)",
                    "Kentang (potong besar)",
                    "Lobak merah (potong besar)",
                    "Ayam (potong sederhana besar)",
                    "Daun bawang dan daun sup (dihiris)",
                    "Garam secukup rasa"
                ]
            },
            "instructions": [
                "1. Panaskan sedikit minyak di dalam periuk.",
                "2. Tumis bawang merah sehingga kekuningan dan wangi.",
                "3. Masukkan bawang putih dan teruskan menumis sehingga kedua-duanya keperangan.",
                "4. Tambahkan bawang besar, halia, kentang, dan lobak merah. Tumis seketika sehingga bawang besar menjadi layu.",
                "5. Tuangkan bancuhan rempah sup ke dalam tumisan.",
                "6. Taburkan lada hitam secukupnya untuk menambah rasa pedas beraroma.",
                "7. Gaul sebati dan biarkan rempah sebati dengan bahan tumisan.",
                "8. Masukkan air secukupnya ke dalam periuk dan didihkan.",
                "9. Apabila air mendidih, tambahkan potongan ayam.",
                "10. Masak sup pada api sederhana sehingga kentang dan lobak merah menjadi lembut.",
                "11. Perasakan dengan garam mengikut citarasa.",
                "12. Sebelum menghidangkan, taburkan hirisan daun bawang dan daun sup di atas sup ayam untuk memberikan aroma segar."
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-mee-kuah-simple/",
        "details": {
            "title": "RESEPI MEE KUAH SIMPLE",
            "image_url": "https://media.myresipi.com/2024/12/resepi-mee-kuah-simple-1.jpg",
            "ingredients": {
                "Bahan-bahan:": [
                    "Mee kuning",
                    "Daging (direbus)",
                    "Sawi",
                    "Tauge",
                    "Daun sup",
                    "Sos cili",
                    "Kicap",
                    "Sedikit gula",
                    "Sedikit serbuk perasa",
                    "Telur"
                ],
                "Bahan kisar:": [
                    "Cili kering",
                    "Bawang besar",
                    "Bawang putih"
                ]
            },
            "instructions": [
                "1. Mula-mula, tumis bahan kisar sehingga naik bau.",
                "2. Selepas itu, tuang daging dan tambah air daging sedikit.",
                "3. Kemudian, tuang sos cili, kicap, gula, serbuk perasa dan tunggu sampai mendidih.",
                "4. Seterusnya, pecah telur dalam kuah dan biarkan ia masak sekejap.",
                "5. Setelah itu, boleh masukkan mee, sawi, tauge dan daun sup.",
                "6. Apabila sudah mendidih, boleh tuang terus ke dalam mangkuk. Siap untuk dihidang!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/kari-ayam-masala/",
        "details": {
            "title": "RESIPI KARI AYAM MASALA",
            "ingredients": {
                "Bahan-Bahan Utama:": [
                    "Ayam: Seekor ayam, potong kepada 16 bahagian",
                    "Garam",
                    "Serbuk kunyit",
                    "Sedikit serbuk cili",
                    "Goreng ayam sehingga separuh masak, kemudian ketepikan.",
                    "5 biji bawang merah",
                    "3 inci halia",
                    "1 labu bawang putih",
                    "1 biji tomato",
                    "2 inci kunyit hidup",
                    "3 cili merah",
                    "5 cili padi merah",
                    "10 cili padi akar"
                ]
            },
            "instructions": [
                "1. Panaskan minyak. Goreng ayam yang telah diperap sehingga separuh masak. Keluarkan dan ketepikan. Gunakan minyak yang sama untuk tumisan.",
                "2. Dalam minyak bekas gorengan ayam, panaskan 2 sudu makan minyak sapi.",
                "3. Tumis serai yang dititik, daun kari, daun pandan, dan buah pelaga hingga naik bau.",
                "4. Tuang bahan kisar ke dalam kuali. Tumis sehingga pecah minyak dan naik aroma.",
                "5. Tambahkan ubi kentang ke dalam kuali. Gaul rata dan masak seketika.",
                "6. Masukkan tairu (yogurt asli) dan akar ketumbar. Kacau perlahan sehingga semua bahan sebati.",
                "7. Tambahkan ayam yang telah digoreng tadi.",
                "8. Masukkan 3 sudu makan serbuk rempah daging (boleh kurangkan jika ingin kuah lebih cair).",
                "9. Gaul rata dan biarkan ayam masak sepenuhnya sambil kuah menjadi pekat.",
                "10. Tambahkan garam masala, garam, dan mushroom seasoning/ajinomoto mengikut selera.",
                "11. Setelah masak dan pecah minyak, taburkan daun ketumbar segar.",
                "12. Siap untuk dihidang."
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-udang-buttermilk//",
        "details": {
            "title": "RESEPI UDANG BUTTERMILK",
            "image_url": "https://media.myresipi.com/2024/12/resepi-udang-buttermilk-1-400x533.jpg",
            "ingredients": {
                "Bahan-bahan yang diperlukan:": [
                    "Udang",
                    "Butter",
                    "Bawang putih",
                    "Daun kari",
                    "Cili api",
                    "Susu cair ½ cawan",
                    "1 sudu besar susu pekat",
                    "Garam"
                ]
            },
            "instructions": [
                "1. Pertama sekali, goreng udang di dalam minyak hingga masak.",
                "2. Setelah itu, angkat udang dan ketepikan seketika.",
                "3. Gunakan sedikit minyak sisa gorengan udang, kemudian masukkan butter.",
                "4. Setelah butter cair, masukkan bawang putih, daun kari dan cili api.",
                "5. Tumis ketiga-tiga bahan tersebut sehingga wangi.",
                "6. Kemudian, masukkan susu cair dan susu pekat ke dalam kuali.",
                "7. Jangan lupa untuk menambah garam secukup rasa.",
                "8. Apabila rasa kuah sudah sesuai, masukkan udang yang telah digoreng tadi.",
                "9. Kacau hingga sebati. Jika suka kuah, tutup api sebaik sahaja udang dimasukkan. Jika suka kering, biarkan seketika sehingga kuah pekat.",
                "10. Siap, sedia untuk dihidangkan!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resipi-bendi-tumis-cili/",
        "details": {
            "title": "RESIPI BENDI TUMIS CILI",
            "ingredients": {
                "Bahan-Bahan Utama:": [
                    "1 labu bawang besar",
                    "4 ulas bawang putih",
                    "4 tangkai cili merah",
                    "1 sudu kecil belacan atau sejemput ikan bilis (saya menggunakan belacan)",
                    "1-2 biji telur (pukul terlebih dahulu)",
                    "16 batang kacang bendi (potong serong)",
                    "Garam secukup rasa",
                    "Minyak masak untuk menumis",
                    ""
                ]
            },
            "instructions": [
                "1. Kisar kering atau tumbuk kasar bahan-bahan bertanda (*) seperti bawang besar, bawang putih, cili merah, dan belacan/ikan bilis. Ini akan memberikan rasa pedas yang sedap dan aroma tumisan yang memikat.",
                "2. Panaskan sedikit minyak masak dalam kuali.",
                "3. Masukkan bahan kisar ke dalam kuali dan tumis sehingga bahan menjadi kering dan garing. Langkah ini penting untuk memastikan tumisan tidak mentah dan memberi aroma yang wangi.",
                "4. Ketepikan bahan tumisan ke sisi kuali.",
                "5. Tuangkan telur yang telah dipukul ke bahagian tengah kuali.",
                "6. Biarkan telur masak sedikit pada bahagian bawahnya selama beberapa saat sebelum mula menyentuhnya.",
                "7. Gunakan sudip untuk tarik dan sorong telur perlahan-lahan sehingga menjadi telur hancur yang lembut dan gebu.",
                "8. Gaulkan telur yang telah hancur dengan bahan tumisan.",
                "9. Tambahkan kacang bendi yang telah dipotong serong ke dalam kuali.",
                "10. Gaul rata kacang bendi dengan bahan tumisan dan telur.",
                "11. Perasakan dengan garam mengikut keperluan.",
                "12. Masak kacang bendi sehingga lembut tetapi masih mengekalkan kerangupannya. Pastikan anda tidak terlebih masak untuk mengelakkan kacang bendi kehilangan tekstur.",
                "13. Hidangkan panas-panas bersama nasi putih untuk pengalaman makan yang terbaik."
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-ayam-sambal-butter/",
        "details": {
            "title": "RESEPI AYAM SAMBAL BUTTER",
            "image_url": "https://media.myresipi.com/2024/12/resepi-ayam-sambal-butter-2-600x450.jpeg",
            "ingredients": {
                "Bahan ayam:": [
                    "Isi ayam tanpa tulang (gaul dengan telur, gaul dengan tepung jagung, goreng sampai rangup)"
                ],
                "Bahan tumis (hiris halus/dadu):": [
                    "Serai 1 batang",
                    "Daun limau purut 2 helai",
                    "Bawang putih 2 ulas",
                    "Bawang holland ¼ biji",
                    "Cili padi 2 batang",
                    "Tomato ⅓ biji"
                ],
                "Bahan-bahan lain:": [
                    "Butter 2 sudu besar",
                    "Cili kering kisar 3 sudu besar",
                    "Sos cili 4 sudu besar",
                    "Sos tiram 2 sudu besar",
                    "Garam secubit dua",
                    "Gula 4 sudu besar",
                    "Serbuk perasa 1 sudu besar",
                    "Pes tomyam 1 sudu besar",
                    "Air limau nipis 1 sudu besar"
                ]
            },
            "instructions": [
                "Panaskan kuali, cairkan mentega, masukkan bahan tumis. Tumis sehingga wangi.",
                "Masukkan cili kering kisar, tumis lagi sampai pecah minyak.",
                "Masukkan sos cili, sos tiram, garam, gula dan serbuk perasa, kacau hingga karamel.",
                "Masukkan air biar kuah sedikit cair, didihkan.",
                "Akhir sekali, masukkan pes tomyam dan air limau nipis. Kacau sebati. Siap!"
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/pasta-ayam-goreng-pedas/",
        "details": {
            "title": "RESIPI PASTA AYAM GORENG PEDAS",
            "ingredients": {
                "Bahan-Bahan Utama:": [
                    "½ pek pasta angel hair (rebus sehingga lembut, tapis, dan ketepikan)",
                    "2 keping dada ayam (dipotong kecil)",
                    "1 batang sosej (dihiris nipis)",
                    "Baby tomato (dibelah dua, ikut jumlah yang disukai)",
                    "3 ulas bawang putih (diketuk)",
                    "1 biji bawang kecil (dipotong dadu)",
                    "4 sudu besar cili kisar",
                    "5 sudu besar sos tomato",
                    "5 sudu besar sos cili",
                    "2 sudu besar sos tiram",
                    "Sedikit perahan lemon",
                    "1 sudu kecil oregano",
                    "Garam dan penambah perisa (jika perlu)",
                    "Daun salad (dicincang kasar atau dibiarkan sehelai-sehelai untuk hiasan)"
                ]
            },
            "instructions": [
                "1. Didihkan air dalam periuk besar dan tambah sedikit garam. Rebus pasta angel hair sehingga lembut (anggaran 3-5 minit kerana teksturnya yang halus). Tapis dan gaul dengan sedikit minyak supaya tidak melekat.",
                "2. Panaskan kuali dan tambah sedikit minyak masak. Tumis bawang putih dan bawang kecil sehingga wangi.",
                "3. Masukkan cili kisar dan kacau sehingga pecah minyak.",
                "4. Masukkan potongan ayam ke dalam kuali. Kacau rata dan biarkan sehingga ayam masak sepenuhnya.",
                "5. Tambahkan sos cili, sos tomato, dan sos tiram ke dalam kuali. Gaulkan bersama ayam hingga sebati.",
                "6. Masukkan pasta rebus dan kacau sehingga semua bahan menyelaputi pasta dengan rata.",
                "7. Masukkan hirisan sosej dan baby tomato ke dalam pasta. Kacau perlahan untuk mengelakkan tomato hancur.",
                "8. Tambahkan sedikit perahan lemon untuk rasa masam yang menyegarkan. Perasakan dengan garam dan penambah perisa secukup rasa.",
                "9. Setelah semua bahan sebati, taburkan oregano kering di atas pasta.",
                "10. Masukkan daun salad yang telah dicincang untuk rasa segar. Kacau rata dan hidangan anda siap.",
                "Gunakan pasta angel hair kerana ia lebih ringan dan cepat masak, namun pasta lain seperti spaghetti atau fettuccine juga boleh digunakan.",
                "Untuk rasa yang lebih pedas, tambahkan cili padi yang telah dihiris halus semasa tumisan.",
                "Anda boleh menambah keju parmesan sebagai taburan akhir jika menggemari rasa yang lebih berkrim."
            ]
        }
    },
    {
        "recipe_url": "https://myresipi.com/resepi-bihun-goreng-putih-simple/",
        "details": {
            "title": "RESEPI BIHUN GORENG PUTIH",
            "image_url": "https://media.myresipi.com/2024/12/bihun-goreng-putih-1-400x550.jpeg",
            "ingredients": {
                "Bahan-bahan:": [
                    "1/2 pek bihun (rendam)",
                    "2 sudu lada putih",
                    "3 biji bawang putih (tumbuk bersama lada putih)",
                    "2 biji telur",
                    "Udang/ayam (ikut selera)",
                    "Sedikit lobak merah yang telah disagat",
                    "1 biji cili hijau",
                    "Daun bawang",
                    "Garam dan perasa tambahan"
                ]
            },
            "instructions": [
                "Panaskan kuali dan tuang sedikit minyak masak.",
                "Apabila minyak sudah panas, tumis bahan yang telah ditumbuk (bawang putih dan lada putih).",
                "Pecahkan telur dan kacau sehingga sebati.",
                "Masukkan isi ayam atau udang. Gaul sebati dan biarkan lauk masak.",
                "Tambahkan bihun yang telah direndam dan lobak merah yang disagat.",
                "Masukkan garam dan perasa tambahan, gaul hingga sebati.",
                "Masukkan cili hijau dan daun bawang, gaul sehingga bihun masak sepenuhnya.",
                "Hidangkan dan siap untuk dinikmati!"
            ]
        }
    }
]