[
    {
        "title": "Churros",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/Churros-coklat-dan-butterscotch-dipping-sauce",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Churros.jpg",
            "masa_penyediaan": "50 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Churros": [
                    "200ml air",
                    "1 sb /12g gula",
                    "1/4 sk /2g garam",
                    "4 sb / 56g mentega",
                    "140g tepung gandum",
                    "2 biji telur saiz A"
                ],
                "Bahan Sos Butterscotch": [
                    "1/2 ketul /113g mentega",
                    "1 cwn /220g gula perang",
                    "1/2 sk garam",
                    "200ml dairy whipping cream",
                    "1 sk esen vanila"
                ],
                "Bahan Sos Coklat": [
                    "1 1/2 cwn /210g dark chocolate coin",
                    "1/4 ketul /56g mentega",
                    "1/3 cwn susu full cream",
                    "Secubit garam"
                ]
            },
            "instructions": {
                "Churros": [
                    "Masukkan air, gula, garam dan butter dalam periuk. Buka api dan masak sampai gula larut dan air mendidih.",
                    "Tuang masuk tepung gandum, perlahankan api dan kacau sampai adunan bergumpal (kalau pakai periuk stainless steel, boleh check ada lapisan melekat dekat bawah tu, maknanya dah ready. Kalau non-stick takda lah).",
                    "Bila doh dah sekata dan berkilat boleh tutup api dan pindah dalam mangkuk.Tekan-tekan supaya suhu turun sebelum masukkan telur.",
                    "Masuk telur dalam doh sebiji demi sebiji dan kacau.",
                    "Masuk nozzle (star shape no855) dalam pipping bag (guna 2 keping untuk elak pecah).",
                    "Masuk doh dalam pipping bag dan paip churros atas kertas baking.",
                    "Panaskan minyak (suhu 355°F atau 180°C) dan goreng churros sampai perang.",
                    "Campur gula kastor dengan serbuk kayu manis kemudian salut churros masa suam-suam panas."
                ],
                "Butterscotch": [
                    "Cairkan butter kemudian masuk gula perang dan sedikit garam. Masak sampai gula pekat berbuih.",
                    "Tuang masuk dairy whipping cream, esen vanilla dan masak sampai pekat dan mendidih."
                ],
                "Chocolate Dipping Sauce": [
                    "Cairkan butter, coklat coin dan full cream atas api perlahan sampai larut."
                ]
            },
            "tips_and_guides": [
                "Jangan goreng penuh-penuh kuali, nanti churros jadi lembik, serap minyak dan tak rangup.",
                "Kena kerap kacau churros masa goreng dan api sederhana. Kita nak hasil churros tu rangup di luar dan lembut ringan dalamnya."
            ]
        }
    },
    {
        "title": "Puding roti",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/puding-roti-special",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Puding_Roti_.jpg",
            "masa_penyediaan": "40 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk  Pudding Roti": [
                    "5 keping roti putih / sandwich",
                    "4 cwn / 950ml air",
                    "1 pek / 10g serbuk agar-agar",
                    "1 biji  telur",
                    "1 cwn / 237ml susu cair",
                    "1/2 cwn / 120ml susu pekat",
                    "1/2 cwn / 100g gula",
                    "1/4 sk garam",
                    "1 sk esen vanila",
                    "Pewarna makananRestoran terbaik berdekatan saya"
                ]
            },
            "instructions": {
                "Untuk Pudding Roti": [
                    "Lorek pudding untuk effect marble.",
                    "Balut bekas dengan plastic wrap.",
                    "Koyak kasar roti dan masukkan dalam blender. Masukkan jugak air (3 cawan air), serbuk agar-agar dan telur. Kisar semua bahan sampai halus.",
                    "Masukkan dalam periuk susu pekat, gula, garam, bahan kisar halus, 1 cawan air (kocak blender, kasi bersih bahan kisar tadi) dan susu cair (boleh ganti susu full cream kalau suka).",
                    "Bukak api sederhana dan kacau perlahan. Masak sampai agar-agar larut, pekat dan tak berketul.",
                    "Che Nom masukkan esen vanila (pilihan). Kalau sensitif dengan bau telur boleh letak sikit esen vanila untuk hilangkan bau hanyir telur.",
                    "Bila adunan dah pekat (adunan melekat pada spatula) dan naik buih sikit, terus tutup api.",
                    "Tapis adunan untuk pastikan tak ada ketulan.",
                    "Untuk warnakan pudding, Che nom letak 2 saja warna 1 lagi warna asli adunan atau putih. Berapa jenis warna tu ikut pilihan anda.",
                    "Bahagi adunan kepada 3 bekas sama banyak.",
                    "Masukkan pewarna pilihan anda dalam adunan yang telah dibahagi tadi. Che Nom guna warna merah dan warna biru. Kacau adunan sampai sebati.",
                    "Tuang masuk adunan dalam bekas secara berselang seli. Satu warna Che Nom tuang 2 kali. Hasilnya akan dapat 6 lapisan berwarna.",
                    "Sejukkan dalam peti sejuk 3-4 jam atau semalaman."
                ]
            },
            "tips_and_guides": [
                "Jangan tinggal masa masak pudding. Kerap kacau dan masak perlahan.",
                "Sebelum tuang masuk adunan dalam bekas, basahkan dasar bekas dengan air untuk elak melekat.",
                "Untuk effect marble, boleh lorek guna pemegang sudu atau batang sudu untuk lebih cantik, jangan guna batang lidi sebab kecik sangat nanti tak berapa menjadi corak marble.",
                "Selepas sejukkan, boleh lap sikit permukaan pudding yang berair dengan tisu."
            ]
        }
    },
    {
        "title": "Puding Kastard Berkuah Koktel",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/puding-kastard-berkuah-koktel",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Puding_Koktail.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Pudding Kastad": [
                    "5 cwn air",
                    "1 cwn tepung kastad",
                    "1 cwn susu pekat",
                    "1/2 sk garam"
                ],
                "Bahan Kuah Koktel": [
                    "1 tin /836g koktel buah",
                    "1 tin susu cair",
                    "5 sb gula",
                    "1 sb tepung kastad",
                    "1/2 sk garam",
                    "2 cawan air",
                    "1 sk esen/ekstrak vanilla"
                ],
                "Bahan Lain": [
                    "Laici tin",
                    "Buah naga"
                ]
            },
            "instructions": {
                "Untuk Puding Kastad": [
                    "Tapis dan asingkan buah dan air gula koktel.",
                    "Potong dadu buah naga.",
                    "Masukkan air, tepung kastad, susu pekat dan garam dalam kuali. Kacau sampai bahan larut.",
                    "Bukak api dan masak atas api perlahan. Kerap kacau untuk elak kastad berketul.",
                    "Masak sampai kastad jadi pekat dan lincin. Tutup api bila kastad mula berbuih.",
                    "Tuang masuk kastad dalam bekas, ratakan adunan dan sejukkan."
                ],
                "Untuk Kuah Koktail": [
                    "Tuang masuk air gula koktail, susu cair, gula putih, tepung kastad, esen/ ekstrak vanilla, garam dan air dalam periuk. Kacau sebati.",
                    "Masak atas api perlahan. Masak sampai gula larut dan naik wap.",
                    "Tutup api dan sejukkan.",
                    "Tuang atas pudding kastad tadi.",
                    "Hiaskan dengan buah koktail, laici dan buah naga.",
                    "Sejukkan dalam peti sejuk beberapa jam sebelum hidang."
                ]
            },
            "tips_and_guides": [
                "Masa masak kastad pastikan kerap kacau untuk elak kastad berketul.",
                "Boleh tambah buah lain macam strawberry atau kiwi untuk lebih cantik dan menarik."
            ]
        }
    },
    {
        "title": "Puding Roti & Kuah Kastard",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/puding-roti-kuah-kastard",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Puding_Roti.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "45 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Puding Roti": [
                    "8 keping roti",
                    "4 sb mentega",
                    "¼ cawan kismis",
                    "2 cawan susu full cream",
                    "½ cawan gula",
                    "1 sk esen vanila",
                    "¼ sk serbuk kulit kayu manis",
                    "Secubit garam",
                    "3 biji telur",
                    "Gula perang secukupnya"
                ],
                "Bahan Sos Kastard": [
                    "1 tin susu cair",
                    "2 sb tepung kastard",
                    "1 cawan air",
                    "4 sb gula",
                    "Secubit garam"
                ]
            },
            "instructions": {
                "Untuk Puding Roti": [
                    "Potong roti 8 bahagian.",
                    "Sapu atau gris mentega/majerin pada dulang pembakar.",
                    "Susun potongan roti didalam dulang pembakar.",
                    "Dalam bekas lain, masukkan susu full cream bersama gula, esen vanilla, serbuk kulit kayu manis, secubit garam dan telur. Kacau sebati semua bahan.",
                    "Panaskan mentega sehingga cair, lalu tuang mentega diatas roti.",
                    "Taburkan kismis dan tuang adunan susu kedalam roti. Tekan roti supaya tenggelam dan menyerap adunan.",
                    "Rehatkan lebih kurang 5-10 minit.",
                    "Tabur gula perang secukupnya atas adunan roti, lalu bakar dengan suhu 170˚C selama 25-30 minit sehingga puding roti masak dan permukaan roti menjadi perang."
                ],
                "Untuk Sos Kastard": [
                    "Masukkan susu cair, gula, tepung kastard dan secubit garam. Kacau bahan sehingga larut sepenuhnya.",
                    "Setelah larut, masukkan air dan panaskan adunan sos kastard. Masak sehingga sos kastard masak dan pekat sekata."
                ],
                "Untuk Puding Roti & Sos Kastard": [
                    "Sesudah siap dibakar, sapu dengan mentega cair pada permukaan roti yang masih suam-suam panas.",
                    "Potong puding roti dan hidangkan bersama sos kastard."
                ]
            },
            "tips_and_guides": [
                "Selain hiasan taburan kismis pada puding roti, boleh juga tambahkan coklat cip ataupun kekacang seperti badam dan hazelnut.",
                "Bagi memastikan sos kastard sudah masak dan pekat adalah dengan lorek menggunakan hujung jari pada permukaan senduk. Sos yang sudah pekat akan tinggal bekas lorekkan pada permukaan senduk berbanding dengan sos kastard yang masih cair."
            ]
        }
    },
    {
        "title": "Puding Karamel",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/puding-karamel",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Puding_Karamel_Web.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "N/A",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Gula Karamel": [
                    "1/3 cawan gula (**abaikan sukatan 1/2 cawan dlm video)",
                    "2 sb air"
                ],
                "Bahan Adunan Puding": [
                    "2 cawan susu full cream",
                    "½ cawan gula",
                    "1 sk esen vanila",
                    "4 biji telur saiz B",
                    "1 kuning telur",
                    "Secubit garam"
                ]
            },
            "instructions": {
                "Untuk Lapisan Karamel": [
                    "Masak gula dengan air sehingga gula cair dan naik buih.",
                    "Apabila sudah keperangan, masukkan gula caramel kedalam loyang dan ratakan karamel pada permukaan loyang."
                ],
                "Untuk Puding Karamel": [
                    "Kacau perlahan telur dan kuning telur, lalu masukkan esen vanila.",
                    "Masak susu full cream, gula dan secubit garam. Masak sehingga naik asap, berbuih sedikit dan tidak perlu masak sehingga mendidih.",
                    "Tuang adunan susu suam kedalam telur sedikit demi sedikit sambil mengacau perlahan adunan.",
                    "Tapis adunan puding, lalu tuangkan kedalam loyang lapisan karamel dengan perlahan.",
                    "Tutup loyang dengan aluminium foil, dan masak puding karamel samada dengan cara mengukus atau membakar.",
                    "Bagi kaedah water bath dan bakar, masukkan loyang kedalam loyang yang lebih besar lalu tuang air panas kedalam loyang besar.",
                    "Bakar puding karamel pada suhu 160˚ dalam anggaran selama 50 minit.",
                    "Kemudian, sejukkan dalam peti sejuk dalam beberapa jam ataupun semalaman.",
                    "Lorekkan bahagian tepi puding lalu terbalikkan puding karamel untuk dihidang."
                ]
            },
            "tips_and_guides": [
                "Ketika masak lapisan karamel, tidak perlu mengacau air gula sehinggalah gula menjadi keperangan. Bagi mengelakkan gula berketul, sapu air di tepi dalam kuali.",
                "Jika mahukan rasa karamel yang lebih pahit, masak air gula sehingga menjadi perang gelap tetapi jika tidak mahu, masak sehingga warna air gula bertukar kepada perang muda sahaja.",
                "Proses tempering ini berlaku apabila kita mengawal suhu dengan memasukkan adunan susu suam sedikit-sedikit kedalam telur. Cara ini bagi mengelakkan telur menjadi masak dan campuran adunan susu dan telur menjadi berketul-ketul.",
                "Tuang adunan puding perlahan-perlahan bagi mengelakkan terjadinya buih, Jika berbuih, buang atau pecahkan buih yang ada.",
                "Untuk tahu puding karamel sudah masak, puding tidak akan melekat pada pisau apabila dicucuk."
            ]
        }
    },
    {
        "title": "Thai Red Ruby",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/thai-red-ruy",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Thai_Red_Rubies_web.jpg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "15 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Thai Red Ruby": [
                    "300g sengkuang atau sengkuang cina",
                    "Pewarna merah",
                    "1 mangkuk tepung ubi",
                    "Air untuk merebus"
                ],
                "Bahan Untuk Sirap Santan": [
                    "1 kotak / 200ml santan",
                    "2 cawan air",
                    "2 helai daun pandan",
                    "¾ cawan gula",
                    "Sedikit garam"
                ],
                "Bahan Lain": [
                    "Buah Nangka",
                    "Nata de coco",
                    "Kiub ais"
                ]
            },
            "instructions": {
                "Untuk Thai Red Ruby": [
                    "Gaul sengkuang yang dipotong dadu dengan pewarna merah.",
                    "Tambah sedikit air lalu perapkan seketika.",
                    "Gaul sekata sengkuang perap yang diperap tadi dengan tepung ubi.",
                    "Panaskan air dan ayak lebihan tepung ubi sebelum direbus.",
                    "Rebus sehingga merah pada sengkuang kelihatan hampir jernih dan sengkuang timbul naik di permukaan air, lalu angkat dan toskan.",
                    "Rendam pula dalam air sejuk dan toskan.",
                    "Kemudian, hidangkan red ruby (sengkuang) bersama sirap santan, kiub ais, nata de coco, isi kelapa dan hirisan nangka."
                ],
                "Untuk Sirap Santan": [
                    "Panaskan air dan masukkan santan, simpulan pandan, gula serta sedikit garam.",
                    "Kacau dengan kerap diatas api yang perlahan."
                ]
            },
            "tips_and_guides": [
                "Toskan sedikit sengkuang yang digaul pewarna sebelum gaul dengan tepung ubi. Tujuan untuk elak semgkuang melekat satu sama lain jika terdapat air yg bertakung",
                "Santan perlu dimasak api perlahan dan kerap kacau untuk elak dari berketul."
            ]
        }
    },
    {
        "title": "Buko Pandan",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/buko-pandan",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/buko_pandan.jpg",
            "masa_penyediaan": "50 minit",
            "masa_memasak": "45 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Jeli Pandan": [
                    "1 pek /10g serbuk agar-agar",
                    "1 cawan jus pandan",
                    "3 cawan air",
                    "1 cawan gula",
                    "2-3 titik pewarna hijau (pilihan)"
                ],
                "Bahan Untuk Sagu": [
                    "1 cawan sagu",
                    "Air secukupnya",
                    "Sedikit pewarna hijau"
                ],
                "Bahan Lain": [
                    "1 kotak /200g krim putar tenusu",
                    "1 tin susu cair",
                    "Susu pekat manis",
                    "Nata de Coco",
                    "2 sudu besar biji selasih",
                    "Isi kelapa muda",
                    "Kiub ais",
                    "Ais krim vanila (pilihan)"
                ]
            },
            "instructions": {
                "Untuk Biji Selasih Dan Sagu": [
                    "Rendam biji selasih dengan air secukupnya dalam anggaran 10-15 minit sehingga kembang.",
                    "Rebus pula sagu sehingga sagu masak dan lembut.",
                    "Setelah masak, bilas sagu dengan air lalu tambah pewarna hijau kedalam sagu."
                ],
                "Untuk Jelly Pandan": [
                    "Kisar halus daun pandan dengan air secukupnya lalu tapis jus pandan.",
                    "Panaskan air dan masukkan serbuk agar-agar, gula, pewarna hijau dan jus pandan.",
                    "Setelah mendidih, tuang dalam loyang dan sejukkan dalam peti ais.",
                    "Kemudian, potong jeli pandan yang sudah sejuk berbentuk kiub."
                ],
                "Untuk Whipping Cream": [
                    "Pukul whipping cream sehingga agak pekat.",
                    "Sejukkan ke dalam peti sejuk."
                ],
                "Untuk Buko Pandan": [
                    "Masukkan kiub jeli pandan, susu pekat manis, susu cair, biji selasih, sagu, nata de coco, isi kelapa dan kiub ais.",
                    "Masukkan whipping cream dan hidangkan bersama dengan aiskrim vanilla."
                ]
            },
            "tips_and_guides": [
                "Jika tidak mahu kisar daun pandan, boleh sahaja simpulkan daun pandan ke dalam rebusan jeli."
            ]
        }
    },
    {
        "title": "Puding Roti Jagung",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/puding-roti-jagung",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Puging_Jagung_IG.jpg",
            "masa_penyediaan": "N/A",
            "masa_memasak": "20 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Pudding Roti Jagung": [
                    "3 keping roti putih",
                    "½ tin /195ml susu cair",
                    "1 biji telur",
                    "1 ½ sudu besar tepung kastard",
                    "1 sudu kecil esen vanila",
                    "½ tin jagung manis",
                    "¾ cawan /150g gula",
                    "700ml air",
                    "1 pek / 10g serbuk agar-agar",
                    "pewarna kuning",
                    "pewarna hijau",
                    "majerin untuk gris acuan"
                ]
            },
            "instructions": {
                "Untuk Puding Roti Jagung": [
                    "Gris atau sapu nipis marjerin didalam bekas acuan pudding.",
                    "Buang kerak tepi roti. Kemudian, potongkan roti kepada kiub kecil.",
                    "Kisar halus potongan roti, susu cair, sebiji telur, tepung kastard, esen vanilla, jagung manis dan gula. Kisar bahan sehingga betul-betul halus.",
                    "Masakkan air dan serbuk agar-agar. Kerapkan menggacau supaya adunan tidak berketul.",
                    "Bila agar-agar sudah larut, masukkan bahan kisar dan masakkan dengan api yang perlahan. Gaul sehingga adunan menjadi pekat dan mendidih.",
                    "Bahagikan kepada tiga adunan untuk diletakkan pewarna. Adunan dijadikan warna oren, kuning dan hijau.",
                    "Masukkan adunan yang pertama iaitu yang berwarna oren sebagai lapisan bawah lalu ratakan adunan tersebut didalam bekas pudding.",
                    "Kemudian, masukkan kedalam peti sejuk sehingga agar-agar oren sejuk dan keras.",
                    "Masukkan pula lapisan kedua yang berwarna kuning dan ulang, sejukkan kedalam peti sejuk.",
                    "Selepas sejuk dan keras lapisan yang kedua, masukkan pula lapisan yang terakhir dan ratakan adunan.",
                    "Masukkan pudding kedalam peti sejuk dan sejukkan dalam masa anggaran 3 jam.",
                    "Selepas sudah keras, pudding roti jagung sudah siap untuk dihidang dan dijamu selera,"
                ]
            },
            "tips_and_guides": [
                "Selepas adunan kelihatan sudah mendidih, segerakan tutup api bagi mengelakkan ia hangit.",
                "Pudding boleh ditambah pewarna selain pewarna kuning dan hijau mengikut kesukaan agar ia kelihatan lebih menarik lagi.",
                "Jika adunan sedikit keras, boleh dipanaskan semula supaya cair sebelum diletakkan didalam bekas pudding. Boleh tambah sedikit air jika adunan menjadi terlalu pekat semasa dipanaskan."
            ]
        }
    },
    {
        "title": "Homemade Boba Pearl Dan 3 Jenis Boba Milk Drink",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/homemade-boba-pearl-dan-3-jenis-boba-milk-drink",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Boba_Tea_3.jpg",
            "masa_penyediaan": "N/A",
            "masa_memasak": "5 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Boba Pearl": [
                    "1/3 cawan /65g brown sugar",
                    "1/3 cawan /80ml air",
                    "1 cawan /140g tepung ubi",
                    "sedikit pewarna hitam (optional)"
                ],
                "Bahan Untuk Brown Sugar Syrup": [
                    "1 cawan /200g brown sugar (boleh kurangkan kalau tak suka manis)",
                    "sedikit air"
                ],
                "Bahan Lain Untuk Boba Milk Drink": [
                    "ais",
                    "susu full cream",
                    "kopi espresso",
                    "bancuhan pekat air teh"
                ]
            },
            "instructions": {
                "Untuk Boba Pearl": [
                    "Masukan gula dalam kuali.",
                    "Tambah air dan kacau sehingga larut dan mendidih.",
                    "Perlahankan api dan masukan tepung ubi sedikit demi sedikit dan kacau sebati.",
                    "Pindahkan doh ke meja kemudian masukan pewarna hitam sedikit dan uli sehingga warna hitam menjadi sekata dah doh tidak melekat.",
                    "Leperkan doh dan potong memanjang kemudian potong kecil-kecil dan bulatkan.",
                    "Masukan boba pearl dalam air yang mendidih dah rebus selama 20 sehingga 30 minit",
                    "Bila boba pearl sudah kenyal dan bertukar jadi gelap lutsinar, tapis kesemua air."
                ],
                "Untuk Brown Sugar Syrup": [
                    "Masukan brown sugar dan boba pearl dalam kuali.",
                    "Tambah sedikit air dan kacau perlahan sehinga pekat brown sugar syrup."
                ],
                "Untuk Boba Milk": [
                    "Masukan boba pearl dalam cawan.",
                    "Masukan ais kemudian tuang susu."
                ],
                "Untuk Boba Milk Coffee": [
                    "Masukan boba pearl dalam cawan",
                    "Masukan ais, susu dan coffee"
                ],
                "Untuk Boba Milk Tea": [
                    "Masukan boba pearl dalam cawan",
                    "Masukan ais, susu dan teh yang dibancuh pekat"
                ]
            },
            "tips_and_guides": [
                "Taburkan tepung ubi ketika menguli untuk mengelakan boba pearl melekat.",
                "Ketika mula- mula tuang boba pearl, kacau kerap supaya tidak melekat.",
                "Tuangkan black pearl syrup di bahagian tepi untuk hasil ala-ala Xing Fu Tang."
            ]
        }
    },
    {
        "title": "Pengat Labu Manis",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/pengat-labu-manis",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Pengat_Labu_Web.jpg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1/2 biji labu",
                    "1/2 cawan air",
                    "2 sudu besar gula putih",
                    "2 helai daun pandan",
                    "1 mangkuk besar santan",
                    "1/3 cawan gula melaka ATAU 1 keping gula nisan",
                    "1/2 cawan sagu",
                    "1/2 -1 sudu kecil garam"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Rendam sagu dalam air dalam 15-30 minit. Tapis dan bilas dengan air.",
                    "Kupas kulit labu, bersihkan dan potong kiub besar.",
                    "Masukkan dalam periuk bersama air, gula putih serta daun pandan yang dicarik dan disimpul. Tutup periuk dan masak sehingga labu lembut.",
                    "Masukkan santan, gula melaka, dan sagu yang direndam tadi. Pastikan api perlahan supaya santan tak berketul. Kacau-kacau sedikit kuah santan dan reneh sehingga mendidih.",
                    "Perasakan dengan garam secukup rasa. Siap sedia untuk dihidang."
                ]
            },
            "tips_and_guides": [
                "Santan segar boleh diganti dengan 1 kotak santan cuma perlu lebihkan air supaya berkuah.",
                "Rendam sagu sekejap supaya kembang kerana kita nak sagu cepat masak dan tak perlu direneh lama kerana takut santan akan mudah jadi berketul.",
                "Pastikan labu sudah masak lembut barulah dimasukkan santan."
            ]
        }
    },
    {
        "title": "Serawa Durian dan Pulut Kukus",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/serawa-durian-dan-pulut-kukus",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/e0d06f4214008ee53df564ae9d9c6c7ce3410599.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "15 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Serawa Durian": [
                    "10-15 ulas isi durian, bersama biji",
                    "1 mangkuk santan cair",
                    "2 helai daun pandan, carik dan simpul",
                    "1/2 cawan gula pasir",
                    "seketul kecil gula melaka",
                    "garam secukup rasa",
                    "1 mangkuk santan pekat",
                    "sedikit air, jika perlu"
                ],
                "Bahan Untuk Pulut Kukus": [
                    "500 gram pulut",
                    "1 cawan santan cair",
                    "1/2 sudu kecil garam"
                ]
            },
            "instructions": {
                "Untuk Serawa Durian": [
                    "Masukkan ulas durian bersama bijinya, santan cair dan daun pandan di dalam periuk. Masak sehingga isi durian hancur dan menjadi kuah yang pekat sebati.",
                    "Masukkan gula pasir, gula melaka  dan garam.",
                    "Teruskan didih di atas api yang perlahan dan kacau sebati kemudian masukkan pula santan pekat.",
                    "Tambahkan sedikit air jika kuah terlalu pekat. Angkat dan hidangkan bersama pulut kukus."
                ],
                "Untuk Pulut Kukus": [
                    "Rendam pulut selama beberapa jam (anggaran 2-3 jam).",
                    "Panaskan kukusan dan kukus pulut selama 15-20 minit. Angkat pulut dari kukusan dan masukkan ke dalam mangkuk.",
                    "Bancuh santan cair bersama garam.",
                    "Tuangkan santan cair kedalam pulut yang panas tadi dan tutup dengan kain. Rehatkan seketika supaya pulut menyerap kuah santan."
                ]
            },
            "tips_and_guides": [
                "Jika pulut masih keras selepas anda gaul bersama santan cair, masukkan kembali ke dalam kukusan selama 5 minit, kemudian angkat dan sejukkan."
            ]
        }
    },
    {
        "title": "Agar-Agar Cendol Sedap",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=1",
        "recipe_url": "https://resepichenom.com/resepi/agar-agar-cendol-sedap",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/be646e4e1082ec92f4129e3bed89afb3c9cfed2b.jpeg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "20 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Lapisan Gula Melaka": [
                    "1/2 pek agar-agar bertali (anggaran 15g)",
                    "800 ml air",
                    "150 gram gula melaka",
                    "1/4 cawan gula merah",
                    "1/2 cawan gula pasir",
                    "250 ml santan",
                    "1/2 sudu kecil garam"
                ],
                "Bahan Untuk Lapisan Santan": [
                    "1/2 pek agar-agar bertali (anggaran 15g)",
                    "800 ml air",
                    "1/2 cawan gula pasir",
                    "2 1/2 sudu teh garam",
                    "250 ml santan",
                    "1 pek cendol, tapis airnya"
                ]
            },
            "instructions": {
                "Untuk Lapisan Gula Melaka": [
                    "Basuh dan rendam agar-agar bertali bersama air seketika, kemudian masak agar-agar bersama gula melaka, gula merah dan gula pasir sehingga larut.",
                    "Perlahankan api dan masukkan santan bersama garam. Kacau dengan kerap sehingga mendidih. Tapis dan tuang ke dalam acuan. Sejukkan sehingga beku."
                ],
                "Untuk Lapisan Santan": [
                    "Basuh dan rendam agar-agar bertali bersama air seketika, kemudian masak agar-agar sehingga larut.",
                    "Masukkan santan, cendol dan garam. Kacau sehingga mendidih di atas api perlahan.",
                    "Tuangkan di atas lapisan gula melaka yang sudah dicakar dengan garfu supaya dua lapisan bercantum dengan sempurna."
                ]
            },
            "tips_and_guides": [
                "Apabila santan dimasukkan, harus dikacau dengan api perlahan supaya agar-agar tidak berketul."
            ]
        }
    },
    {
        "title": "Pulut Mangga Thai Istimewa",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/pulut-mangga-thai-istimewa",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/ff94a115beb34185bea9fa28df902cf49a813133.jpeg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "Bahan-bahan untuk pulut mangga",
                    "400 gram beras pulut, rendam semalaman",
                    "1 cawan santan pekat",
                    "1 cawan santan cair",
                    "2-3 sudu besar gula",
                    "sedikit garam",
                    "beberapa helai daun pandan, atau daun pisang",
                    "2 sudu besar bijan, dibakar tanpa minyak untuk taburan",
                    "3 biji mangga"
                ],
                "Bahan Untuk Kuah Santan": [
                    "1 cawan santan pekat",
                    "1 sudu kecil tepung beras atau tepung jagung, bancuh dengan sedikit air",
                    "1 helai daun pandan, carik dan simpul",
                    "garam secukup rasa (biar kuah agak masin)"
                ]
            },
            "instructions": {
                "Untuk Pulut": [
                    "Panaskan pengukus. Lapik dulang pengukus dengan daun pisang atau susun daun pandan rapat-rapat.",
                    "Bilas pulut yang telah direndam semalaman dan tapis keluar airnya. Masukkan ke dalam dulang kukusan dan kukus sehingga lembut. Anggaran masa kukus adalah selama 20 minit.",
                    "Apabila sudah lembut, angkat dan masukkan pulut kukus ke dalam mangkuk yang besar.",
                    "Satukan santan pekat, santan cair, gula dan garam dan kacau sebati. Tuang bancuhan santan ke dalam pulut yang masih panas tadi. Balik-balikkan pulut  dan biar seketika supaya kuah bancuhan meresap ke dalam pulut. Apabila pulut sudah kering meresap kuah santan, ambil garfu dan gemburkan pulut.",
                    "Hidang bersama kuah santan, buah mangga dan taburan bijan."
                ],
                "Untuk Kuah Santan": [
                    "Panaskan santan pekat di dalam periuk dan masak di atas api yang sederhana. Masukkan garam, daun pandan dan bancuhan tepung. Teruskan kacau supaya  santan tidak berketul. Kalau agak cair masukkan sedikit lagi bancuhan tepung. Anda boleh agak-agak kepekatan di sini.",
                    "Pastikan kuah mempunyai rasa yang agak masin supaya dapat menyeimbangi rasa manis buah dan pulut. Angkat dan sejukkan."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Butir Nangka",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/butir-nangka",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/74c99597d13313ee9455f160bee03567a22bfc88.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Biji Butir Nangka": [
                    "3-4 cawan tepung beras pulut",
                    "1 sudu kecil air kapur",
                    "secubit garam",
                    "air",
                    "pewarna makanan secukupnya"
                ],
                "Bahan Untuk Kuah": [
                    "2-3 mangkuk besar santan dari 1/2 biji kelapa ATAU 1 kotak santan segera",
                    "sehelai daun pandan, carik dan simpul",
                    "1 sudu kecil rempah biji halba",
                    "gula",
                    "garam"
                ]
            },
            "instructions": {
                "Untuk Biji Butir Nangka": [
                    "Panaskan air di dalam periuk.",
                    "Bancuh air kapur bersama air dan garam. Tuangkan sedikit demi sedikit ke atas tepung pulut. Uli sehingga menjadi doh yang lembut.",
                    "Bahagikan doh dan uli bersama beberapa titik pewarna kesukaan anda sehingga warna doh sekata. Cubit sedikit dan bentukkan doh menjadi bujur. Ulang proses sehingga doh habis.",
                    "Rebus butir doh di dalam air panas tadi sehingga timbul di permukaan dan kautkan ke dalam mangkuk yang berisi air sejuk biasa."
                ],
                "Untuk Kuah": [
                    "Panaskan santan di atas api perlahan.",
                    "Masukkan biji halba dan daun pandan.",
                    "Kemudian masukkan biji butir nangka yang telah ditapis dari air rendaman tadi.",
                    "Masukkan gula dan garam secukup rasa.",
                    "Kacau kuah dengan perlahan sehingga mendidih dan tutup api."
                ]
            },
            "tips_and_guides": [
                "Kuah akan lebih sedap jika anda gunakan santan segar berbanding santan kotak.",
                "Kuah juga harus lebih rasa manisnya. Anda harus pandai mengagak gula yang perlu dimasukkan ke dalam kuah mengikut citarasa sendiri."
            ]
        }
    },
    {
        "title": "Puding Roti Coklat",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/puding-roti-coklat",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/9d106661c3c1e51da87bd61bc353ca47c912b6bc.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "40 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "6-7 keping roti",
                    "2 cawan susu Full Cream",
                    "3 biji telur, saiz sederhana",
                    "1/3 cawan gula perang (boleh digantikan dengan gula putih)",
                    "2 sudu besar serbuk koko",
                    "2 sudu besar bancuhan kopi espresso",
                    "sedikit butter",
                    "secubit garam",
                    "3/4 cawan coklat chip",
                    "sedikit white coklat chip untuk hiasan"
                ],
                "Bahan Untuk Sos": [
                    "200 gram coklat bar",
                    "1/2 cawan susu",
                    "2 sudu besar butter"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Potong roti kepada potongan kiub.",
                    "Griskan bekas caserolle atau baking pan dengan butter. Masukkan potongan kiub roti tadi dan taburkan coklat chip di dalam susunan roti dengan sekata.",
                    "Dalam mangkuk berasingan masukkan susu, telur, serbuk koko, air bancuhan kopi, gula dan secubit garam. Kacau menggunakan whisk sehingga sebati.",
                    "Tuangkan adunan susu ke dalam dulang yang berisi roti tadi. Tekan-tekan sedikit roti supaya tenggelam. Rehatkan selama 15 minit supaya roti menyerap cecair adunan.",
                    "Bakar selama 40-50 minit.",
                    "Angkat dan hiaskan dengan coklat sos."
                ],
                "Untuk Coklat Sos": [
                    "Satukan coklat, susu dan butter di dalam mangkuk dan panaskan menggunakan kaedah bain marie atau double boiler. Kacau sebati.",
                    "Boleh juga gunakan microwave. Panaskan semua bahan di dalam microwave sehingga coklat cair dan kacau sebati."
                ]
            },
            "tips_and_guides": [
                "Untuk coklat sos, anda boleh gunakan yang sudah sedia terdapat di pasaran seperti jenama Hersyey. Kalau rajin boleh cuba sediakan sendiri seperti resepi di atas."
            ]
        }
    },
    {
        "title": "Pengat Pisang",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/pengat-pisang",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/6c42c02b90802056f23b9d9b51a9e314ce282818.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "3-4 biji pisang tanduk",
                    "2 mangkuk santan pekat",
                    "2 mangkuk santan cair",
                    "(ATAU boleh gantikan dengan 2 santan kotak dan 2 cawan air)",
                    "1/2 cawan sagu, bersihkan",
                    "2-3 keping nisan/gula melaka",
                    "1/3 cawan gula pasir",
                    "2 helai daun pandan",
                    "garam secukup rasa"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Buang kulit pisang tanduk dan hiris setebal 1-2 cm.",
                    "Rendam dalam air kapur selama 1/2 jam (optional).",
                    "Bilas pisang dan masukkan ke dalam periuk. Masak pisang bersama santan cair, sagu, gula melaka, gula pasir, daun pandan dan garam secukup rasa di atas api yang perlahan. Kacau dengan kerap dan perlahan supaya santan tidak berketul.",
                    "Masukkan pula santan pekat dan kacau seketika. Apabila kuah mula mendidih, tutup api dan siap untuk dihidangkan."
                ]
            },
            "tips_and_guides": [
                "Pisang boleh direndam dengan air kapur seketika supaya isi menjadi kenyal dan tidak hancur.",
                "Kuah santan harus dikacau dengan kerap di atas api perlahan supaya kuah tidak berketul."
            ]
        }
    },
    {
        "title": "Puding Sagu Gula Melaka",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/puding-sagu-gula-melaka",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/4b1538abc023d7cf5f0956340aed215310d71f77.jpeg",
            "masa_penyediaan": "45 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Sagu": [
                    "1 1/2 cawan sagu",
                    "air secukupnya"
                ],
                "Bahan Untuk Kuah Santan": [
                    "2 1/2 cawan santan (dari 1/2 biji kelapa)",
                    "1 sudu besar tepung beras",
                    "1 sudu kecil garam",
                    "1 helai daun pandan, carik dan simpul"
                ],
                "Bahan Untuk Sirap Gula Melaka": [
                    "1 ketul besar gula melaka",
                    "3 sudu besar gula merah serbuk Thai",
                    "2 sudu besar gula pasir",
                    "1 helai daun pandan, carik dan simpul"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Rendamkan biji sagu bersama air selama 1/2 jam. Anggaran air sehingga tenggelam dua ruas jari.",
                    "Rebus sagu di atas api perlahan sehingga hilang putih di tengah-tengah biji. Jika air kurang tambahkan sedikit supaya sagu masak dengan sempurna.",
                    "Tuang sagu di atas penapis dan bilas dengan air mengalir supaya kanjinya keluar.",
                    "Toskan dan masukkan pewarna kesukaan anda. Kacau sekata. Sudukan sagu ke dalam acuan dan sejukkan di dalam peti ais selama 30 minit. Sagu akan terbentuk dan kental apabila sejuk.",
                    "Keluarkan dari acuan dan hidang bersama kuah santan dan sirap gula melaka."
                ],
                "Untuk Kuah Santan": [
                    "Masak santan bersama daun pandan, tepung beras dan garam di atas api perlahan.",
                    "Kacau sekata supaya santan tidak berketul. Apabila kuah sudah mendidih dan pekat, angkat dan sejukkan."
                ],
                "Untuk Sirap Gula Melaka": [
                    "Masukkan air di dalam periuk bersama gula melaka, gula merah Thai, gula pasir dan daun pandan.",
                    "Masak sehingga sirap mendidih pekat dan ketulan gula hilang. Kacau sebati.",
                    "Tapis dan sejukkan."
                ]
            },
            "tips_and_guides": [
                "Kuah santan: Kuah santan haruslah sedikit pekat dan masin. Tidak terlalu masin tetapi cukup untuk mengimbangi rasa manis dari sirap gula melaka.",
                "Sirap gula melaka: Che Nom tambahkan gula merah Thai kerana rasanya yang sedap dan warnanya yang pekat kehitaman. Bila dimasak bersama gula melaka, warna yang terhasil sangat cantik dan rasanya sangat sedap."
            ]
        }
    },
    {
        "title": "Puding Karamel Sedap",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/puding-karamel-sedap",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/14d3e330c5b01ee9b549e3b812baf0bd69660c5b.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "25 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Gula Karamel": [
                    "1/4 cawan gula + 1 sudu besar gula",
                    "3 sudu besar air"
                ],
                "Bahan Untuk Puding": [
                    "5 biji telur, saiz B",
                    "1 tin susu cair",
                    "150ml air",
                    "1/4 cawan gula",
                    "1 sudu kecil esen vanila"
                ]
            },
            "instructions": {
                "Untuk Gula Karamel": [
                    "Panaskan gula dan air di dalam periuk di atas api perlahan sehingga warna bertukar keperangan, kemudian baru kacau sekata.",
                    "Tuang dalam loyang berukuran 6 inci dan ketepikan."
                ],
                "Untuk Puding Karamel": [
                    "Dalam mangkuk, satukan semua bahan menggunakan whisk. Pastikan gula cair dan jangan terlebih pukul sehingga adunan sehingga berbuih. Cukup sekadar adunan larut dan sebati.",
                    "Tapiskan adunan ke dalam loyang gula karamel. Tuang dengan berhati-hati supaya lapisan bawah karamel tidak terjejas.",
                    "Tutup loyang dengan aluminium foil supaya air tidak bertakung sewaktu dikukus. Kukus selama 30-35 minit minit, atau sehingga puding menjadi pejal.",
                    "Boleh juga menggunakan kaedah waterbath dan bakar di dalam oven pada suhu 170°C, selama anggaran 40-45 minit."
                ]
            },
            "tips_and_guides": [
                "Boleh juga sediakan puding karamel menggunakan kaedah 'water bath' atau 'bain marie' dan bakar di dalam oven pada suhu 170°C, selama anggaran 40-45 minit. Kaedah ini menghasilkan puding yang lebih licin dan tidak berongga.",
                "Caranya ialah dengan meletak air panas ke dalam loyang yang lebih besar, kemudian letakkan loyang puding karamel yang telah di tutup dengan kertas aluminium foil dan bakar sehingga masak. Jangan buka oven di sepanjang proses memasak kerana wap air akak meruap keluar dan mengganggu hasil puding nanti."
            ]
        }
    },
    {
        "title": "Agar-Agar Santan Pandan",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/agar-agar-santan-pandan",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/03f0eb0cf447f8c7699a8fc20e578dcdebe48d6d.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "10-12 gram agar-agar (saya gunakan agar-agar bertali)",
                    "1 cawan santan pekat",
                    "1 cawan santan cair",
                    "1 biji telur",
                    "3 1/2 cawan air",
                    "1 1/4 cawan gula (kurangkan sedikit jika tak suka manis)",
                    "1/2 sudu kecil garam",
                    "2-3 helai daun pandan",
                    "beberapa titik pewarna hijau",
                    "beberapa titik perasa pandan (pandan essence)"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Basuh agar-agar dan masukkan ke dalam periuk bersama air. Jika gunakan agar-agar serbuk, terus tuangkan sahaja.",
                    "Masak sehingga mendidih dan agar-agar larut. Masukkan gula, daun pandan, perasa pandan, pewarna hijau, garam dan santan cair. Masak sehingga sebati.",
                    "Pukul sedikit telur bersama santan. Saya tapiskan supaya tiada ketulan apabila masak nanti.",
                    "Tuang bancuhan santan dan telur ke dalam agar-agar dan kacau sehingga mendidih selama beberapa minit.",
                    "Tuang ke dalam loyang dan sejukkan."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Puding Jagung Sedap",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/puding-jagung-sedap",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/312abc6d88a88ea3acfc5c3ffe7d938e711c4318.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1 tin jagung manis berkrim",
                    "1 cawan tepung kastard",
                    "1 cawan gula (kurangkan kepada 3/4 cawan jika suka kurang manis)",
                    "1/2 cawan susu cair",
                    "2 sudu besar tepung jagung",
                    "1/2 sudu kecil garam",
                    "3 cawan santan (ATAU 1 kotak santan 200ml bersama 2 cawan air)",
                    "1 1/2 sudu besar majerin"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Masukkan jagung, tepung kastard gula, susu cair, tepung jagung, garam dan santan di dalam blender dan kisar. Tujuannya supaya jagung dikisar halus dan diadun sebati dengan bahan-bahan lain.",
                    "Masukkan adunan kisar di dalam periuk dan kacau sehingga pekat dan berkilat.",
                    "Kemudian masukkan pula majerin dan kacau sehingga sebati."
                ]
            },
            "tips_and_guides": [
                "Jika anda tak suka jagung yang dikisar halus boleh adun bahan dalam periuk sahaja. Tak perlu di blender."
            ]
        }
    },
    {
        "title": "Puding Karamel Tanpa Telur",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/puding-karamel-tanpa-telur",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/9c5738cd2c38199dce611ba7920b48feb8df891f.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "N/A",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {},
            "instructions": {
                "Untuk Gula Karamel": [
                    "Panaskan gula dan air di dalam periuk di atas api perlahan sehingga warna bertukar keperangan, kemudian baru kacau sekata.",
                    "Tuang dalam loyang dan ketepikan (saya guna loyang bersaiz 8 inci)."
                ],
                "Untuk Membuat Puding": [
                    "Satukan semua bahan untuk puding di dalam periuk.",
                    "Kacau bahan-bahan tadi di atas api sederhana menggunakan whisk atau senduk. Jangan bagi adunan berketul.",
                    "Kacau sehingga adunan mendidih dan sedikit pekat.",
                    "Tapis dan tuang ke dalam loyang berisi karamel tadi.",
                    "Sejukkan sekejap dan masukkan ke dalam peti ais 2-3 jam sebelum di makan."
                ]
            },
            "tips_and_guides": [
                "Semasa proses memanaskan bahan-bahan puding, pastikan anda menggunakan periuk yang tebal dan kacau dengan kerap di atas api yang perlahan supaya adunan tidak mudah hangus di bahagain bawah dan tidak berketul."
            ]
        }
    },
    {
        "title": "Bubur Jagung",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/bubur-jagung",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/7b85b0a9e90835ab0751cba1c510809125d3eca0.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "2 batang jagung, hiris isinya",
                    "1/4 -1/2 cawan gula pasir",
                    "1 keping gula melaka",
                    "1 sudu kecil garam",
                    "2 cawan santan pekat",
                    "1 cawan santan cair",
                    "3 sudu besar biji sagu",
                    "2 helai daun pandan, carik dan simpul"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Masukkan santan cair, daun pandan dan isi jagung ke dalam periuk. Masak di atas api perlahan sehingga mendidih.",
                    "Masukkan gula pasir, gula melaka, garam, sagu dan santan pekat. Kacau perlahan-lahan sehingga bubur mendidih. Kadar manis adalah mengikut citarasa anda. Jika rasa kurang manis boleh tambah lagi sedikit guka."
                ]
            },
            "tips_and_guides": [
                "Bubur haruslah kerap dikacau di atas api yang perlahan sehingga mendidih supaya kuah tidak berketul dan pecah minyak."
            ]
        }
    },
    {
        "title": "Agar-Agar Sirap Selasih",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/agar-agar-sirap-selasih",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/02a68b2fc85c1b122ef0b6a0d89216df98dcc004.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "15 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Lapisan Sirap Selasih": [
                    "1/2 pek agar-agar kering (dari bungkusan 25g), rendam sehingga lembut",
                    "600 ml air (anggaran 2 1/2 cawan air)",
                    "3/4 cawan gula pasir",
                    "1 sudu besar biji selasih, rendam sampai kembang",
                    "1/2 sudu besar pati sirap ros",
                    "1 helai daun pandan"
                ],
                "Bahan Untuk Lapisan Sirap Bandung": [
                    "1/2 pek agar-agar kering (dari bungkusan 25g), rendam sehingga lembut",
                    "400 ml air (anggaran 1 3/4 cawan air)",
                    "1/2 tin susu cair",
                    "3/4 cawan gula pasir",
                    "1/2 sudu besar pati sirap ros",
                    "1 helai daun pandan"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Dalam dua periuk yang berasingan, rebus bahan untuk lapisan sirap selasih (kecuali biji selasih) dan bahan untuk sirap bandung.",
                    "Rebus sehingga mendidih dan pastikan ketulan agar-agar cair sepenuhnya. Kemudian tapis air rebusan agar-agar.",
                    "Untuk bahan sirap selasih, biji selasih boleh ditambah apabila sirap sudah ditapis.",
                    "Tuang sirap selasih ke dalam bekas acuan dan sejukkan. Apabila agar-agar sudah sejuk, cakar atau cucuk-cucukkan permukaan supaya bahagian lapisan atas melekat.",
                    "Tuang bahan sirap bandung dan sejukkan lagi sekali.",
                    "Apabila aga-agar sudah sejuk sepenuhnya, boleh lah dihidangkan."
                ]
            },
            "tips_and_guides": [
                "Agar-agar harus direndam terlebih dahulu supaya mempercepatkan proses memasak agar-agar. Apabila sudah lembut, barulah dimasak dan ketulan agar-agar akan cair dengan sempurna."
            ]
        }
    },
    {
        "title": "Bubur Kacang Hijau",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=2",
        "recipe_url": "https://resepichenom.com/resepi/bubur-kacang-hijau",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/3f3841a698cfa57557898fb312586ba8bafc6a4a.jpeg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "20 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "300 gram kacang hijau",
                    "2 cawan santan pekat",
                    "2 cawan santan cair (dari 1/2 biji kelapa parut)",
                    "3 sudu besar sagu",
                    "1 1/2 senduk gula pasir",
                    "1/2 ketul gula melaka",
                    "garam secukup rasa",
                    "2 helai daun pandan"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Rendam kacang hijau semalaman dan rebus sehingga empuk.",
                    "Masukkan santan cair, gula pasir, gula melaka dan daun pandan ke dalam periuk kacang hijau tadi dan masak sehingga mendidih di atas api perlahan, kemudian masukkan pula sagu.",
                    "Akhir sekali masukkan santan pekat dan kacau perlahan-lahan supaya santan tidak berketul.",
                    "Perasakan dengan sedikit garam supaya kuah dapat menyeimbangi rasa manis dan lemak masin.",
                    "Tambahkan air jika kuah terlalu pekat. Angkat dan hidangkan bubur kacang hijau bersama roti atau begitu sahaja."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Bubur Cha Cha",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=3",
        "recipe_url": "https://resepichenom.com/resepi/bubur-cha-cha",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/2cb74e6f50def20121519cae1e41b38167d86f8e.jpeg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1 ketul kecil gula melaka",
                    "5-6 sudu besar gula",
                    "1 cawan cha cha kering (anggaran 140-150 gram)",
                    "2 mangkuk santan pekat",
                    "3 sudu besar sagu",
                    "1 helai daun pandan, carik dan simpul",
                    "garam secukup rasa"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Rendam sagu seketika, anggaran masa 10 minit.",
                    "Rebus cha cha kering sehingga lembut dan toskan airnya. Kemudian bilas dengan air sejuk untuk menghentikan proses pemanasan.",
                    "Masukkan santan, daun pandan dan cha cha yand direbus tadi ke dalam periuk. Masak di atas api perlahan, dan kacau dengan kerap supaya santan tidak berketul.",
                    "Apabila mendidih masukkan sagu, gula pasir, gula melaka dan garam secukup rasa. Jika kuah terlalu pekat boleh tambahkan sedikit air.",
                    "Teruskan kacau sehingga bubur masak sebati. Angkat dan hidangkan."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Badak Berendam",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=3",
        "recipe_url": "https://resepichenom.com/resepi/badak-berendam",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/058cadb420320195d5e24c399195426788b1ce48.jpeg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "20 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk  Inti": [
                    "1/2 biji  kelapa parut",
                    "2 sudu besar gula pasir",
                    "gula melaka secukupnya",
                    "2 sudu besar gula pasir",
                    "1/2 sudu kecil garam",
                    "1/2 sudu besar tepung gandum",
                    "1 helai dauh pandan, ikat simpul"
                ],
                "Bahan Untuk Kuah": [
                    "3 cawan santan",
                    "3 sudu besar tepung beras, bancuh dengan sedikit air",
                    "1 sudu kecil garam",
                    "1 helai daun pandan, ikat simpul"
                ],
                "Bahan Untuk Badak Berendam": [
                    "2 cawan tepung pulut",
                    "1 1/2 cawan air pandan (tak perlu pekat sangat)",
                    "1/2 sudu kecil garam",
                    "pewarna merah",
                    "pewarna hijau"
                ]
            },
            "instructions": {
                "Untuk Inti Kelapa": [
                    "Panaskan kuali. Masukkan kelapa, gula melaka, dan gula pasir. Kacau bersama daun pandan yang disimpul bersama air. Pastikan inti kelapa ini cukup manisnya. Kalau kurang ,anis, tambah lagi ketulan gula melaka. Bila agak kering taburkan tepung gandum dan terus kacau sehingga masak supaya inti melekat senang dibuat bulat."
                ],
                "Untuk Kuah Santan": [
                    "Masak santan bersama bancuhan tepung beras, garam dan daun pandan.",
                    "Masak di atas api perlahan dan kacau sehingga mendidih. Pastikan anda selalau kacau kuah supaya tidak berketul.",
                    "Hidangkan bersama bebola badak berendam."
                ],
                "Untuk Badak Berendam": [
                    "Bancuh tepung pulut bersama air pandan dan garam sehingga menjadi doh yang lembut dan boleh dibentuk bulat.",
                    "Bahagikan kepada dua bahagian. Satu bahagian di uli sekata bersama pewarna hijau, dan satu bahagian lagi di uli bersama pewarna  merah.",
                    "Bulatkan sebesar ibu jari dan leperkan. Masukkan inti kelapa dan bulatkan dengan kemas.",
                    "Rebus bebola di dalam air mendidih sehingga timbul di permukaan. Sejat air dan masukkan ke dalam kuah santan."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Agar-agar Koktail",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=3",
        "recipe_url": "https://resepichenom.com/resepi/agar-agar-koktail",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/054dd0db629e0a225d929275ee37a1a5b7192dca.jpeg",
            "masa_penyediaan": "5 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {},
            "instructions": {
                "Penyediaan Utama": [
                    "Basuh agar-agar dan rebus bersama air sehingga larut.",
                    "Kemudian masukkan gula pasir, daun pandan dan buah-buahan koktel berserta airnya sekali.",
                    "Masukkan susu cair dan masak di atas api yang perlahan hingga 2-3 minit.",
                    "Tuang di dalam loyang dan sejukkan."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Serawa Labu Istimewa Bonda",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=3",
        "recipe_url": "https://resepichenom.com/resepi/serawa-labu-istimewa-bonda",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/fd9c1f2b77e85129c9b9b7072949a9cd9009db21.jpeg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "15 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1/2 biji labu",
                    "2 atau 3 cawan santan pekat,",
                    "2 cawan santan cair",
                    "1 helai daun pandan, carik dan simpul",
                    "1 sudu besar gula putih",
                    "sedikit gula melaka, anggaran satu sudu besar"
                ]
            },
            "instructions": {
                "Untuk Memasak": [
                    "Kupas kulit labu dan bersihkan.",
                    "Masukkan labu dalam periuk bersama daun pandan, santan cair dan 1 sudu besar gula pasir dan gula melaka. Tutup periuk dan masak di atas api perlahan sehingga labu agak empuk atau lembut. Jangan terlalu lembut kerana labu akan mudah hancur.",
                    "Masukkan santan pekat dan garam secukup rasa. Anggarkan garam secukupnya supaya santan akan menghasilkan rasa lemak yang sedap.",
                    "Masak di atas api perlahan sehingga kuah mendidih, tetapi harus dikacau dengan kerap supaya kuah santan tidak berketul.",
                    "Apabila kuah sudah pekat sebati dan labu sudah lembut, angkat dan hidangkan."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Agar-Agar Santan Gula Melaka",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=3",
        "recipe_url": "https://resepichenom.com/resepi/agar-agar-santan-gula-melaka",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/3dfc4f154cb25943be289171bb82d8410ac61fd0.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1 sudu besar gula pasir",
                    "10-12 gram agar-agar (saya guna agar-agar bertali)",
                    "3 1/2 cawan air",
                    "3 helai daun pandan",
                    "1 biji telur",
                    "1 cawan santan pekat",
                    "1 cawan santan cair",
                    "1 ketul gula melaka (anggaran dalam 220 gram)",
                    "1 sudu besar gula merah thai",
                    "1/2 sudu kecil garam"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Pukul telur bersama santan pekat, tapis dan ketepikan. Ini kerana untuk mengelakan ketulan telur putih yang tak sekata apabila dimasak nanti.",
                    "Masak gula melaka, gula merah thai dan gula pasir sehingga larut dan kemudian tapis. Masak agar-agar bersama air gula tadi dan daun pandan sehingga cair.",
                    "Masukkan santan cair, garam dan kacau sebati.",
                    "Masukan bancuhan santan pekat dan kacau sehingga mendidih. Teruskan mengacau selama 2-3 minit ketika mendidih. Ini supaya gumpalan hakus dapat terbentuk cantik.",
                    "Tuang dalam loyang dan sejukkan."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Bubur Pulut Hitam Sedap",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=3",
        "recipe_url": "https://resepichenom.com/resepi/bubur-pulut-hitam-sedap",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/ac135d2de0475d89b30f3a50e0e2233b3ce27cb1.jpeg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "40 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan UtamaBubur": [
                    "6 cawan air, untuk merebus pulut",
                    "1 1/2 cawan pulut hitam",
                    "1/2 biji kelapa (anggaran 2 cawan santan pekat dan 2 cawan santan cair)",
                    "2 helai daun pandan, carikkan dan simpul",
                    "3/4 cawan gula putih",
                    "1/2 ketul gula melaka",
                    "garam secukup rasa",
                    "1 sudu besar tepung jagung"
                ]
            },
            "instructions": {
                "Untuk Masak Bubur Pulut Hitam": [
                    "Rebus pulut hitam dengan air dan daun pandan sehingga lembut. Pulut hitam akan pecah kembang apabila lembut. Biarkan pulut masak dan kuah menjadi pekat.",
                    "Masukkan santan cair, garam, gula putih dan gula melaka. Masak sehingga mendidih.",
                    "Kemudian masukkan pula 1 cawan santan pekat. Pada waktu ini anda boleh sesuaikan rasa manis dan masin ikut selera sendiri."
                ],
                "Untuk Kuah Santan": [
                    "Masak baki 1 cawan santan tadi di atas api yang kecil sehingga mendidih. Perlu selalu kacau supaya santan tidak berketul.",
                    "Bancuh tepung jagung dengan sedikit air dan tuangkan dalam santan. Kemudian masukkan garam secukup rasa."
                ]
            },
            "tips_and_guides": [
                "Rendam pulut hitam semalaman. Ini supaya dapat menjimatkan masa merebus. Kalau tak cukup masa, memadai rendam selama 3-4 jam, tetapi pulut perlu direbus agak lama untuk kembang dan lembut."
            ]
        }
    },
    {
        "title": "Agar-Agar Lapis Milo",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=3",
        "recipe_url": "https://resepichenom.com/resepi/agar-agar-lapis-milo",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/a40789f5eba10ab16cd4609e3a621e8b3124d0c4.jpeg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "20 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "2 sudu besar serbuk koko",
                    "1 bungkus atau 25 gram agar-agar kering",
                    "6 cawan atau 1200ml air",
                    "1 tin  susu cair",
                    "1 1/4 cawan gula pasir (ATAU 1 cawan jika anda suka kurang manis)",
                    "1/3 cawan serbuk milo",
                    "1/2 sudu teh garam halus",
                    "2 helai daun pandan"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Basuh agar-agar kering. Masukkan air dan rendam selama 5 minit. Panaskan api dan masak agar-agar sehingga cair dan tidak berketul.",
                    "Masukkan gula dan daun pandan yg dicarik dan disimpul. Apabila gula sudah cair, masukkan susu cair dan kacau sebati.",
                    "Bahagikan cecair agar-agar kepada nisbah 3 bahagian untuk perasa milo dan 1 bahagian perasa susu.",
                    "Untuk perasa milo, masukkan serbuk milo dan serbuk koko. Kacau dengan whisk sehingga sebati. Tuang dalam bekas dan masukkan agar-agar milo di dalam peti ais sehingga permukaan membeku.",
                    "Untuk bahagian susu, masukkan garam dan kacau sebati.",
                    "Cakar bahagian permukaan agar-agar milo supaya lapisan atas melekat. Tuang bahagian susu di atas lapisan milo dan sejukkan kembali di dalam peti ais.",
                    "Apabila beku dan sejuk sepenuhnya, potong dan hidangkan."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Puding Oren Sunqick",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=3",
        "recipe_url": "https://resepichenom.com/resepi/puding-oren-sunqick",
        "details": {
            "image_url": "https://resepichenom.com/uploads/profile/99d7f34158722068.jpg",
            "masa_penyediaan": "N/A",
            "masa_memasak": "N/A",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1paket agar2 tali (25gm)",
                    "3 biji telur",
                    "1300 ml air",
                    "400 ml santan (200ml santan kotak + 200ml air)",
                    "200 ml oren sunquick",
                    "400 gm gula (bole tmbah atau kurang)",
                    "2 sudu teh pewarna oren"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Masak agar2 bersama air hingga hancur. Tapiskan dan masak bersama gula.",
                    "Campurkan santan dan telur dlm satu bekas dan pukul sedikit dgn garfu.",
                    "Bila gula hancur, masukkan campuran santan dan telur tadi. Kacau.",
                    "Bila mendidih, kecilkan api dan masukkan oren sunquick bersama pewarna oren. Kacau.",
                    "Bila campuran agar2 kelihatan berbintil2, matikan api. Masukkan campuran dlm acuan pilihan.",
                    "Selamat mencuba."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Agar-agar santan",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=3",
        "recipe_url": "https://resepichenom.com/resepi/agar-agar-santan",
        "details": {
            "image_url": "https://resepichenom.com/uploads/profile/99d7f34158722068.jpg",
            "masa_penyediaan": "25 minit",
            "masa_memasak": "15 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "30 gram agar-agar",
                    "2 cawan pati santan",
                    "2 cawan air",
                    "11/4 cawan gula",
                    "1/2 sudu teh esen vanila",
                    "1//4 sudu teh garam",
                    "bahan pewarna"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Masak agar-agar hingga hancur, kemudian masukkan gula, angkat dan tapis",
                    "masukkan santan, garam, esen vanila dan bahan pewarna",
                    "Kacau rata-rata kemudian tuangkan ke dalam acuan dan bekukan."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Puding Roti",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=3",
        "recipe_url": "https://resepichenom.com/resepi/puding-roti",
        "details": {
            "image_url": "https://resepichenom.com/uploads/profile/99d7f34158722068.jpg",
            "masa_penyediaan": "35 minit",
            "masa_memasak": "15 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "Bahan untuk di kisar",
                    "4 keping roti*",
                    "2 biji telur ayam *",
                    "1 tin susu cair (400ml)*",
                    "1 sudu teh asen vanilla*",
                    "Bahan-bahan lain",
                    "10 gm serbuk agar-agar",
                    "1 cawan gula pasir",
                    "3 cawan air",
                    "2 sudu besar majerin",
                    "3 jenis pewarna kesukaan"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Masak serbuk agar-agar dan juga gula bersama air di atas api dapur. dah larut masukkan gula.",
                    "Sementara itu, masukkan bahan-bahan bertanda * ke dalam mesin pengisar(blender) dan kisar halus.",
                    "Tuang bahan kisar ke dalam larutan agar-agar yang mendidih.",
                    "Kacau sentiasa hingga larutan agak pekat.",
                    "Masukkan majerin dan kacau hingga larutan menggelegak. Tutup api dapur.",
                    "Bahagi larutan puding kepada 3 bahagian. Warnakan setiap bahagian dengan pewarna yang berlainan. (Kalau guna serbuk koko, gaul sebati serbuk koko dengan salah satu bahagian larutan puding).",
                    "Basahkan loyang atau acuan pilihan dan sendukkan larutan puding berselang-seli setiap bahagian. Sendukkan adunan terus menerus, maknanya tak perlu tunggu keras adunan yang dah disendukkan ke dalam loyang tu. Kalau nak dapatkan corak seperti di atas tu, sengetkan loyang dan sendal loyang tu di salah satu hujungnya supaya tak jatuh. Kemudian mulalah menyenduk adunan berselang-seli hingga habis digunakan. Kembalikan loyang pada kedudukan asal dan biar puding keras.",
                    "Masukkan ke dalam peti sejuk. Hidangkan sejuk-sejuk memang sedap."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Puding Roti Dan Sos Vanilla",
        "page_url": "https://resepichenom.com/kategori/pencuci-mulut?page=3",
        "recipe_url": "https://resepichenom.com/resepi/puding-roti-dan-sos-vanilla",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/134efd942a0184a0b4c3261d0668e82682159588.jpeg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "45 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "6 keping roti, yang dipotong tebal dan dibakar seketika dan dipotong kiub",
                    "2 sudu besar mentega, cairkan",
                    "3/4 cawan gula putih",
                    "4 biji telur",
                    "1 sudu kecil esen vanilla",
                    "1/2 sudu kecil serbuk kayu manis",
                    "2 cawan susu full cream"
                ],
                "Bahan Untuk Sos Vanila": [
                    "1/2 cawan gula perang",
                    "1 sudu besar tepung gandum",
                    "secubit serbuk kayu manis",
                    "1 biji telur",
                    "2 sudu besar mentega",
                    "1 1/4 cawan susu full cream",
                    "1 sudu kecil esen vanilla",
                    "secubit garam"
                ]
            },
            "instructions": {
                "Untuk Puding Roti": [
                    "Panaskan oven pada suhu 175 darjah celsius",
                    "Dalam bekas pembakar (saya guna bekas berukuran 35x25cm), taburkan roti yangtelah dipotong menjadi kiub dan tuangkan mentega yang telah dicairkan ke atas roti.",
                    "Dalam bekas berasingan, masukkan susu, telur, esen vanilla, serbuk kayu manis dan gula. Putar sehingga sebati dan tuangkan ke dalam bekas roti. Gunakan garfu untuk menekan roti sehingga tengelam dan menyerap adunan.",
                    "Bakar dalam oven selama 40-45 minit, atau sehingga bahagian atas menjadi keperangan."
                ],
                "Untuk Sos Vanilla": [
                    "Dalam periuk kecil, campurkan susu, telur, gula, garam, serbuk kayu manis, butter dan tepung. Panaskan di atas api sederhana dan kacau berterusan sehingga sos menjadi pekat, atau sehingga sos melekat bila di belakang sudu bila dicelupkan.",
                    "Masukkan esen vanilla dan kacau lagi sehingga sebati. Tutup api dan sejukkan seketika. Hidangkan bersama puding roti."
                ]
            },
            "tips_and_guides": []
        }
    }
]