[
    {
        "title": "Sandwich Telur Hancur",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sandwich-telur-hancur",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sandwich_Telur_Hancur.jpg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "12 keping roti",
                    "6 biji telur",
                    "4 sb susu full cream",
                    "2 sb mentega",
                    "3-4 sb mayonis",
                    "1/2 sk serbuk lada hitam",
                    "1/4 sk serbuk lada putih",
                    "Garam secukup rasa",
                    "1 sb perahan jus limau atau lemon",
                    "Daun salad",
                    "Tomato",
                    "Majerin, untuk sapuan roti",
                    "Kotak 12x12x2 inci",
                    "Paper doillies 4.5 inci"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Trim tepi roti dan simpan dulu dalam bekas tertutup (nak elak roti kering).",
                    "Pecahkan telur dan masukkan susu full cream. Pukul sebati.",
                    "Panaskan kuali, cairkan butter (atau majerin) dan masukkan telur. Masak atas api perlahan.",
                    "Dah nampak telur keras sikit, boleh kacau kerap sikit sambil hancur-hancurkan telur.",
                    "Bila telur dah masak, boleh angkat kemudian gaul dengan mayonis, serbuk black pepper, lada sulah, garam dan jus limau nipis.",
                    "Hiris nipis tomato.",
                    "Keringkan salad dengan salad spinner.",
                    "Sapu butter pada roti dan sudukan inti telur.",
                    "Layerkan dengan hirisan tomato dan salad",
                    "Tutup dengan roti dan potong kepada 4 bahagian.",
                    "Lapis dengan doilies paper dan susun dalam kotak."
                ]
            },
            "tips_and_guides": [
                "Untuk salad yang segar, rendam salad ni dalam air sejuk dari peti ais anggaran ½ jam. Kalau tak cukup air sejuk, rendam dalam air paip kemudian tutup dan simpan dalam peti sejuk. Bila dah segar dan crunchy baru toskan air.",
                "Kalau takut ada telur busuk rosakkan yang lain, pecah asing satu-satu baru campur.",
                "Boleh tambah chicken slice kalau nak lebih fancy.",
                "Nak elak roti terbang masa potong, boleh terbalikkan, sapuan telur duduk dekat atas. Ataupun susun salad dulu baru telur."
            ]
        }
    },
    {
        "title": "Donut Tanpa Telur",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/donut-tanpa-telur",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Donut_Tanpa_Telur.jpg",
            "masa_penyediaan": "50 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1/2 sk garam",
                    "2 cwn tepung gandum atau tepung roti",
                    "2 sb majerin",
                    "1 sk serbuk penaik",
                    "1/2 cwn air suam",
                    "2 sk yis",
                    "1 sb gula",
                    "2 sb susu pekat manis",
                    "1/2 cwn air (utk tambah masa uli jika perlu)",
                    "Gula kastor",
                    "Serbuk kayu manis (jika suka)"
                ]
            },
            "instructions": {
                "Donut": [
                    "Bancuh yis dengan air suam, gula dan susu pekat manis. Biarkan 5-10 minit.",
                    "Gaul tepung gandum, baking powder dan garam.",
                    "Bila adunan yis dah berbuih, tuang masuk dalam adunan kering dan gaul sebati.",
                    "Tambah air (jika perlu) dan uli sampai boleh bentuk.",
                    "Tambah majerin dan uli sampai doh tak melekat pada tangan.",
                    "Sapu minyak pada mangkuk, letak doh yang kita uli tadi, tutup dengan kain dan perap sampai naik 2x ganda.",
                    "Bahagi doh kepada 25g setiap satu (kalau nak besar boleh buat 30g).",
                    "Bulatkan doh, leperkan dan tekan dengan chopstick di tengah untuk buat lubang.",
                    "Letak atas kertas baking atau talam yang ditabur tepung dan biarkan doh kembang.",
                    "Panaskan minyak dan goreng dalam minyak sederhana panas sampai donut perang dan gebu.",
                    "Angkat dan toskan minyak. Biarkan donut  suam."
                ],
                "Gula": [
                    "Gaul sekata gula dengan serbuk kayu manis.",
                    "Salut donut dengna gula masa masih suam-suam panas."
                ]
            },
            "tips_and_guides": [
                "Tip untuk jimat, beli yis pek 500g lepastu asingkan masuk dalam plastic zip lock dan simpan dalam freezer, cara ni lebih murah dari beli pek yang kecik tu dan tahan untuk jangka masa panjang.",
                "Boleh guna tepung roti (high protein), hasil kalau guna tepung roti lebih gebu dan lembut.",
                "Nak buat roti ni eloknya time panas, kalau hujan yis pon tarik selimut malas nak buat kerja, sejuk kan.",
                "Jangan overproof atau lama sangat nanti hilang structure dan texture donut, tak kembang gebu bila kita goreng nanti.",
                "Goreng dalam api sederhana, kalau api besar nanti luar donut cepat sangat perang tapi dalam tak masak lagi.",
                "Minyak kena banyak sampai terapung sebab kita nak donut perang sekata.",
                "Untuk elak donut serap minyak, pertama jangan goreng penuh-penuh kuali nanti suhu minyak jatuh. Kedua jangan kerap alih, tunggu masak sebelah bawah baru alih."
            ]
        }
    },
    {
        "title": "Lempeng dan Sambal Bilis",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/lempeng-dan--sambal-bilis",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Lempeng_Sambal_Bilis_2.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Lempeng": [
                    "3 cwn tepung gandum",
                    "4 - 4 1/2 cwn air",
                    "1 sb gula",
                    "1/2 sk garam",
                    "2 sb minyak"
                ],
                "Bahan Sambal Bilis": [
                    "150g-200g ikan bilis",
                    "1 cwn minyak masak",
                    "2 biji bawang besar",
                    "15-20 tangkai cili kering",
                    "4 biji bawang merah kecil",
                    "3-4 ulas bawang putih",
                    "1/2 inci belacan (pilihan)",
                    "1 keping kecil gula nisan",
                    "Sedikit jus asam jawa",
                    "Garam secukup rasa",
                    "Perasa jika suka"
                ]
            },
            "instructions": {
                "Lempeng": [
                    "Bancuh tepung gandum, garam, air dan minyak masak.",
                    "Tapis kalau ada ketulan tepung.",
                    "Panaskan kuali dan sapu sikit minyak.",
                    "Tuang masuk 2 senduk adunan dan ratakan.",
                    "Masak sampai garing kedua-dua belah bahagian."
                ],
                "Sambal Bilis": [
                    "Potong bawang besar untuk kisar (1 biji), taburan (1/2 biji) dan menumis (1/2 biji).",
                    "Cincang kasar bawang merah kecil dan bawang putih.",
                    "Kisar halus bawang besar, bawang merah kecil, bawang putih, belacan dan cili kering rebus dengan air separuh tenggelam.",
                    "Rendam asam jawa dan ramas sampai jadi jus yang pekat. Ketepikan dulu.",
                    "Panaskan minyak dan goreng ikan bilis separuh masak, jangan goreng garing nanti liat dalam sambal.",
                    "Angkat ikan bilis dan toskan minyak.",
                    "Tumis bawang besar sampai layu.",
                    "Masuk bahan kisar halus dan air. Tumis sampai pecah minyak. Ulang tambah air dan tumis kering 3 kali.",
                    "Bila sambal dah kering, masukkan gula nisan dan kacau sebati.",
                    "Masukkan ikan bilis goreng, air asam jawa dan garam.",
                    "Tabur hirisan bawang merah dan tutup api."
                ]
            },
            "tips_and_guides": [
                "Sebelum tuang adunan dalam kuali kena kacau dulu adunan sebab adunan cair dan mendap.",
                "Kena tunggu lempeng garing sebelah bawah dulu baru terbalikkan. Kalau tak nanti susah nak alihkan.",
                "Kuali jangan panas sangat, nanti lempeng jadi berbonjol-bonjol."
            ]
        }
    },
    {
        "title": "Roti Canai",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/roti-canai",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Roti_Canai.jpg",
            "masa_penyediaan": "N/A",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Roti Canai": [
                    "1 kilo tepung gandum",
                    "1 sb gula",
                    "3 sk garam",
                    "4 sb susu pekat",
                    "1 biji telur",
                    "250ml air suam",
                    "250ml air suhu bilik",
                    "2 sb majerin"
                ],
                "Bahan Untuk Kari Dalca": [
                    "200g / 1 cwn kacang dal",
                    "2 ulas bawang putih",
                    "1 sk serbuk kunyit",
                    "Air secukupnya (utk rebus)",
                    "1 sb serbuk kari",
                    "1 sb serbuk cili",
                    "Tulang ayam",
                    "1/2 biji labu air",
                    "1/2 biji terung panjang",
                    "1 biji kentang",
                    "1/2 batang karot",
                    "3 sb santan kotak",
                    "Sedikit air asam jawa",
                    "1/4 cwn minyak masak",
                    "1 sk biji sawi",
                    "1 batang kayu manis",
                    "4 biji bawang merah kecil",
                    "1 tangkai daun kari",
                    "4 biji cili kering"
                ]
            },
            "instructions": {
                "Untuk Roti Canai": [
                    "Cairkan majerin kemudian ketepikan dulu. Nak mudah adun seloknya cairkan dulu majerin.",
                    "Masukkan gula, garam, susu pekat dan air suam ke dalam mangkuk besar. Kemudian kacau sebati.",
                    "Tambah lagi air (suhu bilik), telur dan majerin cair. Sambung kacau.",
                    "Dalam mangkuk yang berasingan masukkan tepung gandum.",
                    "Kemudian tuang adunan cair separuh-separuh sambil uli sampai doh lincin dan tak melekat pada tangan. Tambah air sikit kalau doh masih keras.",
                    "Bila doh dah lincin dan tak melekat, boleh tutup dan rehatkan selama 30 minit.",
                    "Selepas 30 minit, bulatkan doh kecil-kecil. Caranya tolak doh keluar di antara ibu jari dan jari telunjuk. Kemudian tolak jadi bulat dan tarik keluar.",
                    "Cara lagi senang timbang berat semua doh dan bahagi kepada 19-22 biji doh.",
                    "Sapu majerin pada bekas dan tangan, kemudian lumur majerin pada doh yang kita bulatkan kecil tadi.",
                    "Susun doh dalam mangkuk dan tutup rapat doh dengan plastic",
                    "Kemudian simpan semalaman atau 5-6 jam dalam peti sejuk.",
                    "Keluarkan doh dari peti sejuk, keluarkan 2-3 jam sebelum masak supaya sejuk hilang sepenuhnya dan jadi lembut untuk ditebar.",
                    "Lumur minyak atas meja (pastikan meja bersih yer).",
                    "Ambil satu doh dan tekan leper dengan tapak tangan.",
                    "Kemudian tebar roti sampai nipis",
                    "Bila dah jadi besar Che Nom dah tak reti tebar, jadi Tarik doh sampai nipis.",
                    "Tuang sikit minyak dan majerin atas doh yang kita canai tadi.",
                    "Lipat 2 doh, tarik memanjang dan lipat lagi menjadi segi 4 sama.",
                    "Kemudian tolak atau selit (dari lipatan sisi) jadi bulat.",
                    "Rehatkan  doh sebelum kita goreng.",
                    "Tekan leper doh (tak nipis pon tak pe tapi kalau nipis dapat la  roti canai yang garing).",
                    "Panaskan kuali dan gris sedikit minyak.",
                    "Kemudian boleh la goreng roti canai.",
                    "Bila dah garing boleh la angkat.",
                    "Susun roti canai atas meja dan kemudian tepuk (supaya roti canai lebih gebu)."
                ],
                "Untuk Kuah Kacang Dal": [
                    "Bilas bersih kacang dal dan kemudian rendam 4-5 jam atau seloknya semalaman.",
                    "Tapis kacang dal dan masukkan dalam periuk",
                    "Ketuk hancur bawang putih dan masukkan dalam periuk.",
                    "Tambah air dan serbuk kunyit kemudian rebus sampai lembut.",
                    "Kupas kulit carrot, kentang dan terung kemudian potong dadu besar (kalau kecil hancur pulak masa rebus nanti).",
                    "Labu air kupas kulit, buang bahagian tengah yang keras  dan kemudian potong dadu besar.",
                    "Untuk tambah sedap kuah Che Nom guna tulang ayam. Potong tulang ayam kecil-kecil.",
                    "Bila kacang dal dah lembut, ambil separuh kacang dal dan kisar halus.",
                    "Tuang masuk balik kacang dal yang kisar tadi kedalam periuk.",
                    "Masukkan serbuk cili dan serbuk kari daging. Kacau sebati.",
                    "Masukkan tulang ayam, sayur karrot dan kentang. Masak sampai sayur lembut.",
                    "Bila kentang dan carrot dah lembut, boleh masukkan sayur yang lembut macam labu air dan terung.",
                    "Sambung reneh sampai kuah jadi pekat dan sayur masak lembut.",
                    "Masukkan santan kotak (kuah dal ni ada yang tak letak santan, Che Nom letak sikit je sebab takut kuah berlemak).",
                    "Masukkan garam secukup rasa.",
                    "Akhir sekali masukkan air asam jawa.",
                    "Bila kuah dan mendidih boleh tutup api."
                ],
                "Untuk Penyediaan Tumis Darat": [
                    "Hiris nipis bawang merah kecil.",
                    "Gunting kasar cili kering.",
                    "Panaskan minyak masak.",
                    "Tumis biji sawi dan kulit kayu manis.",
                    "Masukkan daun kari, hirisan bawang merah dan cili kering.",
                    "Kacau sampai bawang masak kekuningan dan naik bau.",
                    "Tutup api dan tuang masuk dalam kuah kari dal.",
                    "Cepat-cepat tutup periuk dan biarkan 10-15 minit atau ½ jam.",
                    "Kuah kari dal sedia untuk dihidang bersama roti canai"
                ]
            },
            "tips_and_guides": [
                "Masa tebar tekan dengan tapak tangan, jangan tekan dengan jari kalau tekan dengan jari nanti doh  tak sekata dan jadi mudah koyak bila kita tebar.",
                "Cara untuk tebar roti canai, kita pegang dengan 2 tangan. Tangan kanan angkat doh dan kanan kiri ikut je. Kita angkat doh dan hempas atas meja. Sambil tebar boleh pusing sampai dapat betuk bulat yang sekata.",
                "Kalau tak pandai tebar, boleh guna cara mak Che Nom dengan mengunakan belakang dulang. Caranya kita tekan doh sampai leper sambil tarik sampai nipis dan selit tepi dulang.  Akhir sekali boleh lipat doh dan gulung macam biasa.",
                "Untuk goreng roti canai, kuali seeloknya guna yang tebal barulah roti masak sekata dan tak mudah hangit.",
                "Kalau nak frozen roti canai, boleh goreng kuning-kuning je lepastu simpan dalam peti ais tempat beku."
            ]
        }
    },
    {
        "title": "Roti Sardin Goreng",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/roti-sardin-goreng",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Roti_Sardin_Goreng_Rangup.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "20 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Roti Sardin": [
                    "2 sb minyak masak",
                    "1 biji bawang merah besar",
                    "2 sb cili kisar",
                    "1 sb sos tiram",
                    "1 tin besar /425g ikan sardin",
                    "2 cili merah besar",
                    "1 sk gula",
                    "Jus limau atau air asam jawa",
                    "3 sb mayonis",
                    "16 keping roti putih",
                    "Majerin"
                ],
                "Bahan Untuk Adunan Tepung": [
                    "3 senduk tepung beras",
                    "2 senduk tepung ubi",
                    "2 senduk tepung gandum",
                    "1 senduk tepung jagung",
                    "1 sk garam",
                    "1/2 sk serbuk kunyit",
                    "Air secukupnya",
                    "1 sk gula",
                    "1 sk gula"
                ]
            },
            "instructions": {
                "Untuk Inti Sardin": [
                    "Potong dadu bawang merah besar.",
                    "Cili merah buang biji dan potong kasar (kalau suka pedas boleh ganti dengan cili padi).",
                    "Untuk balance kan rasa dan hilangkan hanyir, boleh perah jus limau kasturi atau air asam jawa.",
                    "Keluarkan sardin dari tin kemudian asingkan kuah dan ikan.",
                    "Tulang sardin Che Nom buang, kalau anda jenis tak kesah tak perlu buang.",
                    "Panaskan minyak dan tumis bawang merah (tumis 1 sudu besar sahaja bawang merah, baki Che Nom masuk kemudian).",
                    "Bila bawang dah layu, masukkan cili kisar. Tumis sampai cili garing.",
                    "Tambah sikit sos tiram.",
                    "Masukkan semua isi ikan sardin. Sambil masak tekan-tekan isi ikan sardin bagi hancur.",
                    "Tambah kuah sardin sikit-sikit dan masak sampai jadi tersejat dan pekat.",
                    "Masuk hirisan cili merah, gula, dan air asam jawa atau jus limau.",
                    "Bila dah agak kering, masukkan baki bawang besar tadi. Kita tambah bawang akhir sekali sebab kita nak texture rangup-rangup bila kita makan nanti.",
                    "Bila bawang dah layu, tutup api dan sejukkan.",
                    "Bila inti dah sejuk, masukkan mayonis dan kacau sebati."
                ],
                "Untuk Roti": [
                    "Trim tepi roti (pilihan, boleh je kalau tak nak trim)",
                    "Sapu roti dengan majerin nipis-nipis (nak guna butter pon boleh).",
                    "Sapu inti sardin, nak banyak ke sikit ke boleh adjust.",
                    "Lepas tutup, kita potong segi tiga.",
                    "Tutup dulu dengan bekas atau kain untuk elak kering sementara kita sediakan tepung salutan."
                ],
                "Untuk Tepung Salutan": [
                    "Bila roti dah perang dan rangup boleh angkat dan toskan minyak.",
                    "Sukat 3 senduk tepung beras, 2 senduk tepung ubi, 2 senduk tepung gandum dan 1 senduk tepung jagung.",
                    "Masukkan garam, serbuk kunyit, air dan gula.",
                    "Kacau sebati.",
                    "Panaskan minyak yang agak banyak.",
                    "Celup roti dalam adunan tepung dan goreng biar sekata (takut  inti terkeluar nanti).",
                    "Goreng dengan api sederhana biar perlahan-lahan goreng, barulah garing tahan lama."
                ]
            },
            "tips_and_guides": [
                "Che Nom letak  kuah sardin dalam ¾ dari baki kuah tadi, nak letak semua pon boleh.",
                "Untuk inti sardin Che Nom memang tak letak dah garam. Sardin dari Agromas ni dia tak rasa masin sangat, jadi bila kita masak sampai pekat kering, inti rasa elok-elok je.",
                "Untuk resepi ni Che Nom dapat dari viewer, resepi arwah bonda beliau. Tepung sukat guna nisbah 3:2:2:1. Che Nom sukat dengan senduk jadi sukat dengan senduk yang sama semuanya, kalau guna cawan, guna cawan yang sama semuanya.",
                "Pastikan adunan sederhana cair, jangan pekat sangat takut nanti roti jadi keras bila sejuk, cair sangat pun tak boleh takut melekat pulak nanti.",
                "Jangan goreng roti banyak-banyak pada satu-satu masa takut suhu minyak jatuh, roti goreng akan serap minyak dan tak garing la."
            ]
        }
    },
    {
        "title": "Cucur Kembung cicah Sambal Sardin",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/cucur-kembung-cicah-sambal-sardin",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Cucur_Kembung.jpg",
            "masa_penyediaan": "40 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Cucur Kembung": [
                    "2 cwn / 250g tepung gandum",
                    "3/4 cawan air suam",
                    "1 1/2 sk yis kering",
                    "2 sb gula",
                    "1/2 sk garam",
                    "1/2 cawan air, masuk sikit-sikit",
                    "1 sb majerin"
                ],
                "Bahan Untuk Sambal Sardin": [
                    "1 tin besar sardin",
                    "3 ulas bawang putih",
                    "1-2 biji bawang merah kecil",
                    "2-3 sb cili kisar",
                    "2 biji tomato",
                    "1 sb sos tiram",
                    "1 biji kentang",
                    "1 biji bawang besar",
                    "1-2 sb jus asam jawa",
                    "Garam secukup rasa",
                    "Cili merah & cili padi"
                ]
            },
            "instructions": {
                "Untuk Cucur Kembung": [
                    "Masuk yis kering dan gula dalam air suam. Kacau sebati dan ketepikan selama beberapa minit atau sampai yis berbuih. (Cara ni untuk check yis ok atau tak, kalau adunan berbuih maksudnya yis aktif dan tak rosak. Tapi kalau yakin boleh skip dan terus masuk yis kering dalam adunan kering).",
                    "Masukkan tepung gandum (kalau ada tepung roti lagi bagus) dan garam dalam mangkuk adunan. Kacau sikit.",
                    "Masukkan adunan yis dan sedikit air. Kemudian sambung gaul.",
                    "Masukkan mentega dan uli sampai doh elastic dan kurang melekat dekat tangan.",
                    "Bulatkan dan rehatkan sampai doh kembang 2 kali ganda (anggaran 40 minit – 1 jam).",
                    "Selepas doh dah kembang, tumbuk doh atau uli sikit untuk keluarkan angin.",
                    "Canai doh menjadi leper anggaran 1 ½ cm tebal.",
                    "Potong doh menjadi 4 segi (boleh buat bentuk lain ikut kreativiti).",
                    "Biarkan anggaran 5 minit.",
                    "Panaskan minyak dan goreng sampai keperangan.",
                    "Angkat dan toskan"
                ],
                "Untuk Sambal Sardin": [
                    "Potong kasar bawang besar.",
                    "Hiris nipis bawang merah kecil dan bawang putih.",
                    "Tomato belah 4.",
                    "Kentang potong dadu. Jangan besar sangat, kecil-kecil baru senang makan.",
                    "Cili merah pot buang biji dan potong 2, cili padi buang tangkai.",
                    "Pes asam jawa bancuh dengan sedikit air. Ramas-ramas dan ketepikan.",
                    "Sardin Che Nom keluarkan siap-siap dari tin. Kalau guna sardine tin kecil boleh guna 2 tin kalau nak guna 1 tin boleh kurangkan 1/2 resepi ni.",
                    "Panaskan minyak dan tumis bawang merah dan putih.",
                    "Masukan cili kisar dan masak sampai cili kering dan pecah minyak.",
                    "Masukkan tomato dan masak sampai lembik. Che Nom masuk awai tomato sebab nak masak lembik dalam kuah dan pekatkan kuah.",
                    "Masukkan kuah sardine dan air.",
                    "Masuk kentang dan air asam jawa. Kacau sebati dan masak sampai kentang lembut.",
                    "Masukkan sos tiram dan isi ikan sardin.",
                    "Bila kuah dah mendidih boleh rasa, kalau kurang masin boleh tambah garam secukup rasa.",
                    "Masuk hirisan bawang besar.",
                    "Masukkan air untuk lebih berkuah.",
                    "Tabur hirisan cili merah dan cili padi.",
                    "Tutup api dan sedia untuk dihidang."
                ]
            },
            "tips_and_guides": [
                "Masa uli kalau rasa  doh masih keras, boleh tambah sedikit air. Dan kalau doh melekat dan lebik boleh tambah sedikit  tepung.",
                "Kerap tabur tepung masa potong dan bentukkan doh untuk elak doh melekat.",
                "Untuk goreng cucur minyak kena banyak dan api sederhana, api jangan kuat sangat takut luar dah perang tapi dalam belum masak.",
                "Kalau doh berlekuk (bekas kita pegang), boleh goreng bahagian berlekuk menghadap ke atas, nanti doh akan kembang elok dan lincin."
            ]
        }
    },
    {
        "title": "Cakoi Rangup Tanpa Yis Dan Sos Pandan",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/cakoi-dan-sos-pandan",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Cakoi_Tanya_Yis_6hwvgIE.jpg",
            "masa_penyediaan": "N/A",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Cakoi": [
                    "1 1/2 cwn / 195g tepung gandum",
                    "3 sk serbuk penaik",
                    "1 sk gula halus",
                    "1/4 sk garam",
                    "2 sb minyak masak",
                    "1/2 cwn / 120ml air"
                ],
                "Bahan Untuk Sos Kastard Pandan": [
                    "4-5 helai daun pandan",
                    "1 cwn /237ml air",
                    "2/3 cwn / 160ml susu cair",
                    "1 biji telur, saiz A atau B",
                    "1 sb tepung jagung",
                    "5-6 sb gula",
                    "Pewarna hijau, jika perlu",
                    "Secubit garam"
                ]
            },
            "instructions": {
                "Untuk Cakoi": [
                    "Timbang tepung gandum (Che Nom guna jenama Bakers’ choice).",
                    "Ayak tepung gandum, gula kastor, baking powder dan garam.",
                    "Masukkan minyak masak dan air (air suhu bilik) sedikit demi sedikit. Kacau sebati.",
                    "Uli sampai doh lembut dan tak melekat di tangan.",
                    "Kalau doh masih keras boleh tambah sedikit air dan kalau doh masih melekat boleh tabur sedikit tepung.",
                    "Bulatkan doh, tutup dan rehatkan anggaran 1 jam.",
                    "Selepas perap doh 1 jam, tumbuk-tumbuk doh untuk keluarkan udara dan sambung uli 5-10 minit.",
                    "Simpan doh dalam plastic bersih (kalau nak mudah boleh simpan dalam bekas bertutup) dan perap dalam peti sejuk semalaman.",
                    "Keluarkan doh (defrost) minimum 2 jam atau sampai doh betul-betul hilang sejuk.",
                    "Bentukkan dan uli doh memanjang.",
                    "Tekan dengan roller untuk dapatkan bentuk empat segi tepat dan ketebalan 1/4 inci.",
                    "Trim bahagian hujung doh, kiri dan kanan.",
                    "Potong doh cakoi lebar anggaran 1 ½ inci.",
                    "Tabur tepung pada setiap bucu doh setiap kali potong.",
                    "Sapu air ditengah cakoi kemudian tindan dengan 2 keping doh cakoi tadi.",
                    "Celup chopstick dalam air dan tekan tengah doh cakoi dengan chopstick tadi.",
                    "Kalau tak nak buat 2 keping cakoi, boleh je buat sekeping macam biasa.",
                    "Panaskan minyak, tarik doh dan goreng.",
                    "Kerap balik-balikkan cakoi sampai perang sekata.",
                    "Angkat dan toskan minyak."
                ],
                "Untuk Sos Pandan Kastard": [
                    "Gunting daun pandan.",
                    "Masukkan daun pandan dalam blender dengan sedikit air dan kisar halus.",
                    "Tapis dan perah jus pandan.",
                    "Bancuh tepung jagung dengan sedikit air. Kacau sebati dan ketepikan",
                    "Masukkan jus pandan, gula, telur, air bancuhan tepung jagung dan susu cair (atau santan) dalam kuali.",
                    "Kacau perlahan dan masak sampai pekat.",
                    "Masukkan garam dan sambung masak sampai pekat mendidih."
                ]
            },
            "tips_and_guides": [
                "Kalau kuali kecil, boleh potong separuh doh cakoi.",
                "Pastikan doh tak sejuk masa goreng kalau tak cakoi tak jadi dan tak kembang bila digoreng.",
                "Masa goreng, kerap balik-balikkan supaya cakoi kembang dan perang sekata.",
                "Kawal suhu minyak, jangan terlalu panas sangat takut luar terlebih perang tapi dalam masih belum masak. Seloknya guna thermometer kalau ada",
                "Masa mula-mula masak sos pandan pastikan kerap kacau dan adunan sebati untuk elak adunan berketul terutamanya telur.",
                "Pastikan bahagian bawah sos pandan tak berkerak dan hangit."
            ]
        }
    },
    {
        "title": "Roti Puri Sambal Sardin",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/roti-puri-sambal-sardin",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Roti_Puri_Sambal_Sardin.jpg",
            "masa_penyediaan": "50 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Sambal Sardin": [
                    "Minyak masak",
                    "1 biji kentang",
                    "1 tin besar sardin",
                    "3 biji bawang merah",
                    "3 ulas bawang putih",
                    "1 inci halia",
                    "3 sb cili kisar",
                    "1 sb rempah kari ikan",
                    "1 tangkai daun kari",
                    "1 biji tomato",
                    "Air untuk lebih berkuah",
                    "Garam secukup rasa",
                    "Gula secukup rasa",
                    "1 biji bawang besar",
                    "6-8 tangkai cili padi"
                ],
                "Bahan Untuk Roti Puri": [
                    "2 cwn /250g tepung gandum",
                    "1 sb gula",
                    "1/2 sk garam",
                    "1 sb minyak masak",
                    "1 sb menimbun majerin",
                    "Air secukupnya"
                ]
            },
            "instructions": {
                "Untuk Sambal Sardin": [
                    "Hiris nipis bawang merah kecil, bawang putih dan halia (kalau tak suka tergigit halia boleh masuk sekeping besar).",
                    "Potong kasar tomato dan bawang besar.",
                    "Kentang potong dadu untuk senang makan bila cicah dengan roti nanti.",
                    "Cili padi buang tangkai saja Che Nom tak potong sebab nak letak sebiji-sebiji kalau nak lebih pedas boleh potong.",
                    "Untuk sardin asingkan isi ikan sardin dan kuah.",
                    "Panaskan minyak dan goreng kentang sampai keperangan.",
                    "Bila kentang dah perang boleh angkat dan ketepikan.",
                    "Keluarkan sikit minyak (tinggal minyak anggaran 1 senduk).",
                    "Tumis bawang merah, bawang putih dan halia. Kacau sampai keperangan atau sampai naik bau.",
                    "Masukkan cili kisar atau cili boh dan kacau sampai garing sikit dan warna berubah jadi lebih gelap.",
                    "Masukkan serbuk kari ikan dan daun kari. Kacau sampai naik bau daun kari.",
                    "Masukkan tomato, kuah sardin dan air. Kacau sebati",
                    "Masukkan kentang goreng dan air asam jawa.",
                    "Tambah air sikit untuk lebih berkuah.",
                    "Masukkan ikan sardin, bawang besar, garam, gula dan cili padi.",
                    "Masak sampai cili padi layu dan tutup api."
                ],
                "Untuk Roti Puri": [
                    "Masukkan tepung gandum, gula, garam, minyak masak dan majerin (kalau tak nak majerin boleh tambah 2 sudu besar minyak masak) dalam mangkuk adunan.",
                    "Gaul kering kesemua bahan sampai berderai macam serbuk roti.",
                    "Masukkan air sedikit demi sedikit dan gaul sampai jadi doh yang lebut dan tak melekat pada tangan.",
                    "Sapu sikit majerin pada permukaan doh supaya doh tak kering dan tak melekat pada mangkuk. Tutup doh dengan kain dan rehatkan 10-15 minit.",
                    "Tabur sikit tepung atas papan canai dan uli sikit doh.",
                    "Bahagi doh kepada 12 bahagian dan bulatkan sama besar.",
                    "Leperkan menjadi bentuk bulat.",
                    "Panaskan minyak dan masukkan  doh yang telah dileperkan tadi. Siram minyak panas atas doh supaya cepat naik dan berongga ditengah.",
                    "Angkat dan toskan minyak.",
                    "Hidang  roti puri bersama kuah sardin."
                ]
            },
            "tips_and_guides": [
                "Waktu leperkan doh, doh yang selebihnya boleh tutup dulu dengan kain untuk elak doh mengering.",
                "Uli doh sederhana tebal. doh kalau uli terlalu tebal bila goreng roti susah nak naik berongga kalau uli nipis sangat takut mudah berlubang."
            ]
        }
    },
    {
        "title": "Roti Benggali Yang Lembut",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/roti-benggali-yang-lembut",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Roti_Putih.JPG",
            "masa_penyediaan": "45 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk (Bancuh Air)": [
                    "1/2 cawan / 125ml air suam",
                    "1 1/2 sudu kecil serbuk yis segera",
                    "1 sudu besar gula kastor"
                ],
                "Bahan Untuk Lain": [
                    "2 3/4 cawan / 350g tepung gandum atau tepung roti",
                    "1 sudu besar gula kastor",
                    "1/4 sudu kecil garam halus",
                    "1 sudu besar shortening (Che Nom ganti majerin sebab takde)",
                    "Air suam dalam 30ml , tambah sedikit demi sedikit smpai jadi doh jika perlu"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Bancuh yi,  tuang air suam kemudian masukkan serbuk yis segera.",
                    "Tambah gula, kacau larut dan tunggu sehinga 2 atau 3 minit.",
                    "Masukkan tepung gandum/tepung roti dalam mangkuk adunan.",
                    "Masukkan baki gula dan garam.",
                    "Kacau rata adunan agar garam bergaul rata dengan tepung.",
                    "Masukkan bancuhan yis tadi.",
                    "Tambah baki air sedikit demi sedikit hingga doh lembut.",
                    "Angkat dan uli rata atas permukaan yang rata.",
                    "Kalau melekat, teruskan uli dalam 5-10 minit.",
                    "Kalau perlu tambah tepung sikit, jangan banyak sangat nanti keras pulak.",
                    "Tambah magerin Planta dan uli sekata.",
                    "Buat bulat dan masukkan dalam mangkuk yang disapu magerin sikit.",
                    "Tutup dengan plastik clingwrap atau tuala dapur.",
                    "Biarkan doh naik dua kali ganda.",
                    "Bila doh dah naik, keluarkan dari bekas dan uli sikit lagi biar udara keluar.",
                    "Sapu loyang dengan majerin.",
                    "Bahagi dua doh, kalau tak nak bahagi, masukan doh dalam loyang yang besar.",
                    "Rehat doh sampai doh naik 2 kali ganda sebelum bakar.",
                    "Bakar suhu 200 degree Celsius selama 35 minit atau keperangan, setting api  ATAS BAWAH. .",
                    "Kemudian angkat keluar.",
                    "Sapu permukaan roti panas dengan majerin.",
                    "Keluarkan roti masa masih suam.",
                    "Potong dengan pisau berjeriji tajam."
                ]
            },
            "tips_and_guides": [
                "Kalau yis tu berbuih maknanya yis tu aktif, kalau tak ada buih maksudnya yis tu dah rosak.",
                "Kacau rata adunan agar garam bergaul rata dengan tepung, kita tak nak yis mati bila terkena direct contect dgn garam.",
                "Keluarkan roti masa masih suam, sebab takut bahagian bawah meruap dan jadi lembik."
            ]
        }
    },
    {
        "title": "Bun Coklat Lembut",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/bun-coklat-lembut",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/b9e5dd5841f2d804fe0750b157264f83944397c7.jpeg",
            "masa_penyediaan": "2 jam",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Doh": [
                    "300g tepung high protein atau tepung roti",
                    "30g serbuk koko",
                    "5g yis segera",
                    "65g gula kastor",
                    "5g garam halust",
                    "50ml susu full cream",
                    "150ml air",
                    "40g mentega"
                ],
                "Bahan Untuk Inti": [
                    "ketulan coklat"
                ],
                "Bahan Untuk Sapu (Egg Wash) Dan Hiasan": [
                    "1 biji telur",
                    "1 sudu besar air",
                    "secubit garam",
                    "coklat rice secukupnya"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Ayak tepung bersama serbuk koko.",
                    "Masukan bahan-bahan untuk doh di dalam breadmaker mengikut arahan breadmaker anda.",
                    "Press mode uli dan tunggu hingga doh sedia untuk dibentukkan.",
                    "Angkat doh tumbuk keluar ketulan angin.",
                    "buat bebola kecil dan timbang seberat seberat 40g setiap satu.",
                    "Masukkan inti ketulan coklan di tengah dan bulatkan. Susuh di atas dulang yang telah digris dengan minyak atau mentega. Susun dengan menjarakkan doh sedikit supaya ada ruang untuk don mengembang, anggaran 20-30 minit.",
                    "Sapukan telur/egg wash dan tabur coklat rice di atas.",
                    "Panaskan oven kepada suhu 160 celcius. Bakar roti selama 20-30 minit bergantung kepada oven anda."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Roti Sarang Lebah",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/roti-sarang-lebah",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/57e9174a69c2a88a4e9ea6e671ece3ae49d3513a.jpeg",
            "masa_penyediaan": "1 jam",
            "masa_memasak": "25 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Doh Roti": [
                    "2 cawan tepung gandum.",
                    "1/2 sudu kecil serbuk yis",
                    "1/4 sudu kecil garam halus",
                    "1/2 sudu kecil baking powder",
                    "1 sudu besar gula halus atau gula kastor",
                    "1/4 cawan plain yogurt",
                    "1/4 cawan minyak jagung",
                    "1/2 cawan air suam"
                ],
                "Bahan Untuk Taburan/Hiasan": [
                    "1 biji kuning telur dicampur 1 sudu kecil air, untuk disapu",
                    "sedikit sliced almond",
                    "bijan hitam",
                    "biji labu atau biji bunga matahari"
                ],
                "Bahan Untuk Sos Butterscotch": [
                    "25 gram butter",
                    "1/2 cawan gula perang atau brown sugar",
                    "1/2 cawan whipping cream",
                    "1/4 sudu kecil garam",
                    "1/2 sudu kecil esen vanila"
                ]
            },
            "instructions": {
                "Untuk Roti": [
                    "Campurkan tepung gandum, serbuk yis, baking powder, gula halus dan gaulkan sebati. Kemudian masukkan garam. Sebab kenapa garam dimasukkan kemudian adalah kerana yis tidak boleh bersentuhan dengan garam, boleh mengakibatkan yis rosak.",
                    "Tuang yoghurt, minyak dan air suam, kemudian kacau dan uli sehingga lembut dan sebati. Doh ini agak lembik, jangan cuba untk menambah tepung. Cukup sekadar sedikit taburan tepung supaya doh tidak melekat di tangan. Uli selama 5-10 minit.",
                    "Jika anda gunakan breadmaker, sila ikut arahan aturan bahan mengikut breadmaker anda.",
                    "Rehatkan doh sehingga kembang dua kali ganda. Keluarkan doh dan tumbuk2 keluar gelembung udara. Bahagikan doh kepada 12 atau 16 bahagian atau ikut kesukaan anda. Bulatkan doh dan susun di atas baking tray. Rehatkan doh sehingga naik dua kali ganda. Sapu bahagian atas dengan telur dan hiaskan dengan bahan taburan.",
                    "Panaskan oven kepada 160 darjah celcius, bakar selama lebih kurang 20-25 minit, atau sehingga masak. Angkat dan sejukkan. Tuang sos butterscotch di atas roti sebelum dihidang."
                ],
                "Untuk Sos Butterscotch": [
                    "Di atas api yang perlahan, panaskan mentega dan gula perang, kacau seketika. Masukkan pula whipping cream, garam dan esen vanilla. Kacau sehingga sos pekat sebati. Tidak perlu terlalu lama."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Shaped Dinner Rolls",
        "page_url": "https://resepichenom.com/kategori/roti?page=1",
        "recipe_url": "https://resepichenom.com/resepi/shaped-dinner-rolls",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/15894e9802cde242d3e6546cb3163d0346fe0bbe.jpeg",
            "masa_penyediaan": "N/A",
            "masa_memasak": "20 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "3 3/4 cup of unbleached bread flour",
                    "1 cup of warm milk",
                    "1/3 cup butter",
                    "1 1/2 teaspoon salt",
                    "1/3 cup castor sugar",
                    "7g dried yeast (1/2 pack of 11g Mauripan dried yeast)",
                    "1 egg",
                    "For the egg wash:",
                    "1 egg",
                    "1 tablespoon water",
                    "For sprinkle:",
                    "Sesame seeds",
                    "Poppy seed"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Sift flour and salt into one large bowl, then add castor sugar and yeast. Stir dry mixture until it blend together.",
                    "Add the butter into dry mixture and rub in until the mixture resemble fine breadcrumbs.",
                    "Make a well in the centre, pour warm milk and egg and mix to a dough. Knead on a floured surface for 5-10 minutes until smooth and elastic.",
                    "Place in a lightly oiled bowl. Cover with tea towel or clear plastic wrap. Leave rise for 1 hour or until double in size.",
                    "Turn the dough onto lightly floured surface, punch down the air and knead for 2-5 minutes. Divide dough into 16 equal pieces and shape into rolls.",
                    "To make a braids, divide each piece into three equal pieces. Rolls each piece to sausages keeping the length width even. Pinch three strips together at one end, then braid them neatly but not too toghtly. Pinch the end together under the braid.",
                    "Leave raise for 1/2 an hour or until the rolls double in size.",
                    "Mox the egg yolk and water together for the glaze. Brush on top of rolls and sprinkle with your choices of seeds sich as poppy seeds of sesame seeds.",
                    "Bake for 15-18 minutes or until golden. Lift the rolls on the wire rack to cool."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "French Toast",
        "page_url": "https://resepichenom.com/kategori/roti?page=2",
        "recipe_url": "https://resepichenom.com/resepi/french-toast",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/c3eccc197f92e3b637f5fcf1f34096a94abdead0.jpeg",
            "masa_penyediaan": "N/A",
            "masa_memasak": "N/A",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "5 keping roti Gardenia",
                    "2 biji telur",
                    "2 sudu besar susu full cream",
                    "1/2 biji bawang besar, hiris nipis",
                    "Butter secukupnya",
                    "1/4 sudu kecil garam"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Pecahkan telur di dalam mangkuk. Masukkan susu, garam dan bawang. Kacau sebati.",
                    "Panaskan kuali leper, lebih baik jika gunakan kuali non stick. Masukkan 1 sudu kecil butter.",
                    "Celup kedua belah bahagian roti di dalam adunan telur. Kautkan bawang dan letakkan dia atas bahagian yang hendak di goreng. Cepat-cepat telangkupkan ke atas kuali.  Apabila bahagian bawah masak, kautkan bawang ke bahagian atas dan cepat-cepat terbalikkan.",
                    "Masak sehingga garing keperangan.",
                    "Angkat dan hidang."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Wholemeal French Loaf",
        "page_url": "https://resepichenom.com/kategori/roti?page=2",
        "recipe_url": "https://resepichenom.com/resepi/wholemeal-french-loaf",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/19ccf463d15be976e8a3f611adabb85dc7007dc3.jpeg",
            "masa_penyediaan": "1 jam",
            "masa_memasak": "25 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "180ml air suam",
                    "250g tepung wholemeal",
                    "160g tepung roti",
                    "1/4 cup fresh cream @plain yoghurt",
                    "1 camca teh garam",
                    "1 camca besar gula halus",
                    "1 camca besar mentega",
                    "3 camca besar susu tepung",
                    "1 1/2 camca teh instant yis"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Campurkan air suam, fresh cream, gula halus dan instant yis. Kacau sebati.Biarkan seketika sehingga berbuih. (jika tidak berbuih, ulang langkah 1 sekali lagi)",
                    "Dalam mangkuk besar satukan tepung wholemeal, tepung roti, susu tepung dan garam.Kacau sebati.",
                    "Tuangkan bahan no.1 ke dalam adunan tepung sedikit demi sedikit. Uli sehingga lembut bersama mentega selama 15-20 minit.",
                    "Rehatkan sehingga adunan naik dua kali ganda.",
                    "Keluarkan dan tumbuk doh untuk mengeluarkan udara.Uli selama 10-15 minit lagi.",
                    "Buatkan bentuk french loaf (adunan ini sesuai untuk menghasilkan 3 roti fresh loaf).Biarkansehingga doh naikdan bakar dalam oven selama 20-25minit, 180 C.",
                    "Keluarkan dan sejukkan."
                ]
            },
            "tips_and_guides": []
        }
    }
]