[
    {
        "title": "Sambal Hijau Bilis Petai",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-hijau-bilis-petai",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sambal_Hijau_Bilis_Petai.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "1 jam",
            "hidangan": "6 gelas",
            "ingredients": {
                "Bahan Utama": [
                    "1 cwn minyak masak",
                    "1-2 biji bawang holland",
                    "10 ulas bawang putih",
                    "3 biji tomato hijau",
                    "450g cili padi hijau",
                    "150g cili besar hijau",
                    "100g ikan bilis",
                    "3-4 sk serbuk perasa",
                    "Garam secukup rasa",
                    "4 helai daun limau purut",
                    "10-12 papan petai"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Potong kasar bawang holland, bawang putih, cili hijau dan cili padi hijau.",
                    "Belah tomato 2- 4 bahagian.",
                    "Ikan bilis basuh dan toskan.",
                    "Petai belah 2 dan kupas kulit. Bilas dengan air dan tos kering.",
                    "Panaskan minyak masak. Goreng bawang holland, bawang putih dan tomato sampai layu. Angkat dan tos minyak",
                    "Goreng cili padi dan cili hijau anggaran 3-4 minit. Angkat dan toskan minyak.",
                    "Akhir sekali goreng ikan bilis sampai garing, kemudian angkat dan toskan minyak.",
                    "Kisar kasar cili padi, cili hijau, tomato, bawang holand dan bawang putih.",
                    "Panaskan balik minyak goreng tadi dan tumis semua bahan kisar dengan api perlahan.",
                    "Masukkan serbuk seasoning dan garam.",
                    "Bila sambal dah pecah minyak, masukkan daun limau purut dan petai. Masak sampai petai layu.",
                    "Tuang masuk ikan bilis goreng. Kacau sebati kemudian boleh tutup api."
                ]
            },
            "tips_and_guides": [
                "Petai kalau ulas besar-besar kena tengok lebih sikit takut ada ulat.",
                "Masa angkat cili, pastikan cili hijau lagi. Kita nak maintain warna hijau dalam sambal.",
                "Masa tumis sambal, boleh tambah minyak kalau kurang.",
                "Masuk sambal dalam balang kaca dan simpan dalam peti sejuk untuk tahan lebih lama."
            ]
        }
    },
    {
        "title": "Sambal Terung Balado",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-terung-balado",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sambal_Terung_Balado.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "20 minit",
            "jumlah_masa": "50 minit",
            "hidangan": "4 orang",
            "ingredients": {
                "Bahan Utama": [
                    "3 biji terung panjang",
                    "1/2-1 cwn  minyak masak",
                    "4 biji bawang merah kecil",
                    "5 ulas bawang putih",
                    "3 tangkai cili merah besar",
                    "10 tangkai cili padi merah",
                    "1 biji  tomato",
                    "1/2 inci belacan",
                    "1-2 sk garam",
                    "1 sk gula",
                    "Sedikit serbuk seasoning",
                    "3 helai daun limau purut",
                    "1 cwn ikan bilis"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Potong kasar bawang merah kecil (kalau nak ganti dengan bawang besar pon boleh agak-agak 1 biji sederhana).",
                    "Potong kasar bawang putih dan cili merah besar (besar betul cili nih jadi Che Nom guna 3 biji aja. Kalau saiz biasa 4-5 biji).",
                    "Cili padi merah,  kena guna semua yang warna merah lah kalau nak warna sambal balado tu merah cantik. Buang tangkai dan patahkan 2 . Siapa suka pedas lebih kan.",
                    "Tomato potong kasar",
                    "Terung ungu, buang tangkai kemudian potong memanjang 1.5 inci dan belah 4.",
                    "Ikan bilis basuh dan toskan air biar kering. Kalau goreng basah-basah nanti takut lambat nak garing.",
                    "Panaskan minyak dalam kuali, bukak api besar ye sebab kita nak minyak betul-betul panas.",
                    "Bila minyak dah panas, boleh goreng terung separuh masak. Jangan letak banyak sangat nanti minyak jadi kurang panas, lambat perang, dan minyak menyerap dalam terung",
                    "Bila terung dah garing boleh angkat dan toskan minyak.",
                    "Goreng pulak ikan bilis. Bilis pon sama, minyak kena betul-betul panas masa mula-mula goreng barulah ikan bilas garing. Bila minyak dah diam tak bising letup-letup dah, boleh angkat.",
                    "Bekas minyak goreng tadi kita goreng pulak bawang merah, bawang putih dan semua cili.",
                    "Bila semua dah layu masukkan tomato dan belacan seciput..ala-ala  macam nak makan tapi malu.",
                    "Bila dah naik bau bolehla angkat.",
                    "Masukkan bahan yang kita goreng tadi dalam pengisar dan kisar kasar, kalau ada batu gesek boleh guna.",
                    "Masukkan balik bahan kisar dalam minyak bekas goreng tadi dan masak sampai sambal ni kering sikit.",
                    "Bila dah kering air dan pecah minyak, boleh perasakan dengan garam, gula dan serbuk seasoning.",
                    "Koyak masuk daun limau purut, lebih wangi kalau kita letak waktu last ni.",
                    "Sekarang boleh masukkan semua terung goreng.",
                    "Gaul terung biar lembut dan sebati dengan sambal.",
                    "Boleh tutup api dan angkat.",
                    "Last sekali tabur ikan bilis goreng atas sambal. Biasanya tumbuk dan masuk sekali dalam sambal, tapi untuk terung balado, Che Nom suka tabur bilis."
                ]
            },
            "tips_and_guides": [
                "Satu petua untuk elak cili meletup waktu goreng, caranya patahkan je cili.",
                "Terung ni sifat dia bila goreng, mula-mula akan serap minyak, bila dah lembik baru minyak tu akan keluar semula, tapi kita taknak lembik masa mula goreng, ha tu yang goreng cepat, api besar, cepat perang, barulah tak serap banyak sangat minyak."
            ]
        }
    },
    {
        "title": "Sambal Nasi Lemak Berkuah",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-ikan-bilis-berkuah",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sambal_Nasi_Lemak_Web.jpg",
            "masa_penyediaan": "25 minit",
            "masa_memasak": "35 minit",
            "jumlah_masa": "1 jam",
            "hidangan": "6 orang",
            "ingredients": {
                "Bahan Kisar Halus": [
                    "1 biji bawang besar",
                    "4-5 biji bawang merah kecil",
                    "4-5 ulas bawang putih",
                    "1 inci halia",
                    "15-20 tangkai cili kering",
                    "1 inci belacan",
                    "1 cawan ikan bilis"
                ],
                "Bahan Lain": [
                    "1 cawan minyak masak",
                    "1 biji kentang",
                    "1 mangkuk besar ikan bilis",
                    "1 biji bawang besar (tumis)",
                    "2 helai daun pandan",
                    "Air, untuk berkuah",
                    "2-3 sb gula melaka",
                    "Sedikit air asam jawa",
                    "1 kiub pati ayam/ikan bilis",
                    "Garam secukup rasa",
                    "1 biji bawang besar (taburan akhir)"
                ]
            },
            "instructions": {
                "Untuk Sambal": [
                    "Hiris nipis bawang besar untuk tumisan.",
                    "Potong kasar bawang besar, bawang merah kecil, bawang putih dan halia.",
                    "Rendam asam jawa dalam air panas, bila dah lembut, ramas dan ambil jus.",
                    "Kentang potong dadu.",
                    "Cili kering, gunting dan rebus sampai mendidih dan lembut.",
                    "Masuk dalam blender bahan potong kasar, belacan (boleh ganti sos tiram), cili kering, ikan bilis dan air. Kisar halus.",
                    "Panaskan minyak dan goreng kentang. Angkat dan ketepikan.",
                    "Goreng ikan bilis separuh masak, angkat dan ketepikan.",
                    "Tumis bawang besar dan daun pandan sampai bawang layu.",
                    "Masukkan bahan kisar halus dan air kemudian tumis sampai sambal pecah minyak.",
                    "Masukkan gula melaka (boleh ganti gula putih), air asam jawa, air, ikan bilis goreng dan kiub ayam / ikan bilis (pilihan).",
                    "Boleh rasa kalau kurang masin, adjust dengan garam.",
                    "Bila sambal dah masak, hiris bawang besar dan tabur masuk dalam sambal.",
                    "Hidang bersama nasi lemak, kacang goreng, ikan bilis, timun dan telur."
                ]
            },
            "tips_and_guides": [
                "Goreng ikan bilis separuh masak sahaja, kalau garing  nanti bila masak dalam sambal, ikan akan jadi liat.",
                "Ikan bilis kalau dan masak dia akan bunyi senyap. Jadi angkat waktu minyak masih bunyi bising lagi.",
                "Masa tumis sambal, boleh tutup sekejap kuali tapi jangan rapat sangat takut wap tak keluar.",
                "Minyak yang bertakung atas sambal boleh kaut keluar. Boleh simpan untuk masakkan lain."
            ]
        }
    },
    {
        "title": "Sambal Garing Bilis Tempe",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-garing-bilis-tempe",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/sambal_bilis_tempe.jpg",
            "masa_penyediaan": "25 minit",
            "masa_memasak": "35 minit",
            "jumlah_masa": "1 jam",
            "hidangan": "12 orang",
            "ingredients": {
                "Bahan A": [
                    "300g ikan bilis (**boleh kurangkan ikan bilis kepada 200g untuk salutan lebih pedas)",
                    "1 keping tempe",
                    "6 biji bawang merah kecil",
                    "1 sudu kecil garam",
                    "1-2 sudu besar tepung beras",
                    "2 mangkuk minyak masak"
                ],
                "Bahan B": [
                    "1 senduk minyak masak",
                    "25-30 tangkai cili kering",
                    "2 sudu besar gula",
                    "1 kiub pati ikan bilis",
                    "ATAU boleh ganti perasa",
                    "Sedikit garam (jika suka)"
                ]
            },
            "instructions": {
                "Untuk Bawang Goreng": [
                    "Gaulkan sedikit garam dengan hirisan nipis bawang merah kecil.",
                    "Perap dalam anggaran lebih kurang ½ jam.",
                    "Selepas perap, perah dan toskan jus bawang.",
                    "Gaul bawang merah kecil dengan tepung beras sehingga bersalut sekata.",
                    "Goreng hirisan bawang dengan api yang sederhana dan kerapkan kacau sehingga keperangan."
                ],
                "Untuk Sambal Garing Bilis Tempe": [
                    "Panaskan minyak dan goreng hirisan tempe dengan api yang sederhana. Kerapkan kacau tempe sehingga garing.",
                    "Goreng pula ikan bilis sehingga keperangan.",
                    "Masukkan sedikit cuka atau jus limau nipis kedalam ikan bilis yang sedang digoreng sebelum diangkat dan ditos minyak.",
                    "Goreng cili kering sehingga keras dan kelihatan rangup.",
                    "Kisar halus cili kering goreng dengan gula dan kiub pati ikan bilis atau serbuk perasa.",
                    "Panaskan minyak, goreng bahan kisar dan masukkan gula. Goreng sekejap lalu tutup api.",
                    "Masukkan ikan bilis, tempe dan bawang goreng. Gaul kesemuanya sehingga sekata.",
                    "Tambah sedikit garam jika perlu.",
                    "Kemudian, sambal garing bilis tempe siap untuk dihidang bersama nasi putih panas, roti serta bubur ataupun siap untuk disimpan dalam balang kedap udara."
                ]
            },
            "tips_and_guides": [
                "Untuk dapatkan ikan bilis goreng yang garing, basuh ikan bilis dan toskan air sehingga ikan bilis betul-betul kering sebelum digoreng ataupun jemurkan ikan bilis dibawah terik matahari.",
                "Selain itu, petua untuk ikan bilis tahan lama garingnya adalah dengan tambah sedikit cuka atau jus limau nipis ketika 3-4 minit sebelum angkat ikan bilis yang sedang digoreng.",
                "Untuk memastikan ikan bilis sudah garing dan sedia untuk diangkat adalah apabila buih minyak dan bunyi gorengan makin berkurang.",
                "Untuk dapatkan tempe goreng yang garing pula, hiris senipiskan tempe dan potong kecil sebelum digoreng."
            ]
        }
    },
    {
        "title": "Sambal Bilis Rangup",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-bilis-rangup",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sambal_Bilis_Garing_2.jpg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "20 minit",
            "jumlah_masa": "40 minit",
            "hidangan": "10 orang",
            "ingredients": {
                "Bahan Untuk Sambal Bilis Rangup/Garing": [
                    "4-5 biji bawang merah kecil",
                    "20-25 tangkai cili kering",
                    "500g ikan bilis",
                    "1-2 sudu besar gula",
                    "½-1 sudu kecil serbuk lada sulah",
                    "Sedikit garam"
                ]
            },
            "instructions": {
                "Untuk Sambal Bilis Rangup": [
                    "Gaul hirisan bawang merah dengan sedikit garam dan goreng sehingga perang dan garing.",
                    "Goreng cili kering sehingga kelihatan keras dan gelap.",
                    "Goreng ikan bilis sehingga keperangan dan garing.",
                    "Kisar kasar cili kering, sedikit ikan bilis yang telah digoreng, gula, serbuk lada sulah, sedikit garam dan serbuk perasa (pilihan).",
                    "Tambah sedikit gula",
                    "Campur serta gaul sekata bahan kisar kasar dan bawang goreng dengan ikan bilis goreng.",
                    "Kemudian, ikan bilis rangup siap untuk dihidang."
                ]
            },
            "tips_and_guides": [
                "Sebelum mula menggoreng cili kering, tutup api bagi menggelakkan minyak meletup dan lebih terkawal semasa memasukkan cili kering. Kemudian, buka api semula jika sudah memasukkan semua cili kering dan kurang bunyi letupan minyak.",
                "Pastikan minyak gorengan bagi ikan bilis sebelum dimasukkan betul-betul panas dan perlahankan api selepas ikan bilis sudah dimasukkan supaya ikan bilis menjadi lebih garing,"
            ]
        }
    },
    {
        "title": "Sambal Ikan Bilis, Kacang dan Kentang Pedas Rangup",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-ikan-bilis-kacang-dan-kentang-pedas-rangup",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sambal_Rangup_IG.JPG",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "15 minit",
            "jumlah_masa": "30 minit",
            "hidangan": "5 orang",
            "ingredients": {
                "Bahan Untuk Kisar Kasar": [
                    "3-4 biji bawang merah kecil",
                    "4 ulas bawang putih",
                    "12 tangkai cili kering"
                ],
                "Bahan Untuk Lain-Lain": [
                    "2 cawan minyak masak",
                    "2 biji kentang",
                    "100g ikan bilis",
                    "200g kacang tanah",
                    "3-4 keping hirisan lengkuas",
                    "2 sudu besar gula putih",
                    "3 sudu besar gula nisan/gula melaka",
                    "1/3 cawan air asam jawa",
                    "1 sudu besar cuka makan",
                    "1/4 sudu kecil kiub ayam",
                    "1/4 sudu kecil garam"
                ]
            },
            "instructions": {
                "Untuk Untuk Goreng": [
                    "Kupas dan hiris nipis kentang. Gaul dengan sedikit garam. Biarkan seketika sampai kentang keluarkan air dan toskan.",
                    "Bersihkan ikan bilis dan toskan.",
                    "Panaskan minyak, goreng kentang sehingga garing. Perlu kerap kacau sehingga kentang perang dan rangup. Angkat dan ketepikan.",
                    "Goreng ikan bilis sehingga rangup.",
                    "Keluarkan sedikit minyak dan goreng kacang tanah sehingga sedikit keperangan. Angakat dan ketepikan."
                ],
                "Untuk Sambal": [
                    "Buang biji cili kering dan rebus. Kisar semua bahan-bahan untuk kisar kasar",
                    "Menggunakan baki minyak tadi, tumis bahan kisar kasar sehingga masak dan pecah minyak. Masukkan juga hirisan lengkuas.",
                    "Bila sambal sudah pekat, masukkan gula putih, gula nisan atau gula melaka, air asam jawa, cuka makan dan kiub ayam.",
                    "Masak sehingga sambal bertukar warna menjadi sedikit gelap dan pekat. Tabur garam secukup rasa.",
                    "Tutup api dan gaulkan kacang tanah dan ikan bilis. Kerap kacau sehingga sambal betul-betul sebati dan sejuk. Last sekali masukkan kentang goreng. Gaul lagi dengan kerap sehingga semua bahan bersalut sekata."
                ]
            },
            "tips_and_guides": [
                "Bahan-bahan yang digoreng haruslah dikacau dengan kerap supaya masak sekata dan garing.",
                "Sambal haruslah pekat dan kering. Kalau basah, nanti bahan-bahan goreng akan jadi lembik bila disimpan.",
                "Kalau nak tunggu sambal sedikit suam sebelum kacau dengan bahan-bahan goreng pun boleh."
            ]
        }
    },
    {
        "title": "Sambal TERBAIK Untuk Nasi Lemak",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-terbaik-untuk-nasi-lemak",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Nasi_Lemak_Everest-3.jpg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "35 minit",
            "jumlah_masa": "55 minit",
            "hidangan": "12 orang",
            "ingredients": {
                "Bahan Untuk Nasi": [
                    "2 inci halia",
                    "3 biji bawang merah",
                    "1 batang serai",
                    "3 helai daun pandan",
                    "sedikit minyak",
                    "kayu manis",
                    "bunga lawang",
                    "4 cawan beras",
                    "6 cawan air",
                    "1/2 sudu kecil halba, optional",
                    "sedikit garam"
                ],
                "Bahan Untuk Sambal Tumis": [
                    "7-8 biji bawang merah, kisar halus",
                    "5 ulas bawang putih, kisar halus",
                    "2 inci halia, kisar halus",
                    "1 genggam ikan bilis, kisar halus",
                    "2 biji bawang besar, kisar halus",
                    "sedikit minyak",
                    "1/2 biji bawang besar",
                    "3 helai daun pandan",
                    "3-4 senduk cili kisar",
                    "sedikit air",
                    "2 sudu besar sos tiram",
                    "1 kiub ikan bilis",
                    "gula melaka secukupnya",
                    "garam secukup rasa",
                    "1 biji bawang holland",
                    "1 mangkuk bilis goreng"
                ],
                "Bahan Tambahan": [
                    "kacang tanah",
                    "ikan bilis",
                    "telur rebus"
                ]
            },
            "instructions": {
                "Untuk Nasi Lemak": [
                    "Hiris nipis bawang merah dan halia.",
                    "Titik atau ketuk batang serai.",
                    "Carikkan daun pandan dan simpul.",
                    "Panaskan  sedikit minyak.",
                    "Tumiskan bawang merah dan kacau sekejap.",
                    "Masukkan halia, daun serai dan daun pandan kemudian kacau sehingga naik bau.",
                    "Masukkan bahan rempah tumis (kulit kayu manis dan bunga lawang).",
                    "Masukkan beras yang telah dibasuh dan toskan.",
                    "Masukkan santan dengan nisbah 1:1 1/2 cawan beras dan cawan santan (kalau guna santan kotak boleh campur dengan air untuk cukupkan nisbah santan dan beras)",
                    "Masukkan halba (optional).",
                    "Masukkan garam secukup rasa dan kacau sebati.",
                    "Tutup rice cooker dan masak nasi."
                ],
                "Untuk Sambal": [
                    "Hiris kasar bawang merah, bawang putih, halia dan bawang besar.",
                    "Masukkan kedalam blander bahan hiris kasar tadi, ikan bilis dan air.",
                    "Kisar sehingga betul-betul halus.",
                    "Panaskan minyak dan goreng kacang tanah di atas api perlahan sehingga masak kemudian angkat.",
                    "Goreng pula ikan bilis kemudian angkat.",
                    "Tumis bawang besar sehingga lembut.",
                    "Masukkan pula bahan kisar halus.",
                    "Teruskan kacau sehingga kering dan kekuningan.",
                    "Masukkan daun pandan yang telah dicarik dan disimpul.",
                    "Masukkan cili kisar.",
                    "Kacau ssehingga sambal tumis bertukar warna merah gelap dan pecah minyak.",
                    "Bila sambal dah kering, tambah sedikit air dan masak lagi sehingga kering.",
                    "Ulang proses minimum sebanyak tiga kali.",
                    "Masukkan sos tiram, kiub ikan bilis, air asam jawa, gula melaka sedikit demi sedikit.",
                    "Masukkan sedikit air supaya gula senang cair.",
                    "Masukkan ikan bilis goreng dan hirisan bawang holland dan kacau sekejap sampai bawang layu.",
                    "Masukkan garam secukup rasa.",
                    "Hiris timun sebagai pelengkap hidangan.",
                    "Hidangkan nasi lemak bersama kacang tanah, ikan bilis goreng, hirisan timun dan telur rebus."
                ]
            },
            "tips_and_guides": [
                "Untuk tahu cili kisar dah cukup, Che Nom akan celup jari dan rasa sikit, kalau rasa betul-betul pedas, cili kisar dah cukup, kalau belum, tambah lagi sesenduk atau dua.",
                "Untuk sambal yang sedap, minyak kenalah banyak sebab kita nak cili betul-betul masak."
            ]
        }
    },
    {
        "title": "Sambal Tempe dan Ikan Bilis Rangup",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-tempe-dan-ikan-bilis-rangup",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sambal_ikan_bilis_tempe_final.jpg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "15 minit",
            "jumlah_masa": "25 minit",
            "hidangan": "5 orang",
            "ingredients": {
                "Bahan Utama": [
                    "2 pek tempe",
                    "1 mangkuk ikan bilis",
                    "1 ulas bawang putih",
                    "3 biji bawang merah",
                    "3 sudu besar cili kisar atau cili boh",
                    "2 sudu besar sos cili",
                    "1/2 sudu besar sos tiram",
                    "gula secukup rasa"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Panaskan minyak secukupnya. Hiris tempe nipis-nipis dan goreng atas api perlahan sehingga garing. Setelah keperangan dan garing. Angkat dan ketepikan.",
                    "Dalam minyak yang sama, goreng ikan bilis sehingga garing. Angkat dan ketepikan.",
                    "Buang sedikit minyak. Tinggalkan dalam anggaran 1 senduk.",
                    "Cincang halus bawang putih dan bawang merah. Nak kisar pun boleh. Tumis sehingga kekuningan dan naik bau.",
                    "Masukkan cili kisar dan masak sehingga cili garing.",
                    "Masukkan sos cili, sos tiram dan gula. Masak sehingga sambal mendidih dan nampak pekat berkilat. Tutup api.",
                    "Gaulkan dengan tempe dan ikan bilis goreng tadi."
                ]
            },
            "tips_and_guides": [
                "Kalau nak tempe garing, perlu hiris nipis-nipis.",
                "Perlu selalu kacau tempe semasa goreng, api jangan besar sangat nanti tempe tak garing.",
                "Pemilihan ikan bilis juga penting kalau nak lebih rangup. Che Nom suka gunakan ikan bilis putih, ataupun ikan bilis yang halus.",
                "Sambal perlu masak pekat supaya kerangupan dapat bertahan lama.",
                "Lebihkan gula sedikit supaya manis. Gula akan memekatkan sambal dan akan melekat dengan baik bila digaul nanti.",
                "Minyak jangan terlalu sedikit kerana nanti tekstur sambal tak cantik dan sambal tak masak sempurna.",
                "Simpan dalam bekas kedap udara kalau nak rangupnya tahan lama. Boleh juga disimpan dalam peti ais."
            ]
        }
    },
    {
        "title": "Sambal Tumis Ikan Bilis Petai",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-tumis-ikan-bilis-petai",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/917B9F3E-4E5C-4CB2-9474-344D1573A6C2.jpeg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "45 minit",
            "hidangan": "6 orang",
            "ingredients": {
                "Bahan Utama": [
                    "1 mangkuk isi petai",
                    "2 gengam ikan bilis",
                    "1 biji bawang besar, hiris kasar",
                    "1 sudu besar sos tiram",
                    "sedikit pati air asam jawa, ATAU 1 keping asam gelugor",
                    "1 mangkuk besar minyak, untuk menumis",
                    "1 biji bawang besar, hiris membulat untuk taburan di akhir masakan"
                ],
                "Bahan Untuk Kisar Halus": [
                    "6 biji bawang merah",
                    "5 ulas bawang putih",
                    "1 biji bawang besar",
                    "15-20 biji cili kering, buang biji dan rebus",
                    "1 inci halia",
                    "secubit belacan"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Goreng ikan bilis hingga separuh masak. Angkat dan ketepikan.",
                    "Dalam minyak yang sama, tumis bawang besar (yang dihiris kasar) sehingga layu. Jangan tumis bawang terlalu lama kerana kita cuma mahukan bawang itu layu dan ia akan menambahkan rasa manis di dalam sambal bila dimasak nanti.",
                    "Masukkan bahan kisar halus dan kacau perlahan sehinga sambal pecah minyak dan warna sambal bertukar menjadi merah gelap. Tambah sedikit air jika kering.",
                    "Masukkan pula air asam jawa dan sos tiram.",
                    "Masukkan ikan bilis goreng, isi petai dan gula secukup rasa.",
                    "Sebelum angkat, taburkan dan kacau sekejap hirisan bawang besar yang dihiris membulat jika anda suka."
                ]
            },
            "tips_and_guides": [
                "Untuk mendapatkan sambal tumis yang sedap, bahan kisar halus hendaklah dimasak di dalam minyak yang agak banyak sehingga sambal pecah minyak. Dengan cara ini, sambal akan masak dengan sempurna, wangi serta tahan lama. Anda boleh buang lebihan minyak selepas sambal sudah masak nanti.",
                "Che Nom tidak masukkan garam dalam sambal kerana ikan bilis dan sos tiram sudah masin rasanya. Boleh rasa dahulu kuah sambal sebelum masukkan garam mengikut citarasa anda."
            ]
        }
    },
    {
        "title": "Sambal Tempoyak Ikan Bilis Goreng",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-tempoyak-ikan-bilis-goreng",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/a6cdfb8fc08b01d4a78f283a4e79a941bbea8455.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "20 minit",
            "hidangan": "3 orang",
            "ingredients": {
                "Bahan UtamaTempoyak ikan bilis": [
                    "Ikan bilis lebih kurang segenggam penuh atau ikut anggaran sendiri",
                    "Tempoyak 3-4 sudu besar",
                    "Bawang besar satu biji – dihiris",
                    "Garam secukupnya",
                    "Minyak masak"
                ],
                "Bahan Untuk Dikisar/Ditumbuk": [
                    "Bawang putih 2 ulas",
                    "Cili padi 15-25 biji (ikut tahap kepedasan yang diinginkan)",
                    "Cili merah 1-2 biji"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Gorengkan ikan bilis sehingga garing kemudian letakkan ke tepi.",
                    "Tumiskan bawang besar dan bahan yang telah dikisar. Kemudian masukkan garam dan kacau.",
                    "Masukkan tempoyak kemudian gaul sehingga rata.",
                    "Akhir sekali masukkan ikan bilis dan gaul sehingga sebati."
                ]
            },
            "tips_and_guides": [
                "Resepi ini lebih sedap jika di makan bersama nasi panas dan juga lebih sedap jika bahan-bahannya ditumbuk berbanding dikisar."
            ]
        }
    },
    {
        "title": "Sambal Kering Kentang dan Ikan Bilis",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-kering-kentang-dan-ikan-bilis",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/b49a8c0f345594ecb3f2660f904c30722ef75fa0.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "20 minit",
            "jumlah_masa": "30 minit",
            "hidangan": "5 orang",
            "ingredients": {
                "Bahan Utama": [
                    "1 sudu kecil sos tiram",
                    "3 biji kentang",
                    "1 mangkuk ikan bilis",
                    "3 ulas bawang merah, hiris nipis",
                    "2 ulas bawang putih, hiris nipis",
                    "3 sudu besar cili kisar",
                    "3 sudu besar sos cili",
                    "gula secukup rasa",
                    "sedikit garam (untuk digaul bersama kentang)"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Kupas kulit kentang dan hiris nipis. Pastikan anda potong senipis yang boleh. Gaulkan kentang dengan garam dan goreng kentang di dalam minyak panas. Masukan sekeping demi sekeping supaya tidak melekat. Goreng sehingga garing, angkat dan toskan.",
                    "Dalam minyak yang sama, goreng pula ikan bilis sehingga garing.",
                    "Panaskan 1/2 senduk minyak masak yang baru (bukan minyak hasil gorengan ikan bilis) dan goreng bawang merah dan putih sehingga wangi.",
                    "Masukkan cili kisar dan masak sehingga pecah minyak.",
                    "Masukkan pula sos cili, gula dan sos tiram, masak seketika. Apabila sudah pecah minyak dan sedikit kering, masukkan ikan bilis dan kentang goreng. Kacau seketika supaya sebati. Angkat dan sejukkan."
                ]
            },
            "tips_and_guides": [
                "Sambal harus dilebihkan gula supaya apabila sejuk nanti,  sambal kering akan lebih rangup. Tapi jangan terlalu manis nanti tak sedap pula."
            ]
        }
    },
    {
        "title": "Sambal Terung Ikan Bilis",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-terung-ikan-bilis",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/bc119ce1bb315da7b4a2104914df05265b6bf574.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "20 minit",
            "hidangan": "5 orang",
            "ingredients": {
                "Bahan Utama": [
                    "2 biji terung panjang bersaiz sederhana, hiris pada ketebalan 1.5 cm",
                    "1 senduk cili kisar",
                    "1 sudu kecil belacan (optional)",
                    "1 biji bawang besar, hiris nipis",
                    "2 ulas bawang putih",
                    "2 sudu besar sos cili",
                    "1 mangkuk ikan bilis goreng"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Panaskan minyak, dan tumis bawang besar dan bawang putih hingga kekuningan, kemudian masukkan cili kisar, sos cili dan belacan. Masak sambal hingga pecah minyak. Jika kering, tambahkan sedikit air.",
                    "Masukkan terung dan kacau seketika sehingga masak, kemudian masukkan ikan bilis.",
                    "Perasakan dengan gula dan garam secukupnya. Kacau sebati, angkat dan hidang. Hiaskan bersama daun bawang."
                ]
            },
            "tips_and_guides": [
                "Hati-hati menambah garam kerana ikan bilis sudah mempunyai rasa masin."
            ]
        }
    },
    {
        "title": "Sambal Tumis Ikan Bilis dan Terung Pipit",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=2",
        "recipe_url": "https://resepichenom.com/resepi/sambal-tumis-ikan-bilis-dan-terung-pipit",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/b7b84b49d0d923848b944e745568d871b061c29d.jpeg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "45 minit",
            "hidangan": "6 orang",
            "ingredients": {
                "Bahan Utama": [
                    "200g  ikan bilis",
                    "2 cawan terung pipit, dibuang tangkai dan bersihkan",
                    "1/2 biji bawang besar, hiris nipis",
                    "2 sudu besar  sos tiram",
                    "3 sudu besar air asam jawa",
                    "2-3 senduk besar minyak",
                    "garam dan gula secukup rasa"
                ],
                "Bahan Untuk Kisar Halus": [
                    "10-15 biji cili kering, dibuang biji dan rebus",
                    "4 ulas bawang merah",
                    "3 ulas bawang putih",
                    "1 inci halia",
                    "1 biji bawang besar, potong 4"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Goreng ikan bilis separuh masak. Asingkan.",
                    "Panaskan minyak, tumis bawang besar sehingga kekuningan.",
                    "Masukkan bahan kisar dan masak sambal di atas api perlahan sehingga pecah minyak. Masukkan ikan bilis, sos tiram, air asam jawa, garam dan gula secukup rasa.",
                    "Kemudian masukkan terung pipit dan masak sehingga terung lembut. Angkat dan hidang."
                ]
            },
            "tips_and_guides": [
                "Pastikan sambal dimasak dalam minyak yang banyak, dan anda boleh buang lebihan minyak sebelum menghidang."
            ]
        }
    },
    {
        "title": "Sambal Ikan Bilis Dan Tempe Goreng",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=2",
        "recipe_url": "https://resepichenom.com/resepi/sambal-ikan-bilis-dan-tempe-goreng",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/d60aadc930629974f5e928f4e5ccdcf89cb26756.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "20 minit",
            "hidangan": "5 orang",
            "ingredients": {
                "Bahan Utama": [
                    "1 keping besar tempe (dipotong nipis)",
                    "250 gram ikan bilis halus",
                    "4 sudu besar cili kisar",
                    "2 sudu besar sos cili",
                    "gula dan garam secukup rasa",
                    "Bahan untuk di cincang halus",
                    "2 ulas bawang putih*",
                    "2 ulas bawang merah*"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Cincang halus bahan *",
                    "Dalam kuali berasingan, goreng tempe dan ikan bilis sehingga garing. Asingkan.",
                    "Panaskan 4 sudu besar minyak masak.",
                    "Tumis bawang sehingga kekuningan dan naik bau.",
                    "Masukkan cili kisar ,sos cili dan gula. Tumis sehingga pecah minyak.",
                    "Masukkan ikan bilis dan tempe, kacau rata. Tambah garam ikut rasa.",
                    "Tips: Ikan bilis sudah mempunyai rasa masin  Berhati-hati bila menambah garam."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Sambal Ikan Bilis Petai",
        "page_url": "https://resepichenom.com/kategori/ikan-bilis?page=2",
        "recipe_url": "https://resepichenom.com/resepi/sambal-ikan-bilis-petai",
        "details": {
            "image_url": "https://resepichenom.com/uploads/profile/99d7f34158722068.jpg",
            "masa_penyediaan": "25 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "55 minit",
            "hidangan": "6 orang",
            "ingredients": {
                "Bahan Utama": [
                    "Bahan untuk di kisar halus",
                    "10 tangkai cili kering (potong pendek2 dan rebus)",
                    "1 labu bawang besar di belah 4.",
                    "1/2 inci belacan",
                    "1 sudu minyak masak",
                    "Bahan-bahan lain",
                    "1/2 senduk minyak (utk tumis)",
                    "bawang merah dan bawang putih racik/tumbuk (utk tumis)",
                    "2 keping asam gelugur (jus asam jawa pun boleh)",
                    "petai 5-10 keping (ambil isi)..kalau nak guna kulit pun bleh kalau petai muda..hiris nipis2",
                    "ikan bilis 1 genggam",
                    "1 labu bawang besar hiris nipis bulat2",
                    "garam dan gula secukup rasa"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Panaskan minyak..tumis bawang sampai naik kekuningan,masukkan bahan yg dibland..tumis sampai naik bau/pecah minyak..",
                    "Masukkan asam keping/jus asam jawa",
                    "Masukkan petai dan ikan bilis.tambahkan garam dan gula, last skali masukkan bawang besar yg dihiris bulat2.."
                ]
            },
            "tips_and_guides": [
                "kalau nak lagi sedap dan berlemak masukkan 1 senduk pati santan pekat akhir sekali..biarkan seketika sebelum padamkan api"
            ]
        }
    }
]