[
    {
        "title": "Sambal ketuk",
        "page_url": "https://resepichenom.com/kategori/pencicah?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-ketuk",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sambal_Ketuk.jpg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "5 biji bawang merah kecil",
                    "3 ulas bawang putih",
                    "10-15 tangkai cili padi",
                    "1 mangkuk ikan bilis",
                    "Limau kasturi",
                    "1/2 inci belacan bakar",
                    "1/2 sk garam",
                    "1 sk gula",
                    "Serbuk perasa"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Hiris nipis bawang merah kecil dan bawang putih.",
                    "Potong kasar cabai melaka (cili padi).",
                    "Basuh ikan bilis dan tos kering.",
                    "Panaskan minyak dan goreng ikan bilis sampai garing. Angkat dan toskan ikan bilis.",
                    "Goreng pulak cili padi dan hirisan bawang. Bila bawang dah garing boleh angkat dan sejukkan.",
                    "Bakar sekejap belacan.",
                    "Tumbuk bawang dan cili goreng sampai hancur (tapi jangan sampai lumat).",
                    "Masukkan belacan bakar, gula, garam dan serbuk perasa. Tumbuk sampai sebati.",
                    "Akhir sekali masukkan ikan bilis goreng (masuk sikit-sikit). Tumbuk sebati dan adjust kalau kurang.",
                    "Sambal sedia untuk dihidang bersama nasi panas dan telur goreng."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Sambal Ijo",
        "page_url": "https://resepichenom.com/kategori/pencicah?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-ijo",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sambah_Hijau.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "40 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Sambal Ijo": [
                    "450g cili padi hijau",
                    "150g cili besar hijau",
                    "1-2 biji tomato hijau",
                    "30g ikan bilis",
                    "2-3 cwn minyak masak",
                    "2-3 biji bawang merah kecil",
                    "1 biji bawang holland",
                    "5 ulas bawang putih",
                    "Garam secukup rasa",
                    "1 sb serbuk seasoning",
                    "4 helai daun limau purut"
                ]
            },
            "instructions": {
                "Untuk Sambal": [
                    "Potong kasar tomato (pastikan guna tomato yang masih hijau) dan bawang holland.",
                    "Hiris nipis bawang merah kecil dan bawang putih.",
                    "Daun limau purut koyak buang tulang tengah",
                    "Bersihkan cili api dan cili besar kemudian tos kering.",
                    "Cabut tangkai cili dan patahkan.",
                    "Didihkan air dan rebus semua cili dan tomato (tak perlu lama lebih kurang macam celur saja, kalau lama takut cili berubah warna).",
                    "Bila cili dan lembut sikit boleh angkat dan bilas dengan air sejuk.",
                    "Masukkan bahan yang direbus tadi dalam food processor atau blender kemudian kisar kasar (kalau rajin boleh tumbuk).",
                    "Basuh bersih ikan bilis dan goreng separuh masak. Bila dah masak boleh angkat dan ketepikan.",
                    "Dalam minyak yang sama, tumis bawang merah sampai lembut. Pastikan api kecil sebab takut bawang jadi perang sangat dan garing.",
                    "Kemudian masukkan bawang holland dan bawang putih. Kacau sampai bawang lembut.",
                    "Masukkan bahan kisar tadi dan kacau sampai lembut dan air kering sikit.",
                    "Perasakan dengan garam dan serbuk perasa (pilihan), boleh tambah kiub pati ayam kalau suka. Kacau sebati.",
                    "Tabur daun limau purut dan ikan bilis goreng.",
                    "Tutup api bila dah masak boleh dan sejukkan."
                ],
                "Untuk Simpan": [
                    "Rebus balang kaca dalam air panas untuk matikan kuman.",
                    "Keluarkan botol dan keringkan.",
                    "Senduk masuk sambal kedalam botol.",
                    "Tutup rapat dan simpan dalam peti ais."
                ]
            },
            "tips_and_guides": [
                "Pastikan air betul-betul mendidih sebelum rebus cili dan tomato.",
                "Kalau nak kurangkan pedas boleh kurangkan cili padi anggaran 400-350g dan lebihkan cili besar.",
                "Selepas rebus cili dan tomato, bilas atau rendam dalam air sejuk untuk hentikan proses pemanasan dan maintain warna hijau",
                "Untuk simpan sambal dalam suhu bilik boleh gunakan kaedah retort (masukkan dalam pressure cooker)."
            ]
        }
    },
    {
        "title": "Sambal Penyet Berapi",
        "page_url": "https://resepichenom.com/kategori/pencicah?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-penyet-berapi",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sambal_Penyet_Berapi.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "40 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "25-30 biji / 500g cili merah besar",
                    "60 biji / 300g cili padi merah",
                    "4-5 biji bawang merah",
                    "4 biji tomato",
                    "1 labu / 12 ulas bawang putih",
                    "3 inci belacan",
                    "2 sb gula",
                    "Garam secukup rasa",
                    "1 sb serbuk seasoning"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Cili merah dan cili padi, basuh bersih dan tos kering kemudian buang tangkai dan potong kasar (supaya cili tak meletup bila digoreng).",
                    "Potong kasar bawang merah dan tomato (untuk pekatkan sambal dan kurangakn kepedas sambal)",
                    "Cincang kasar bawang putih.",
                    "Panaskan minyak dan goreng bawang merah dan bawang putih. Goreng sampai bawang lembut. Kemudian angkat dan toskan minyak.",
                    "Goreng pulak cili merah dan cili padi. Goreng sampai cili lembut dan layu. Angkat dan toskan. Boleh goreng cili sekali dengan bawang tapi diseebabkan terlampau banyak jadi Che Nom goreng asing nak bagi cepat masak.",
                    "Goreng tomato. Jangan goreng tomato dengan bahan lain sebab bila tomato banyak dia akan berair. Bila tomato lembut, angkat dan toskan.",
                    "Kisar kesemua bahan dalam chopper. Kalau nak guna blender tambah sikit minyak sebelum kisar. Boleh jugak tumbuk sampai lumat.",
                    "Kisar halus atau kasar ikut citarasa, tapi jangan terlalu halus nanti tak cantik bila kita masak sambal.",
                    "Panaskan minyak dan goreng belacan sampai garing (boleh ganti kiub ikan bilis atau ikan bilis goreng).",
                    "Masukkan bahan kisar tadi dan tumis sampai pecah minyak.",
                    "Tambah gula, garam dan serbuk seasoning. Kacau sebati.",
                    "Tutup api dan masukkan kedalam balang kaca.",
                    "Tutup balang kaca tapi jangan ketatkan lagi, biar sambal sejuk dulu baru tutup rapat (biar wap naik dan kena penutup)."
                ]
            },
            "tips_and_guides": [
                "Jangan goreng tomato dengan bahan lain sebab bila tomato banyak dia akan berair.",
                "Kisar halus atau kasar ikut citarasa, tapi jangan terlalu halus nanti tak cantik bila kita masak sambal.",
                "Pastikan masak sambal dengan minyak yang banyak sebab minyak akan bantu sambal tahan lama.",
                "Petua untuk matikan kuman dalam sambal, selepas masukkan sambal kedalam balang tutup balang tapi jangan ketatkan lagi, biar sambal steam dan naik kena penutup."
            ]
        }
    },
    {
        "title": "Sambal Belacan Padu",
        "page_url": "https://resepichenom.com/kategori/pencicah?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-belacan-padu",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sambal_Belacan_Padu.jpg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Sambal Belacan": [
                    "8-10 tangkai cili merah besar",
                    "20-25 tangkai cili padi merah",
                    "15 tangkai cili padi hijau",
                    "4 ulas bawang putih",
                    "2 biji bawang besar",
                    "3 inci belacan",
                    "1/2 cawan jus asam jawa",
                    "1/4 cawan jus limau kasturi",
                    "4 belah kulit limau kasturi",
                    "Garam secukup rasa",
                    "2-3 sb gula",
                    "Sedikit serbuk seasoning, pilihan"
                ]
            },
            "instructions": {
                "Untuk Sambal Belacan": [
                    "Cili merah dan cili padi buang tangkai dan potong kasar.",
                    "Bawang besar potong 4 bahagian. Bawang putih potong kasar.",
                    "Limau kasturi dan limau nipis, belah 2, perah ambil jus dan tapis biji.",
                    "Racik halus kulit limau kasturi. Pastikan tiada biji, takut nanti sambal pahit.",
                    "Rendam asam jawa dengan air suam, ramas sebati dan keluarkan biji.",
                    "Belacan boleh bakar atas api atau kuali. Kalau bakar atas api, cucuk belacan dengan garfu dan bakar sampai nampak sikit kesan terbakar dan naik bau.",
                    "Untuk bakar atas kuali, letak belacan serta bawang besar dan bawang putih atas kuali dan masak sampai ada kesan terbakar. Angkat dan sejukkan.",
                    "Masukkan dalam blender bawang bakar, belacan bakar, jus asam jawa, jus limau, garam, gula dan serbuk perasa (pilihan). Kisar halus.",
                    "Masukkan hirisan kulit limau kasturi, cili merah dan cili padi. Kisar kasar",
                    "Masukkan sambal dalam kuali dan masak sampai mendidih.",
                    "Masukkan sambal dalam botol dan sejukkan sebelum tutup.",
                    "Biarkan dalam suhu bilik dalam 5-6 jam untuk sambal mesra sebati kemudian simpan dalam peti sejuk."
                ]
            },
            "tips_and_guides": [
                "Che Nom campur cili merah dalam sambal sebab boleh kawal tahap pedas, kalau suka lebih pedas boleh masukkan cili padi semua.",
                "Potong limau melintang (bukan ikut urat tengah) supaya senang nanti nak keluarkan biji dan perah ambil jus.",
                "Golek-golek limau sebelum potong untuk mudah perah jus.",
                "Pastikan tiada biji limau sebelum kisar takut sambal pahit.",
                "Gaul asam jawa dengan air suam untuk tahan lama.",
                "Masak sambal sampai mendidih untuk tahan lama.",
                "Untuk botol kaca, bilas dengan air panas dan keringkan sepenuhnya"
            ]
        }
    },
    {
        "title": "Kuah Kacang Pekat Dan Pedas",
        "page_url": "https://resepichenom.com/kategori/pencicah?page=1",
        "recipe_url": "https://resepichenom.com/resepi/kuah-kacang-pekat-dan-pedas",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Kuah_Kacang_1_x_1.jpg",
            "masa_penyediaan": "25 minit",
            "masa_memasak": "45 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Kisar Halus": [
                    "8-10 biji bawang merah kecil",
                    "6 ulas bawang putih",
                    "2 inci halia",
                    "4-5 batang serai",
                    "2 inci lengkuas",
                    "2 sb /25g udang kering",
                    "25 biji cili kering",
                    "Sedikit minyak",
                    "Sedikit air"
                ],
                "Bahan Lain": [
                    "1 mangkuk besar minyak masak",
                    "600g kacang tanah",
                    "Air anggaran 4-6 cawan",
                    "1 kotak kecil /200ml santan",
                    "½ cawan air asam jawa",
                    "3 sb kicap manis",
                    "150g gula melaka",
                    "Garam secukup rasa"
                ]
            },
            "instructions": {
                "Untuk Kuah Kacang": [
                    "Goreng kacang tanah tanpa minyak sehingga keperangan.",
                    "Tumbuk kasar atau kisar kering kacang tanah.",
                    "Panaskan minyak, lalu goreng bahan-bahan kisar halus iaitu bawang putih, halia, bawang, serai, lengkuas, cili kering, dan udang kering. Kacau dalam 3-4 minit.",
                    "Angkat dan toskan minyak.",
                    "Kisar halus bahan gorengan dengan sedikit air sehingga menjadi pes pekat.",
                    "Panaskan minyak, masukkan bahan kisar halus dan kacau sehingga pecah minyak.",
                    "Masukkan kacang tanah goreng, air dan gula melaka. Renehkan kuah kacang dalam anggaran 30 minit dengan api perlahan sehingga kuah kacang pecah minyak dan masak.",
                    "Masukkan santan, garam secukup rasa, air asam jawa dan kicap manis. Tambah air serta gula melaka jika perlu.",
                    "Masak kuah kacang sehingga mendidih.",
                    "Kemudian, kuah kacang siap untuk dihidang."
                ]
            },
            "tips_and_guides": [
                "Sebaiknya pilih lengkuas yang lebih muda dan masih lembut.",
                "Selain gula melaka, boleh juga digantikan dengan gula nisan.",
                "Kacang tanah yang rangup boleh di uji pada kerapuhan kulit kacang dan kulit pada biji kacang akan lebih senang tertanggal.",
                "Untuk menggoreng kuah kacang, gunakan minyak yang banyak supaya kuah kacang menjadi lebih sedap."
            ]
        }
    },
    {
        "title": "Sambal Belacan Ala Kedai Tomyam Thai",
        "page_url": "https://resepichenom.com/kategori/pencicah?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sambal-belacan-ala-kedai-tomyam-thai",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Sambal_Belacan.jpg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "N/A",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "2-3 biji cili merah",
                    "10 tangkai cili padi",
                    "3 ulas bawang putih",
                    "½ biji bawang holland",
                    "½ biji  tomato",
                    "1 inci belacan",
                    "1-2 sudu kecil gula",
                    "½ sudu besar serbuk perasa",
                    "Sedikit air",
                    "Garam, secukup rasa",
                    "Jus limau nipis, secukup rasa"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Potong kasar cili padi, cili besar, bawang putih, bawang holland dan tomato.",
                    "Potong limau nipis,",
                    "Masuk dalam blender bahan potong kasar, belacan bakar, gula nisan, serbuk perasa (MSG), garam dan sedikit air.",
                    "Perah jus limau nipis dan kisar halus.",
                    "Masukkan dalam mangkuk dan adjust dengan garam dan jus limau nipis."
                ]
            },
            "tips_and_guides": [
                "Boleh tambah sos ikan jika suka."
            ]
        }
    },
    {
        "title": "Sos Cili Thai",
        "page_url": "https://resepichenom.com/kategori/pencicah?page=1",
        "recipe_url": "https://resepichenom.com/resepi/sos-cili-thai",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/c7a010853ebde11c23b9eefd69d71f7f6b9839de.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "5 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "3 biji cili merah",
                    "2 biji cili padi merah",
                    "4 ulas bawang putih",
                    "1/2 cawan  gula",
                    "1/4 cawan cuka",
                    "1 cawan air",
                    "2 sudu besar tepung jagung, bancuh dengan sedikit air",
                    "1 sudu kecil garam"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Potong kasar cili merah, cili padi merah dan bawang putih.",
                    "Masukkan ke dalam blender bersama gula, cuka dan air. Kisar sehingga bahan-bahan hancur tetapi masih kasar. Jangan terlalu halus.",
                    "Masukkan bahan kisar ke dalam periuk dan masak di atas api kecil. Masukkan bancuhan tepung jagung dan garam.",
                    "Masak seketika sehingga sos menjadi pekat."
                ]
            },
            "tips_and_guides": [
                "Jika sos terlalu pekat boleh tambahkan sedikit air.",
                "Jika sos terlalu cair, tambah sedikit bancuhan tepung jagung."
            ]
        }
    },
    {
        "title": "Kuah Kacang",
        "page_url": "https://resepichenom.com/kategori/pencicah?page=1",
        "recipe_url": "https://resepichenom.com/resepi/kuah-kacang",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/9474f5e640622917d404e9c556c41638ff4179e4.jpeg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1 kg kacang tanah",
                    "15 biji cili kering, buang biji,rendam air panas dan kisar halus",
                    "2 keping gula melaka",
                    "1 mangkuk kecil air asam jawa",
                    "garam secukup rasa"
                ],
                "Bahan Untuk Hiris Nipis": [
                    "14 biji bawang merah",
                    "7 ulas bawang putih",
                    "2 inci halia",
                    "2 inci lengkuas",
                    "2 batang serai"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Goreng kacang tanah dalam minyak. Angkat dan sejukkan kemudian kisar kasar.",
                    "Goreng bahan hiris nipis dalam sedikit minyak sehingga naik bau. Angkat dan kisar halus bersama sedikit air.",
                    "Panaskan minyak anggaran 3 senduk besar dan masukkan bahan kisar halus bersama cili kisar. Goreng sehingga cili masak pecah minyak.",
                    "Masukkan kacang tanah dan air secukupnya. Masak sehingga mendidih.",
                    "Masukkan gula melaka, air asam jawa dan garam secukup rasa. Teruskan masak sehingga minyak timbul di permukaan dan kuah menjadi pekat."
                ]
            },
            "tips_and_guides": [
                "Kacang tidak perlu dibuang kulit. Goreng dengan api perlahan sehingga sedikit keperangan tetapi hati-hati supaya kacang jangan sampai terlebih goreng kerana nanti akan ada rasa pahit. Rasa pahit itu nanti akan mempengaruhi rasa kuah dan kurang enak."
            ]
        }
    },
    {
        "title": "Air Asam Tomato",
        "page_url": "https://resepichenom.com/kategori/pencicah?page=1",
        "recipe_url": "https://resepichenom.com/resepi/air-asam-tomato",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/1e2643eb50a8eaabebd163d884656c0ce77c5288.jpeg",
            "masa_penyediaan": "25 minit",
            "masa_memasak": "N/A",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1 Biji Tomato",
                    "1 Biji Bawang Besar",
                    "1/2 Cawan Air Asam Jawa",
                    "Perahan Limau Nipis- 1 Biji",
                    "2 Sudu Besar Sos Ikan",
                    "Garam & Gula"
                ],
                "Bahan Untuk Dikisar (Kisar Kasar)": [
                    "3 Biji Cili Merah",
                    "6 Tangkai Cili Padi",
                    "2 CM belacan Panggang"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Potong nipis tomato dan bawang besar",
                    "Campurkan dengan bahan kisar kasar, air asam jawa dan sos ikan.",
                    "Perahkan jus limau.",
                    "Masukkan garam dan gula secukup rasa."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Air Asam Ikan Bakar",
        "page_url": "https://resepichenom.com/kategori/pencicah?page=1",
        "recipe_url": "https://resepichenom.com/resepi/air-asam-ikan-bakar",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/803bcc6c2462ee37f24e1ea29c0953e90f547e4f.jpeg",
            "masa_penyediaan": "10 minit",
            "masa_memasak": "N/A",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "Asam jawa",
                    "1 sudu besar kerisik",
                    "10 tangkai cili padi, dipotong nipis",
                    "1 sudu kecil sos ikan thai (optional)",
                    "1 biji tomato, hiris kasar",
                    "1 biji bawang besar, hiris kasar",
                    "1 1/2 cawan pekatan air asam jawa",
                    "Garam",
                    "Gula"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Satukan air asam jawa dan belacan.",
                    "Masukkan hirisan bawang besar dan tomato, sos ikan, cili padi dan kerisik. Kacau sebati.",
                    "Perasakan dengan garam dan gula secukup rasa."
                ]
            },
            "tips_and_guides": [
                "Pastikan anda menggunakan air asam jawa yang pekat untuk resipi ini."
            ]
        }
    }
]