[
    {
        "title": "Cucur Udang Bulat",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/cucur-udang-bulat",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Cucur_Udang_Bulat.jpg",
            "masa_penyediaan": "40 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Cucur Udang": [
                    "2 - 2 1/2 cwn air",
                    "2 1/2 cwn tepung gandum",
                    "2 sk yis kering",
                    "1/2 sb gula",
                    "1 sk serbuk kunyit",
                    "1-2 sk garam",
                    "1/2 sb serbuk seasoning",
                    "1/2 biji bawang besar",
                    "1/2 sk serbuk penaik",
                    "1 ikat daun kucai",
                    "1 mangkuk besar taugeh",
                    "Udang"
                ],
                "Bahan Kuah Kacang": [
                    "Telur rebus",
                    "1/2 cwn minyak masak",
                    "3 biji bawang merah kecil",
                    "3 ulas bawang putih",
                    "1/2 inci halia",
                    "4 sb cili kisar",
                    "1 1/2 cwn kacang tanah",
                    "Air rebusan kulit udang",
                    "ATAU Air biasa",
                    "4 ekor isi udang (cincang)",
                    "1 ketul kecil gula melaka",
                    "2 sb kicap pekat manis",
                    "Garam secukup rasa",
                    "2 ketul tauhu",
                    "Timun"
                ]
            },
            "instructions": {
                "Cucur Udang": [
                    "Carik daun kucai dan potong pendek.",
                    "Potong dadu bawang besar.",
                    "Udang bahagi 2, satu trim kepala sahaja, satu lagi trim kepala dan kupas kulit.",
                    "Bancuh tepung gandum, yis kering, gula pasir, serbuk kunyit, garam (jangan bagi kena direct dengan yis), serbuk penaik, serbuk seasoning dan air.",
                    "Masukkan bawang merah, daun kucai dan taugeh.",
                    "Tutup dengan kain dan rehatkan adunan sampai naik kembang anggaran 30 minit.",
                    "Panaskan minyak dan rendam senduk dalam minyak sampai panas.",
                    "Isi adunan cucur udang dalam senduk separuh penuh,  letak udang (tiada kulit) tengah-tengah kemudian isi adunan cucur sampai penuh. Akhir sekali letak udang (yang berkulit) sebagai hiasan..",
                    "Terus goreng sampai perang dan garing."
                ],
                "Kuah Kacang": [
                    "Cincang halus bawang merah kecil, bawang putih, dan halia.",
                    "Panaskan minyak dan goreng kacang tanah. Bila dah perang boleh angkat kacang dan kisar kasar.",
                    "Gaul tauhu dengan kunyit dan garam kemudian goreng sampai garing. Bila dan garing boleh angkat dan ketepikan.",
                    "Tumis bawang dan halia cincang sampai naik bau. Kemudian masukkan cili kisar dan masak sampai garing.",
                    "Masukkan kacang tanah kisar dan air rebusan kulit udang. Masak sampai pecah minyak.",
                    "Masukkan udang cincang (atau udang kering tumbuk), gula melaka, kicap manis, air untuk kuah dan garam secukup rasa.",
                    "Boleh hidang cucur bersama tauhu goreng, timun, telur rebus dan kuah kacang."
                ]
            },
            "tips_and_guides": [
                "Masa bancuh adunan cucur udang, masukkan air sedikit demi sedikit sebab ada jenis tepung yang pakai air banyak ada yang pakai air sikit. Che Nom pakai 2 cwn air dah pekat elok.",
                "Untuk air rebusan kulit udang, Che Nom rebus dan kisar kulit, dan ambik air rebusan tu. Perisa asli.",
                "Pastikan senduk betul-betul panas baru letak adunan cucur udang. Kalau tak panas nanti cucur akan melekat dekat senduk.",
                "Masa angkat cucur, api jangan perlahan sangat nanti cucur akan serap minyak."
            ]
        }
    },
    {
        "title": "Kerepek Gunting Pedas",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/kerepek-gunting-pedas",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Kerepek_Gunting.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "4 cwn/500g  tepung gandum",
                    "10 tangkai cili kering",
                    "1 genggam ikan bilis",
                    "1/2 kiub pati ikan bilis",
                    "1-2 tangkai daun  kari",
                    "1/2 sb jintan manis",
                    "1/2 sb jintan putih",
                    "1 sb serbuk cili",
                    "1/2-1 sb serbuk kari",
                    "Serbuk perasa",
                    "1 sk garam",
                    "1 sb penuh majerin",
                    "3 sb minyak masak",
                    "Air Sejuk (anggaran 1 cwn, letak sikit-sikit)"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Gunting cili kering dan rebus sampai lembut.",
                    "Kisar kering jintan manis, jintan putih, kiub ikan bilis, ikan bilis dan cili kering. Berhenti kisar, tambah 1 tangkai daun kari dan sambung kisar.",
                    "Panaskan majerin dan minyak masak sampai medidih.",
                    "Tuang masuk minyak dan majerin panas tadi dalam tepung gandum.",
                    "Gaul sampai jadi berserbuk macam serbuk roti.",
                    "Masukkan semua bahan kisar, serbuk cili dan serbuk kari ikan dalam adunan tepung.",
                    "Bancuh garam dengan sedikit air dan tuang masuk dalam adunan tepung.",
                    "Tuang masuk air sejuk sikit-sikit sampai dapat adunan yang boleh dibentuk.",
                    "Perap doh selama 30 minit.",
                    "Potong doh kecil-kecil anggaran 16 bahagian.",
                    "Bulatkan doh dan leperkan sampai memanjang dan nipis. Sambik gelek, sapu dengan tepung gandum supaya tak melekat.",
                    "Potong doh anggaran 1/2 cm panjang kemudian sodok dengan scraper untuk leraikan.",
                    "Panaskan minyak dan goreng. Rajin kacau untuk leraikan doh yang bergumpal.",
                    "Tabur setangkai daun kari.",
                    "Bila dah rangup boleh angkat dan toskan minyak.",
                    "Sebelum masukkan dalam balang, sejukkan betul-betul dulu."
                ]
            },
            "tips_and_guides": [
                "Kalau nak mudah nipiskan doh, boleh beli pasta maker.",
                "Che Nom potong doh nipis -nipis dengan pizza cutter wheel, kalau nak guna pisau pon boleh tapi susah sikit.",
                "Kerap tabur doh dengan tepung untuk elak melekat.",
                "Goreng dalam minyak yang banyak dan api sederhana. Kita tak nak cili dalam adunan jadi hitam bila minyak panas sangat, nanti warna jadi tak cantik."
            ]
        }
    },
    {
        "title": "Cucur Ikan Bilis Bulat",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/cucur-ikan-bilis-bulat",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Cucur_Bilis_Bulat.jpg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1/2 biji bawang besar",
                    "1 genggam ikan bilis",
                    "2 biji cili merah",
                    "1 pokok daun bawang",
                    "2 cwn tepung",
                    "Anggaran 2 cwn air panas",
                    "1/2 sk garam",
                    "1 sk gula"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Hiris nipis bawang besar dan daun bawang,",
                    "Tumbuk kasar ikan bilis dan cili merah.",
                    "Gaul sebati tepung gandum, bahan tumbuk kasar, hirisan bawang, daun bawang, garam dan gula sikit.",
                    "Tuang air panas sikit-sikit dan gaul sebati. Pastikan adunan pekat bergumpal untuk senang buat bulat.",
                    "Bila adunan dah sebati, tunggu sekejap adunan suam.",
                    "Bulatkan adunan.",
                    "Panaskan minyak dan goreng cucur sampai keperangan.",
                    "Bila dah garing, boleh angkat dan toskan minyak."
                ]
            },
            "tips_and_guides": [
                "Siapa yang suka pedas boleh ganti cili merah dengan cili padi.",
                "Kalau nak cucur flawless boleh potong dadu bawang besar.",
                "Pastikan air panas betul-betul mendidih, kalau panas penapis air tu memang tak cukup.",
                "Elak tambah tepung selepas tambah air panas, takut nanti cucur pecah selepas goreng.",
                "Sapu minyak pada pinggan dan tangan untuk elak melekat.",
                "Masa mula-mula goreng, kita kena tunggu lapisan luar keras baru alihkan.",
                "Untuk dapat adunan yang gangup diluar dan lembut di dalam, kita kena kerap kacau dan alih-alihkan.",
                "Sambil-sambil goreng, kita perlu tekan-tekan dan ratakan dengan sudip untuk bantu dapat permukaan cucur yang lincin."
            ]
        }
    },
    {
        "title": "Corndog ala Family Mart",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/corndog",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Corndog.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "5 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Corndog": [
                    "Sosej",
                    "4 ketul keju mozarella",
                    "1 cwn tepung gandum",
                    "1 sb gula",
                    "2 sb tepung jagung",
                    "1/2 sk serbuk penaik",
                    "1/4 sk garam",
                    "1/2 cwn + 2 sb susu full cream",
                    "3/4 sk yis kering",
                    "Serbuk roti",
                    "Mayonis"
                ],
                "Bahan Sos Gochujang": [
                    "2 sb cuka makan",
                    "2 sb pes gochujang",
                    "1 sb gula perang",
                    "1 sb kicap cair",
                    "2-3 sb madu"
                ]
            },
            "instructions": {
                "Corndog": [
                    "Potong sosej kepada 2 bahagian.",
                    "Potong  keju pada 5 bahagian kemudian simpan dalam peti sejuk.",
                    "Campur susu full cream dengan yis kering. Suamkan sekejap dalam microwave.",
                    "Kacau sebati tepung gandum, gula, tepung jagung, garam, baking powder.",
                    "Tuang masuk bancuhan susu dan yis tadi.",
                    "Kacau sebati sampai pekat bertali kemudian tutup dan biar kembang 2 kali ganda.",
                    "Panaskan air dan rebus sosej 3-4 minit.",
                    "Cucuk sosej dan keju dengan chopstick.",
                    "Salut sosej dan keju dengan doh dan breadcrumbs.",
                    "Panaskan minyak dan goreng sampai keperangan."
                ],
                "Sos Gochujang": [
                    "Bancuh sos gochujang, gula perang, kicap cair, cuka makan dan madu.",
                    "Panaskan sekejap dalam microwave dan kacau sebati.",
                    "Masukkan dalam botol atau pipping bag.",
                    "Boleh pipe sos gochujang dan mayonis atas corndog."
                ]
            },
            "tips_and_guides": [
                "Che Nom guna mozzarella cheese block. Kalau takda boleh guna yang grated tapi cari yang mozzarella je, caranya gumpal grated cheese pada chopsticks sampai berketul.",
                "Susu full cream Che Nom microwave bagi suam sikit sebab nak bagi yis kembang cepat sikit, kalau tak microwave pon takpe tapi lambat sikit la kembang.",
                "Adunan jangan cair, pastikan pekat bertali sebab resepi kali ni jenis yang kitab oleh Tarik dan lilit.",
                "Salut doh sampai tertutup semua permukaan sosej dan keju, kalau ada lubang nanti keju bucor masa goreng.",
                "Masa goreng pastikan minyak betul-betul panas dan tenggelam separuh atau 3/4."
            ]
        }
    },
    {
        "title": "Mushroom Sup dan Garlic Bread",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/mushroom-sup-dan-garlic-bread",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Mushroom_Sup.jpg",
            "masa_penyediaan": "40 minit",
            "masa_memasak": "40 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Mushroom Sup": [
                    "2-3 sb mentega",
                    "1/2 biji bawang holland",
                    "2 ulas bawang putih",
                    "300g (2 pek) cendawan butang",
                    "2 sb tepung gandum",
                    "1/2 sk serbuk lada hitam",
                    "3 cwn susu",
                    "2 cwn air ATAU stok rebusan ayam",
                    "Kiub pati ayam",
                    "Garam secukup rasa",
                    "Daun parsley"
                ],
                "Bahan Untuk Roti": [
                    "1/3 ketul / 80g mentega",
                    "2 ulas bawang putih",
                    "Sedikit garam (jika mentega tak bergaram)",
                    "1 sb daun parsley cincang",
                    "ATAU 1 sk serbuk parsley kering"
                ]
            },
            "instructions": {
                "Untuk Mushroom Sup": [
                    "Cincang halus daun parsley, simpan dalam bekas bertutup dan ketepikan (kalau tak ada parsley fresh, boleh ganti dengan herba kering seperti parsley kering, Italian herbs, oregano atau thyme.",
                    "Potong dadu bawang holland.",
                    "Bawang putih parut halus.",
                    "Mentega potong dadu.",
                    "Bilas cendawan dengan air dan kemudian cepat-cepat lap kering dengan kain.",
                    "Bahagi cendawan kepada dua bahagian. Yang pertama potong kasar dan ketepikan.",
                    "Baki cendawan potong kasar, masuk dalam food processor dan kisar halus tapi jangan halus sangat. (Che Nom kisar cendawan ni untuk pekatkan kuah dan bagi kuah extra creamy).",
                    "Panaskan mentega dan masukkan bawang holland. Masak sampai bawang holland bertukar jernih dan lutsinar.",
                    "Masukkan bawang putih dan masak sampai kekuningan.",
                    "Tuang masuk cendawan kisar dan masak sampai air kering.",
                    "Masukkan tepung gandum (untuk pekatkan kuah) dan kacau sekata.",
                    "Masukkan air stok rebusan ayam (Che Nom ada buat stok ayam dengan air rebusan tulang ayam sebelum mula masak, kalau tak ada boleh ganti dengan air kosong).",
                    "Masukkan susu. Che Nom tak guna cooking cream atau whipping cream sebab lebih mahal, tapi yang ni lebih creamy.",
                    "Masuk kiub pati ayam (Che Nom masuk sikit saja sebab tadi dah masukkan air stok ayam, tapi kalau kalau yang guna air kosong boleh masukkan 1 ketul kiub pati ayam).",
                    "Masukkan garam dan serbuk lada hitam. Kacau sampai kuah pekat dan mendidih.",
                    "Masukkan hirisan cendawan dan reneh sampai cendawan lembut.",
                    "Tabur daun parsley dan tutup api."
                ],
                "Untuk Roti": [
                    "Potong mentega dan masuk dalam mangkuk.",
                    "Parut halus bawang putih",
                    "Masuk sikit daun parsley (kalau tak ada yang fresh boleh guna yang kering). Biarkan 10 minit atau sampai mentega lembut.",
                    "Tambah sedikit garam (kalau guna mentega tak bergaram kalau yang bergaram tak perlu tambah garam).",
                    "Tekan-tekan dan gaul sebati kesemua bahan.",
                    "Belah 2 roti, Che Nom guna roti hotdog dan roti gardenia, nak lagi sedap boleh guna roti perancis (French loaf).",
                    "Sapu roti dengan garlic butter spread tadi.",
                    "Kemudian bakar roti atas pan grill (kalau nak bakar dalam oven pon boleh).",
                    "Bila bahagian bawah dah garing boleh terbalikkan.",
                    "Angkat roti dan sedia untuk dihidang bersama mushroom soup."
                ]
            },
            "tips_and_guides": [
                "Masa tumis bawang pastikan bawang tak hangit dan kawal api kalau tak sup akan pahit.",
                "Reneh sup cendawan atas api sederhana, jangan kuat sangat.",
                "Che Nom sarankan guna French loaf sebab lebih rangup roti tu.",
                "Mula bakar roti dengan bahagian yang tak sapu mentega, agak-agak roti dah keras sikit baru terbalikkan roti bahagian yang sapu mentega, sebab bahagian sapu mentega lebih cepat hangit."
            ]
        }
    },
    {
        "title": "Cakoi & Sos Pandan Kastard",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/cakoi-sos-pandan-kastard",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Cakoi.jpg",
            "masa_penyediaan": "N/A",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Cakoi": [
                    "3 1/4 cawan tepung gandum",
                    "1 1/2 sudu kecil yis kering",
                    "1/2 sudu kecil garam",
                    "2 sudu kecil baking powder",
                    "2 1/2 sudu besar gula kastor",
                    "1/2 cawan susu full cream",
                    "1/2 cawan air",
                    "1/2 biji  telur",
                    "3 sudu besar minyak masak",
                    "Sedikit minyak untuk sapuan"
                ],
                "Bahan Untuk Sos Kastard Pandan": [
                    "1 1/2 cawan susu full cream atau santan",
                    "2 sudu besar tepung kastard",
                    "1 sudu kecil ekstract pandan",
                    "Sedikit pewarna hijau",
                    "2 sudu besar gula",
                    "Sedikit garam"
                ]
            },
            "instructions": {
                "Untuk Cakoi": [
                    "Keluarkan doh dan uli sikit untuk buang lebihan udara.",
                    "Masukkan tepung gandum, yis kering, garam (letak jauh sikit dari yis), baking powder, gula kastor, telur, susu, air dan minyak kedalam mangkuk.",
                    "Uli adunan sampai jadi doh. Tambah 1 sb minyak masa hujung-hujung proses menguli.",
                    "Gris mangkuk dengan minyak.",
                    "Pindah masukkan doh kedalam mangkuk dan rehatkan selama 1-2 jam.",
                    "Tabur sikit tepung atas papan canai.",
                    "Canaikan atau leperkan doh menjadi segi empat tepat.",
                    "Potong doh anggaran saiz 8cm x 3cm",
                    "Cara 1 sapu sekeping doh dengan sedikit air dan tindan dengan sekeping lagi doh. Tabur sedikit tepung dan tekan di tengah (boleh tekan dengan chopstick atau lidi).",
                    "Cara 2 ambil sekeping doh, tabur tepung (untuk elak melekat) dan tekan di tengah.",
                    "Panaskan minyak (pastikan minyak banyak dan cakoi tenggelam).",
                    "Tarik perlahan-lahan cakoi dan goreng sehingga keperangan.",
                    "Kerap balik-balikan cakoi masa mula menggoreng.",
                    "Angkat dan toskan minyak."
                ],
                "Untuk Sos Pandan Kastard": [
                    "Masukkan susu full cream (atau santan), tepung kastard, ekstrak pandan, pewarna hijau dan gula ke dalam periuk.",
                    "Bukak api perlahan dan kerap kacau.",
                    "Bila kastard dah pekat masukkan sedikit garam. Boleh tambah susu atau air kalau kastard terlalu pekat.",
                    "Hidang bersama cakoi."
                ]
            },
            "tips_and_guides": [
                "Boleh bancuh dulu yis, Che Nom masukkan terus tapi pastikan yis masih elok.",
                "Jangan letak garam dekat dengan yis (untuk elak yis rosak), campur dulu yis dan garam dengan tepung sebelum adun kesemua bahan.",
                "Masa masak sos kastard pastikan kerap kacau takut kastad berketul.",
                "Pastikan minyak banyak dan cakoi tenggelam (deep fry).",
                "Kerap balik-balikan cakoi masa mula menggoreng."
            ]
        }
    },
    {
        "title": "Popcorn Caramel Homemade",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/popcorn-caramel-homemade",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Pocorn_Caramel_Homemade.jpg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Popcorn": [
                    "1/3 cawan popcorn",
                    "3 sb minyak popcorn",
                    "ATAU",
                    "2 sb minyak masak",
                    "1 sb mentega"
                ],
                "Bahan Untuk Gula Karamel": [
                    "1/4 cwn air",
                    "2 sb mentega",
                    "1/2 cwn + 1 tbsp gula",
                    "1/4 sk baking soda",
                    "1/4 sk garam"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Cara-cara untuk masak popcorn dengan minyak popcorn",
                    "Masuk minyak popcorn.",
                    "Bila minyak dah panas masukkan bertih popcorn dan kacau sebati.",
                    "Bila popcorn dah mula meletup tutup tudung periuk dan perlahankan api.",
                    "Goyang periuk sekali sekala.",
                    "Bila popcorn dan masak tuang masuk dalam mangkuk besar."
                ],
                "Untuk Masak Popcorn Dengan Minyak Masak": [
                    "Masukkan minyak masak dan mentega.",
                    "Masukkan popcorn dan kacau sampai popcorn meletup.",
                    "Tutup tudung periuk dan perlahankan api takut popcorn hangit.",
                    "Masak sampai habis bunyi meletup."
                ],
                "Untuk Gula Karamel": [
                    "Masukkan gula putih dan air dalam kuali.",
                    "Masak sampai air gula cair dan bertukar perang. Tak perlu kacau, hanya goyang-goyang kuali saja.",
                    "Bila air gula bertukar perang muda (light brown) masukkan butter dan tutup api (untuk elak caramel gelap dan pahit). Kacau sampai pekat",
                    "Masukkan garam. Kacau sebati.",
                    "Masukkan baking soda dan kacau cepat-cepat.",
                    "Cepat-cepat tuang masuk karamel dalam popcorn.",
                    "Gaul popcorn cepat-cepat sementara karamel masih panas.",
                    "Pindah masuk popcorn dalam tray dan relaikan popcorn yang melekat."
                ]
            },
            "tips_and_guides": [
                "Gunakan periuk yang besar dan tinggi biar cukup ruang untuk popcorn meletup.",
                "Bila popcorn mula meletup, perlahankan api takut popcorn cepat hangit.",
                "Kita tak boleh guna semua mentega untuk masak popcorn, campur sedikit minyak masak, sebab mentega cepat hangus dan popcorn akan jadi tak sedap.",
                "Masa masak caramel pastikan bahan dah bersedia (stand by) sebab proses masak caramel cepat, kalau terlambat gula jadi hangus atau sejuk kalau biar lama."
            ]
        }
    },
    {
        "title": "Nugget Ayam",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/nugget-ayam",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Nugget_Ayam-2.jpg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Isi Nugget": [
                    "500g isi ayam",
                    "4 keping roti",
                    "1/2 cwn /125ml susu full cream",
                    "3 ulas bawang putih",
                    "1 biji bawang merah kecil",
                    "1 sk serbuk lada putih",
                    "1 sk serbuk lada hitam",
                    "1/2 sk serbuk cayenne atau paprika",
                    "1/2 sk herba Itali (pilihan)",
                    "4 sb tepung ubi",
                    "1 sk serbuk penaik",
                    "1/2 sk garam"
                ],
                "Bahan Salutan": [
                    "Tepung gandum",
                    "Serbuk roti",
                    "2 biji telur"
                ]
            },
            "instructions": {
                "Untuk Isi Nugget": [
                    "Potong kasar roti. Masukkan roti dan susu dalam mangkuk. Tekan-tekan roti biar serap sebati.",
                    "Parut halus bawang putih dan bawang merah kecil.",
                    "Isi ayam trim buang tulang dan lemak kemudian potong kepada ketulan kecil.",
                    "Masuk dalam food processor isi ayam, roti yand direndam, serbuk lada putih, bawang parut, serbuk cayenne atau paprika, serbuk lada hitam, herba itali (pilihan) dan garam. Kisar sampai halus.",
                    "Masukkan tepung ubi dan baking powder. Sambung kisar halus semua bahan.",
                    "Gris loyang (loyang 7x7 inci) dengan minyak masak.",
                    "Pindah masuk isi ayam kisar kedalam loyang. Ratakan dengan tangan (untuk mudah, lumur tangan dengan minyak sebelum ratakan).",
                    "Kukus anggaran masa 20 minit.",
                    "Keluarkan dan biarkan sejuk.",
                    "Potong atau terap isi nugget mengikut cita rasa masing-masing (Che Nom potong kepada 24 bahagian kemudian belah lagi 2, hasilnya 48 biji)."
                ],
                "Untuk Salutan": [
                    "Pecahkan telur. Masukkan garam dan pukul sebati.",
                    "Salut isi nugget dengan tepung gandum.",
                    "Celup dalam telur. Toskan lebihan telur.",
                    "Salut sebati dengan serbuk roti.",
                    "Goreng nugget dalam minyak separuh tenggelam.",
                    "Angkat dan hidang bersama sos cili dan mayonis."
                ]
            },
            "tips_and_guides": [
                "Tujuan letak roti supaya nugget mudah terbentuk, tak kering dan tak berderai bila proses membentuk.",
                "Tepung ubi ditambah untuk beri texture kenyal pada nugget dan baking powder untuk texture berongga bila goreng nanti.",
                "Kalau tak nak kukus isi nugget boleh bentukkan (bahan kisar) dan sejukkan dalam freezer 30 minit, keluarkan dan salut macam biasa.",
                "Boleh salut dua kali nugget untuk lebih tebal. Ulang celup telur dan serbuk roti. Tapi sekali salutan sudah memadai untuk rangup.",
                "Nugget yang belum goreng boleh simpan dalam freezer anggaran 1-2 bulan."
            ]
        }
    },
    {
        "title": "Waffle Rangup & Lembut Gebu, Kalah Kedai Punya!",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/waffle-rangup-lembut-gebu-kalah-kedai-punya",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Waffle_Rangup.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "N/A",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Waffle": [
                    "2 cawan susu krim penuh",
                    "2 sb jus lemon",
                    "2/3 cawan minyak jagung (boleh kurangkan kpd 1/2 cawan jika suka)",
                    "2 biji telur",
                    "2 1/4 cawan tepung gandum",
                    "1/2 cawan tepung jagung",
                    "2 sb gula halus",
                    "1 sk serbuk penaik",
                    "1/2 sk soda bikarbonat",
                    "1/2 sk garam",
                    "1 1/2 sk esen vanila"
                ],
                "Bahan Sos Coklat": [
                    "1 cawan kepingan coklat",
                    "1 sb mentega",
                    "1/4 cawan susu krim penuh"
                ]
            },
            "instructions": {
                "Untuk Adunan Waffle": [
                    "Perah dan ambil jus lemon. Masukkan jus lemon dan susu full cream kedalam mangkuk. Kacau sebati dan ketepikan.",
                    "Dalam mangkuk yang berasingan, masukan tepung gandum, tepung jagung, garam, serbuk penaik, baking soda dan gula halus. Gaul sebati kesemua bahan.",
                    "Pecahkan telur dan asingkan kuning dan putih telur. Pukul putih telur sampai kembang.",
                    "Masukkan kuning telur, esen vanilla dan minyak jagung (boleh ganti minyak masak) kedalam adunan susu (buttermilk).",
                    "Masukkan adunan basah ke dalam adunan kering. Kacau sebati (jangan terlebih kacau).",
                    "Masukkan adunan telur putih dan kacau sebati perlahan-lahan."
                ],
                "Untuk Sos Coklat": [
                    "Cairkan kepingan coklat, susu full cream dan butter.",
                    "Keluarkan dari microwave dan kacau sebati."
                ],
                "Untuk Masak Waffle": [
                    "Gris waffle maker plate dengan minyak.",
                    "Masukkan adunan waffle dan masak anggaran 4 minit 30 saat.",
                    "Hidangkan bersama sos coklat."
                ]
            },
            "tips_and_guides": [
                "Untuk tahu putih telur telah cukup kembang, angkat sikit (dengan whisk atau sudu), kalau jadi bertanduk kiranya dah kembang.",
                "Jangan terlebih kacau adunan waffle, takut terhasil gluten. Gluten yang akan menyebabkan waffle keras.",
                "Cairkan coklat sekadar lembut tak perlu mendidih, kalau terlebih panas takut coklat rosak.",
                "Kalau nak garing tahan lama, rehatkan waffle atas cooling rack."
            ]
        }
    },
    {
        "title": "Takoyaki",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/takoyaki",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/takoyaki.jpg",
            "masa_penyediaan": "40 minit",
            "masa_memasak": "25 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Adunan Takoyaki": [
                    "1 cawan air",
                    "1 cawan tepung gandum",
                    "1 sb tepung jagung",
                    "1 biji telur",
                    "¾ cawan air panas",
                    "½ kiub pati ayam",
                    "1 sk kicap cair"
                ],
                "Bahan Lain": [
                    "Sotong kurita",
                    "Jejari ketam",
                    "Sosej ayam",
                    "Daun bawang",
                    "2 biji cili merah",
                    "Tempura rangup (tenkasu)",
                    "Kepingan bonito",
                    "Serbuk seaweed",
                    "Mayonis"
                ],
                "Bahan Sos Takoyaki": [
                    "2 sb sos tomato",
                    "3 sb kicap pekat manis",
                    "3 sb gula",
                    "1 cawan air",
                    "1-2 sb sos worcestershire (pilihan)",
                    "1 sb tepung jagung",
                    "Sedikit air",
                    "2 sb kicap cair",
                    "Sedikit air asam jawa (pilihan)"
                ]
            },
            "instructions": {
                "Untuk Inti Dan Adunan Takoyaki": [
                    "Hiris halus daun bawang dan cili merah (buang biji)",
                    "Bersihkan sotong kurita, gaul dengan 1 sudu kecil baking powder dan sedikit garam sampai berbuih. Kemudian rehat 10 minit, bilas dengan air dan rebus 10 minit.",
                    "Potong (anggaran 1cm) sotong kurita, sosej dan jejari ketam.",
                    "Pecahkan dan pukul sebati telur.",
                    "Larutkan kiub ayam dengan air panas. (kebiasanya orang jepun guna serbuk atau dashi stock). Tambahkan air sejuk, kicap cair, telur dan kacau sebati.",
                    "Dalam bekas yang berasinggan masukkan tepung gandum dan tepung jagung dalam mangkuk yang besar. Tuang masuk adunan basah sedikit demi sedikit sambil kacau adunan sehingga larut sebati. Tapis adunan dan ketepikan."
                ],
                "Untuk Sos Takoyaki": [
                    "Bancuh tepung jagung dengan sedikit air.",
                    "Masukkan air, sos tomato, kicap pekat manis, kicap cair, air asam jawa (pilihan) dan gula.",
                    "Bila mendidih, masukkan sedikit air bancuhan tepung jagung dan tutup api bila sos sedikit pekat (sos akan pekat sikit lagi bila dah sejuk)."
                ],
                "Untuk Masak Takoyaki": [
                    "Gris acuan dengan minyak.",
                    "Kacau adunan setiap kali sebelum tuang dalam kuali.",
                    "Bila kuali dah panas, tuang adunan sampai agak penuh acuan.",
                    "Letak semua jenis inti (sosej ayam, jejari ketam dan sotong kurita). Tabur daun bawang, cili merah dan bertih beras (resepi asal mengunakan tempura rangup, tenkasu)",
                    "Tuang adunan sampai melimpah (pastikan api perlahan).",
                    "Bila adunan dah agak masak, pisahkan adunan yang melakat menggunakan chopstick.",
                    "Tolak Takoyaki menegak (90⁰) dan tuang masuk adunan sampai penuh lubang.",
                    "Telangkupkan Takoyaki. Kalau berlubang, tuang lagi adunan sampai penuh.",
                    "Balik-balikan sampai dapat bebola yang licin dan kemas.",
                    "Masak sehingga garing (boleh drizzle sikit minya masak jika perlu).",
                    "Angkat dan hidangkan bersama sos  Takoyaki, mayonis, serbuk seaweed dan kepingan bonito"
                ]
            },
            "tips_and_guides": [
                "Tips untuk bersihkan sotong kurita, kelar lapisan antara kaki, gaul dengan 1 sudu kecil  baking powder dan sedikit garam sampai berbuih. Kemudian rehat 10 minit, bilas dengan air dan rebus 10 minit.",
                "Resepi asal Takoyaki mengunakan tempura rangup, (tenkasu), Che Nom guna crispy bubble rice yang lebih murah dan senang dapat.",
                "Kebiasanya orang jepun guna serbuk atau dashi stock, Che Nom ganti dengan kiub pati ayam yang mudah untuk dapat.",
                "Kalau takde kicap cair, boleh tambah/ganti dengan garam sikit dalam sos takoyaki.",
                "Untuk rasa yang lebih sedap, boleh tambah sos Worcestershire dalam sos Takoyaki.",
                "Gunakkan bekas kecil untuk tuang adunan Takoyaki dalam acuan.",
                "Adunan mudah mendap jadi kerap kacau adunan setiap kali sebelum tuang dalam acuan kuali."
            ]
        }
    },
    {
        "title": "Lontong Kuah Lodeh",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/lontong-kuah-lodeh",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Lontong_YT_2.jpg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Kisar Halus": [
                    "3 biji bawang merah",
                    "3-4 ulas bawang putih",
                    "1-2 ketul kunyit hidup",
                    "1 inci halia",
                    "1 biji tomato",
                    "1-2 biji cili merah",
                    "4-5 tangkai cili padi",
                    "2 tangkai cili kering",
                    "3 biji buah keras",
                    "1 sudu besar udang kering",
                    "sedikit air"
                ],
                "Bahan Untuk Goreng": [
                    "2 keping tempe",
                    "4 ketul tauhu",
                    "sedikit garam",
                    "sedikit serbuk kunyit"
                ],
                "Bahan Untuk Lain-Lain": [
                    "telur rebus",
                    "3-4 sudu besar minyak masak",
                    "1 batang serai",
                    "1 inci lengkuas",
                    "1 batang lobak merah",
                    "1 biji kecil sengkuang",
                    "sedikit air",
                    "4 batang kacang panjang",
                    "1 keping fucuk",
                    "suun",
                    "3 - 4 cawan santan cair (atau lebih jika suka)",
                    "kubis",
                    "garam secukup rasa",
                    "1 mangkuk  santan pekat",
                    "10-15 ekor udang",
                    "1/3 sudu kecil gula",
                    "nasi impit",
                    "sambal ikan bilis",
                    "ikan bilis goreng"
                ]
            },
            "instructions": {
                "Untuk Goreng": [
                    "Gaul potongan tempe bersama sedikit garam dan kunyit. Ulang cara yang sama untuk potongan tauhu.",
                    "Goreng tempe dan tauhu sehingga keperangan lalu angkat dan toskan minyak."
                ],
                "Untuk Kuah Lodeh": [
                    "Sediakan bahan kisar halus.",
                    "Panaskan minyak. Tumis bahan kisar halus sehingga agak garing.",
                    "Masukkan serai, lengkuas, sedikit air, sengkuang dan lobak merah lalu reneh kesemua bahan.",
                    "Masukkan tempe dan tauhu goreng, kacang Panjang serta fucuk dan suun yang telah lembut direndam.",
                    "Tuang santan cair atau air dan masukkan baki sayur iaitu pontongan kubis, garam secukup rasa lalu masak sehingga mendidih.",
                    "Sesudah itu, masukkan santan pekat, udang, sedikit garam dan gula. Kerap kacau ketika renehkan kuah dengan api perlahan.",
                    "Reneh kuah lodeh cukup sekadar udang masak dan kuah lodeh siap untuk dihidang bersama nasi impit"
                ],
                "Untuk Nasi Impit": [
                    "Rebus nasi impit dan sejukkan.",
                    "Kemudian, potong kesemuanya dalam ketulan besar."
                ]
            },
            "tips_and_guides": [
                "Bagi mengelakkan tempe dan tauhu menjadi hancur ketika masak, potong keduanya dalam bentuk kiub besar.",
                "Jika tidak mahu gunakan kacang panjang, boleh saja digantikan dengan kacang buncis.",
                "Selain itu, jika tidak mahu masukkan sengkuang, boleh juga digantikan dengan lobak putih.",
                "Guna santan cair bagi perahan yang kedua untuk dimasukkan kedalam kuah dan jika menggunakan santan kotak, gantikan dengan langkah memasukkan air sahaja.",
                "Semasa mereneh  kuah lodeh, kerapkan kacau kuah biar jangan pecah santan bagi menggelakkan santan berketul didalam masakan."
            ]
        }
    },
    {
        "title": "Grill Chicken Wrap",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=1",
        "recipe_url": "https://resepichenom.com/resepi/grill-chicken-wrap",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Chicken_Foldover-3.JPG",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "5 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Perapan Ayam": [
                    "2 ulas bawang putih",
                    "2 ketul dada ayam",
                    "1 sudu kecil serbuk lada hitam",
                    "2 sudu kecil serbuk paprika salai",
                    "Sedikit garam",
                    "2 sudu besar minyak zaitun extra virgin"
                ],
                "Bahan Untuk Salad Dressing": [
                    "3 sudu besar minyak zaitun extra virgin",
                    "3 sudu besar jus lemon",
                    "¼ sudu kecil serbuk lada hitam",
                    "1 sudu kecil dijon mustard",
                    "Secubit garam",
                    "1 sudu besar madu"
                ],
                "Bahan Untuk Lain-Lain": [
                    "Sayur salad",
                    "Timun",
                    "Tomato ceri",
                    "Karot",
                    "Roti tortilla bijirin penuh"
                ]
            },
            "instructions": {
                "Untuk Perapan Ayam": [
                    "Tos dan keringkan ayam lepas dibersihkan lalu masukkan kedalam bekas.",
                    "Masukkan parutan halus bawang putih, serbuk lada hitam, serbuk paprika salai, sedikit serbuk cili, sedikit garam dan minyak zaitun extra virgin.",
                    "Gaul rata kesemua bahan pada bahagian ayam. Pastikan bahagian ayam disalut dengan rata.",
                    "Perap ayam minimun 2 jam atau semalaman.",
                    "Sesudah diperap, panaskan kuali dan goreng ayam lalu masukkan minyak zaitun extra virgin.",
                    "Kemudian, tutup sebentar anggaran dalam 30 saat lalu buka penutup dan alih ayam tersebut. Ulang cara yang sama 2 atau 3 kali sehingga ayam masak sempurna.",
                    "Angkat selepas kedua-dua belah bahagian kelihatan sudah terpanggang dan masak.",
                    "Rehatkan sekejap ayam panggang tersebut.",
                    "Sapu madu diatas ayam panggang lalu potong ayam."
                ],
                "Untuk Salad Dressing": [
                    "Rendam salad yang telah dibasuh dengan air sejuk.",
                    "Hiris nipis timun, lobak merah, dan potong tomato ceri.",
                    "Tapis sayur yang direndam dan keringkan sayur menggunakan salad spinner (jika ada).",
                    "Masukkan minyak zaitun extra virgin didalam bekas yang berpenutup dan diikuti dengan perahan jus lemon. Kuantiti bagi kedua bahan ini adalah sama banyak.",
                    "Masukkan serbuk lada hitam dan dijon mustard.",
                    "Goncang bahan-bahan tersebut lalu masukkan secubit garam, madu dan sambung goncang sehingga sekata."
                ],
                "Untuk Roti Tortilla": [
                    "Panaskan roti tortilla diatas kuali. Alih untuk panaskan kedua belah bahagian roti tortilla.",
                    "Gunting roti sampai ke tengah. Bahagi kepada 4 bahagian di mana bahagian pertama disusun ayam panggang, bahagian ketiga diletak salad, timun, lobak merah dan tomato ceri bersama  salad dressing yang dibuat. Tambah mayonis biasa atau rendah lemak diatas ayam panggang.",
                    "Kemudian, balut  roti tortilla mengikut bahagian dan grill chicken wrap siap untuk dihidang."
                ]
            },
            "tips_and_guides": [
                "Jika tidak mempunyai serbuk paprika salai, boleh digantikan ia dengan serbuk cili atau serbuk cayenne.",
                "Selain air sejuk, rendaman salad juga boleh digunakan air suhu bilik dan dimasukkan dalam peti sejuk. Bila kita rendam, salad akan lebih kembang dan rangup",
                "Ketika menggoreng ayam, jangan terlalu cepat alihkan ayam dan biarkan selama 30 saat dahulu.",
                "Untuk memeriksa ayam sudah masak atau tidak, cucuk dan potong sedikit ayam tersebut samada mentah ataupun tidak. Jika sudah masak, isi ayam akan kelihatan putih sahaja.",
                "Jika mahukan roti tortilla yang rangup dan sedikit goreng, boleh dipanaskan lama sedikit. Namun, jika mahu mengekalkan tekstur roti tortilla yang lembut, hanya panaskan sekejap sahaja."
            ]
        }
    },
    {
        "title": "Tauhu Begedil Dan Sambal Kicap Yang Padu",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=2",
        "recipe_url": "https://resepichenom.com/resepi/tauhu-begedil-dan-sambal-kicap-yang-padu",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Tauhu_begedil_IG.JPG",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Tauhu Begedil": [
                    "300g / 25-30 biji tauhu kering",
                    "½ biji bawang besar",
                    "150g daging kisar",
                    "6-7 biji kentang",
                    "3 tangkai cili merah",
                    "sedikit daun sup",
                    "½ cawan bawang goreng",
                    "½ sudu kecil lada sulah",
                    "garam secukup rasa",
                    "2 biji telur",
                    "secubit garam"
                ],
                "Bahan Untuk Cili Kicap": [
                    "½ biji bawang besar",
                    "3 biji bawang merah",
                    "5-6 ulas bawang putih",
                    "10 tangkai cili padi",
                    "2 tangkai cili merah",
                    "sedikit minyak",
                    "Anggaran 1 cawan kicap manis ABC",
                    "Anggaran 1/3 cawan kicap manis cap Kipas Udang"
                ]
            },
            "instructions": {
                "Untuk Tauhu Begedil": [
                    "Gunting permukaan tauhu kering dan keluarkan isinya. Asingkan dulu isi dan tauhu kering.",
                    "Cincang halus daun sup dan cili merah.",
                    "Hiris nipis kentang dan bawang merah. Kemudian potong dadu  biji bawang besar.",
                    "Panaskan minyak dan goreng hirisan bawang merah sehingga kekuningan dan garing. Gorengkan dengan api yang sederhana.",
                    "Angkat dan toskan minyak selepas bawang merah kelihatan keperangan.",
                    "Kemudian, goreng kentang sehingga sedikit kekuningan lalu angkat dan toskan minyak.",
                    "Tumis bawang besar serta masukkan daging kisar. Gaul sehingga ia masak serta kering airmya.",
                    "Tambah serbuk lada dan garam secukup rasa.",
                    "Bila air daging sudah kering, angkat dan ketepikan dulu.",
                    "Lenyek kentang goreng sehingga lumat lalu masukkan isi tauhu kering, cili merah, sedikit daun sup, daging kisar goreng, setengah cawan bawang goreng, lada sulah dan garam.",
                    "Gaul rata kesemua bahan sehingga sebati.",
                    "Bulatkan inti dan masukkan atau sumbat kedalam tauhu kering.",
                    "Pecahkan telur kedalam mangkuk dan sedikit garam. Kacau sehingga rata.",
                    "Celup tauhu begedil kedalam telur dan goreng kedalam minyak yang panas sehingga ia masak keperangan.",
                    "Angkat dan toskan minyak lalu tauhu begedil siap untuk dihidang."
                ],
                "Untuk Sambal Kicap": [
                    "Hiris kasar bawang besar, bawang merah dan bawang putih. Potong atau patahkan cili padi dan cili merah.",
                    "Goreng bahan-bahan kedalam minyak panas dan masak sehingga ia layu serta lembut. Kemudian, angkat dan toskan minyak.",
                    "Masukkan bahan kedalam pengisar. Tambah kicap manis ABC dan kicap manis cap Kipas Udang lalu kisar sehingga sederhana halus.",
                    "Selepas siap dikisar, perah limau nipis jika mahu."
                ]
            },
            "tips_and_guides": [
                "Kentang jika tidak dikupas kulitnya, pastikan cuci kentang sebersih-bersihnya untuk dimasukkan kedalam masakan. Selain itu, jika mahu direbus kentang, tidak perlu dihiris nipis.",
                "Pastikan bawang merah goreng tidak dibiarkan begitu lama dan cepat-cepat mengangkatnya selepas ia sudah masak keperangan. Hal ini kerana bawang itu masih dalam proses masak dimana ia akan cepat hangit dan menyebabkan rasa pahit serta tidak sedap.",
                "Bawang boleh diletakkan dibawah kipas selepas ditos jika tidak pandai mengagak masa mengangkatnya. Tips ini oleh dicuba ya.",
                "Jika tidak mahu menggunakan kaedah menggoreng kentang kerana takut berminyak, kentang boleh juga direbus. Bagi Che Nom, kentang yang digoreng kerana akan lagi sedap rasanya dan begedil lebih mudah dibentuk."
            ]
        }
    },
    {
        "title": "Pancake dan Sos Coklat",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=2",
        "recipe_url": "https://resepichenom.com/resepi/pancake-dan-sos-coklat",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Pancake_sos_coklat_IG.JPG",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "20 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Buttermilk": [
                    "1 ½ cawan susu full cream (**boleh ganti susu cair)",
                    "2 sudu besar jus lemon (**sbb takda jus lemon, Che nom ganti cuka kali ni)"
                ],
                "Bahan Untuk Adunan Basah (A)": [
                    "BUTTERMILK (**seperti di atas)",
                    "¼ cawan /57g mentega",
                    "2 biji telur"
                ],
                "Bahan Untuk Adunan Kering (B)": [
                    "2 cawan /250g tepung gandum",
                    "3 sudu besar /45g gula kastor",
                    "3 sudu kecil serbuk penaik",
                    "¼ sudu kecil garam halus"
                ],
                "Bahan Untuk Sos Coklat": [
                    "200g coklat masakan gelap",
                    "¾ cawan susu full cream",
                    "2 sudu besar mentega",
                    "secubit garam (**jika menggunakan unsalted butter)"
                ]
            },
            "instructions": {
                "Untuk Adunan Basah (A)": [
                    "Masukkan susu full cream dan cuka makan @ lemon kemudian kacau dan rehatkan selama 5 minit.",
                    "Cairkan mentega dan masukkan kedalam adunan tadi.",
                    "Seterusnya masukkan telur yang telah dipukul dan kacau sekata."
                ],
                "Untuk Adunan Kering (B)": [
                    "Masukkan tepung gandum, gula kastor, baking powder, dan garam halus (jika menggunakan unsalted butter).",
                    "Kacau sedikit adunan tadi."
                ],
                "Untuk Pancake": [
                    "Tuangkan adunan basah (A) ke bahan kering (B) sedikit demi sedikit.",
                    "Panaskan frying pan dan tuang sedikit minyak dan ratakan dengan kertas tisu.",
                    "Tuangkan adunan dan masak sehingga keperangan kedua-dua belah"
                ],
                "Untuk Sos Coklat": [
                    "Potong nipis coklat masakan.",
                    "Masukkan ke dalam periuk coklat yang telah dipotong nipis, susu full cream, mentega dan garam.",
                    "Bukak api dan kacau sekadar suam sahaja adunan sos coklat tadi.",
                    "Curahkan sos coklat diatas pancake."
                ]
            },
            "tips_and_guides": [
                "Tips nk tahu bila nk tebalikkan Pancake tu, tunggu sampai sebelah atas pancake tu dh start belubang/berbuih tu itu tandanya dh boleh tebalikkan."
            ]
        }
    },
    {
        "title": "Churros Rangup & Sos Coklat",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=2",
        "recipe_url": "https://resepichenom.com/resepi/churros-rangup-sos-coklat",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Churros_IG.JPG",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "10 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Churros": [
                    "1 cawan / 250ml air",
                    "1 sudu besar / 13g gula kastor",
                    "1/4 sudu kecil garam (kalau guna mentega tak bergaram)",
                    "1/4 cawan / 56g mentega",
                    "1 cawan / 125g tepung gandum",
                    "2 biji telur",
                    "1 sudu kecil esen vanilla",
                    "minyak masak, untuk menggoreng"
                ],
                "Bahan Untuk Sos Coklat": [
                    "1 cawan / 125g dark chocolate (coklat masakan, yg bar pun ok)",
                    "1/2 cawan /125ml susu full cream",
                    "2 sudu besar / 28g mentega (kalau guna mentega tak bergaram)"
                ]
            },
            "instructions": {
                "Untuk Masak Churros": [
                    "Masukkan adunan dalam piping bag.",
                    "Masukkan air, gula kastor, garam (kalau guna unsalted butter) dan mentega kedalam periuk dan panaskan sampai mendidih.",
                    "Tutup api dan masukkan tepung gandum.",
                    "Masak tepung sampai bergumpal keras dan lincin baru doh tak lembik (kacau tepung anggaran 10-15 minit).",
                    "Sejukkan 5-10 minit.",
                    "Masukkan telur sebiji demi sebiji kedalam adunan tepung tadi, jangan masuk semua telur sekali, kalau masuk sebiji dah lembik, tak perlu lagi masuk telur yang ke 2.",
                    "Kemudian masukkan esen vanila dan kacau lagi sehingga sekata.",
                    "Sediakan piping bag, gunting dihujuk plastik dan masukkan nozzle.",
                    "Panaskan minyak dan pipe doh tadi mengikut size dan panjang yang anda suka.",
                    "Angkat bila keperangan.",
                    "Gaul gula kastor dan sedikit serbuk kayu manis."
                ],
                "Untuk Masak Sos Coklat": [
                    "Cairkan coklat gelap, susu full cream dan mentega.",
                    "Kacau sampai larut.",
                    "Masukkan secubit garam (kalau guna butter tak bergaram)."
                ]
            },
            "tips_and_guides": [
                "Kalau takde butter, boleh ganti planta/majerin.",
                "Coklat yg digunakan ialah coklat masakan, bentuk bar atau coin tak kisah.",
                "Kalau takde gula kastor, blend je gula biasa bagi halus.",
                "Penting!! : Sejukkan doh biar agak2 suam dan masuk telur SEBIJI DEMI SEBIJI. Jangan masuk semua telur sekali. Kalau masuk sebiji dan lembik, tak perlu lagi masuk telur yg ke 2.",
                "Tips untuk rangup: Kerap kacau masa mengoreng api sederhana8-10 minit atau sampai permukaan luar churros keras."
            ]
        }
    },
    {
        "title": "Churros",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=2",
        "recipe_url": "https://resepichenom.com/resepi/churros",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/6fbff07d584e9bf67967b823d7705bf5476ca8ad.jpeg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "5 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1/2 cawan minyak",
                    "1/2 cawan air",
                    "3 sudu besar butter, potong dadu",
                    "2 sudu kecil gula halus",
                    "1/4 sudu kecil garam",
                    "1/2 sudu kecil esen vanilla",
                    "1 1/4 cawan tepung gandum",
                    "1 biji telur",
                    "minyak untuk menggoreng",
                    "piping bag plastik atau kertas",
                    "Bahan untuk Cinnamon Sugar (salutan gula kayu manis)",
                    "1/2 cawan gula kastor",
                    "1 sudu kecil serbuk kayu manis"
                ],
                "Bahan Untuk Chocolate Gravy (Sos Coklat)": [
                    "250g coklat bar, cincang kasar",
                    "1/4 cawan butter",
                    "1/2 cawan susu full cream dutch lady"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Panaskan minyak di dalam kuali untuk goreng kemudian.",
                    "Dalam periuk kecil masukkan air, susu, butter, gula dan garam. Panaskan sehingga cair dan mula mendidih. Tutup api dan angkat periuk ke tepi.",
                    "Masukkan tepung dan esen vanila kemudian kacau sehingga tepung menjadi sekata dan adunan tidak berketul.",
                    "Masukkan pula telur dan kacau sebati. Tuang adunan ke dalam piping bag yang sudah di pasang nozze.",
                    "Paip adunan di dalam minyak panas dan goreng sehingga keperangan. Angkat dan gaul bersama cinnamon sugar.",
                    "Hidang bersama sos coklat."
                ]
            },
            "tips_and_guides": [
                "Sewaktu proses piping di dalam minyak panas, anda boleh pipe doh dalam anggaran 2 inci panjang setiap satu dan gunting. Boleh juga pipe doh sepanjang yang anda suka di dalam kuali dan apabila diangkat kemudian, terus gunting sekata anggaran 2 inci sebelum gaul di dalam cinnamon sugar."
            ]
        }
    },
    {
        "title": "Lapis Cheese Cracker",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=2",
        "recipe_url": "https://resepichenom.com/resepi/lapis-cheese-cracker",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/06bf414e272b67692ce49e0e727391323163c9fd.jpeg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "N/A",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "1 bungkus biskut Deluxe cracker",
                    "250g cream cheese Philadelphia",
                    "1/4 tin susu pekat manis",
                    "serbuk nestum secukupnya",
                    "1 kotak kecil susu Full Cream atau Fresh Milk",
                    "serbuk koko untuk hiasan"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Putar cream cheese sehingga kembang dan lembut.",
                    "Masukkan 4 sudu besar susu, kemudian masukkan pula susu pekat sedikit demi sedikit dan putar sehingga sebati.",
                    "Celup biskut dalam susu dan susun di dalam loyang. Che Nom guna loyang berukuran 11\"x7\".",
                    "Susun biskut rapat-rapat dan tuang sedikit adunan cream cheese di lapisan atas dan ratakan. Tabur sedikit nestum dengan sekata.",
                    "Selang selikan dengan susunan biskut celup, lapisan cream cheese dan taburan nestum sehingga habis.",
                    "Sejukkan dalam peti ais semalaman. Potong empat segi kecil dan tabur degan serbuk koko sebagai hiasan."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Tortilla Wrap Ayam Panggang",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=2",
        "recipe_url": "https://resepichenom.com/resepi/tortilla-wrap-ayam-panggang",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/44c456a6d4c0b48b464649f97e5a6fdf945a503a.jpeg",
            "masa_penyediaan": "20 minit",
            "masa_memasak": "15 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Wrap": [
                    "6 keping roti tortila",
                    "Mayonis"
                ],
                "Bahan Untuk Ayam Panggang": [
                    "2 keping ayam bahagian dada",
                    "1 sudu kecil serbuk lada hitam, kisar kasar",
                    "1 biji bawang putih, parut halus menjadi pes",
                    "1/2 sudu kecil garam halus",
                    "2 sudu besar minyak zaitun"
                ],
                "Bahan Untuk Salad": [
                    "Kubis ungu, hiris sederhana nipis",
                    "Daun salad, hiris sederhana kecil",
                    "Ceri tomato, dibelah dua",
                    "Karot, diparut kasar",
                    "1/2 batang timun (saya gunalan timun jepun)"
                ],
                "Bahan Untuk Kuah Salad": [
                    "3 sudu besar minyak zaitun",
                    "3 besar madu",
                    "3 sudu besar perahan jus lemon",
                    "Secubit garam",
                    "Sedikit serbuk kasar lada hitam"
                ]
            },
            "instructions": {
                "Untuk Ayam Panggang": [
                    "Belah dua dada ayam dan buka lebar, tapi pastikan tidak terputus dua.",
                    "Perap ayam bersama lada hitam, bawang putih, garam dan minyak zaitun selama minimum 1/2 jam.",
                    "Panggang dengan sedikit minyak di atas kuali non-stick pada kedua belah bahagian ayam sehingga masak.",
                    "Angkat dan rehatkan selama 10 minit kemudian hiris nipis."
                ],
                "Untuk Salad": [
                    "Gaulkan semua daun salad bersama sayuran lain dan ketepikan.",
                    "Dalam botol kecil, masukkan semua bahan untuk kuah salad dan goncangkan selama beberapa minit sehingga betul-betul sebati. Gaulkan kuah salad bersama bahan salad. Tuang sedikit dahulu, jika kering tambahkan sedikit demi sedikit."
                ],
                "Untuk Balutan Salad (Tortila Wrap)": [
                    "Panaskan roti tortila di atas non-stick pan dalam 2-3 minit setiap sebelah bahagian.",
                    "Sudukan salad ke atas tortila dan susun memanjang. Letakkan ayam dan mayonis, kemudian balut atau guling dengan kemas. Sedia untuk dihidang."
                ]
            },
            "tips_and_guides": [
                "Rendam dulu semua sayuran dan salad di dalam air ais selama 15-20 minit sebelum dikeringkan air menggunakan tisu dapur atau salad spinner (salad spinner adalah yang terbaik). Ini adalah untuk mendapatkan salad yang segar dan rangup."
            ]
        }
    },
    {
        "title": "Kentang Wedges Bersalut",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=2",
        "recipe_url": "https://resepichenom.com/resepi/kentang-wedges-bersalut",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/7b15a90936fd20e76509b89617eb1b51c03872e8.jpeg",
            "masa_penyediaan": "N/A",
            "masa_memasak": "N/A",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "3 biji kentang yg besar(bersihkan dan x payah buang kulit)",
                    "dan potong wedges...",
                    "3 biji putih telur(utk melekatkan salutan)",
                    "1 sudu teh garam",
                    "1 sudu teh lada sulah",
                    "1 sudu teh serbuk cili",
                    "100gm nestum ataupun serbuk roti",
                    "minyak utk menggoreng"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Rebus kentang hingga 3/4 empuk(toskan airnya dan kemudian ketepikan)",
                    "Pukul telur bersama garam,lada sulah dan serbuk cili",
                    "Kemudian masukkan bahan2 salut nestum atau serbuk roti ke dalam bekas berttup atau dlm plastik..",
                    "Curahkan telur tadi ke atas kentang dan gaul kan sekata...jgn sampai hancur..",
                    "Setelah rata masukkan kentang ke dalam bekas plastik yg berisi nestum/serbuk roti tadi dan goncang biar semua serbuk brsalut pada kentang..",
                    "Panaskan minyak dan goreng hingga kekuningan@ masak",
                    "Sedia dimakan bersama mayonis dan sos cili.."
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Pancake with Chocolate Gravy",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=2",
        "recipe_url": "https://resepichenom.com/resepi/pancake-with-chocolate-gravy",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/d018638bc3e201bfd06184f23a13f60ddd366235.jpeg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "25 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "For pancake:",
                    "2 cups whole wheat  flour (tepung gandum)",
                    "4 tablespoons butter",
                    "2 tablespoons lemon juice",
                    "4 tablespoons caster sugar",
                    "3 teaspoons baking powder",
                    "2 eggs",
                    "1 teaspoon salt",
                    "1 1/2 cups Dutch Lady Full Cream Milk",
                    "For Gravy:",
                    "250 g chocolate bars, coarsely chopped",
                    "1/4 cup butter",
                    "1/2 cup Dutch Lady Full Cream Milk",
                    "1 tablespoon flour (all purpose flour or whole wheat flour)"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "For pancake:",
                    "Melt the butter.",
                    "Mix milk and lemon juice, let stand for 5 minutes.",
                    "Mix together the milk mixture with eggs and butter in bowl.",
                    "In a separate bowl, combine the dry ingredients of flour, salt, baking powder and sugar and sift.",
                    "Then pour the wet mixture into the bowl of dry ingredients in step 4. And stir to combine.",
                    "Heat a nonstick pan with lightly greased of vegetable oil, pour or scoop the batter onto the pan and cook until bubbles appear on the surface.",
                    "Cook until browned on both sides.",
                    "For Chocolate Gravy:",
                    "Melt the chocolate using 'double boiler' technique.",
                    "Then, add flour, butter and milk. Stir well until get the right concentration."
                ]
            },
            "tips_and_guides": [
                "Double boiler method is to steam and cooking techniques require 2 floor pan. Add water 1/4 full in the pot and heat until boiling. Take a glass bowl and place over a pot of boiling above. Heat from the steam will melt the chocolate batter."
            ]
        }
    },
    {
        "title": "Pancake",
        "page_url": "https://resepichenom.com/kategori/snek-dan-makanan-ringan?page=2",
        "recipe_url": "https://resepichenom.com/resepi/pancake",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/0a3f93868768ed7aa492e5a790ec86d6f2917c9b.jpeg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "15 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Utama": [
                    "2 Sudu Besar Jus Lemon",
                    "2 Cawan  tepung gandum",
                    "4 Sudu Besar Mentega",
                    "4 Sudu Besar Gula Kastor",
                    "3 Sudu Teh Baking Powder",
                    "2 Biji Telur",
                    "1 Sudu Kecik Garam",
                    "1 1/2 Cawan Susu Full Cream Dutchlady"
                ]
            },
            "instructions": {
                "Penyediaan Utama": [
                    "Cairkan mentega.",
                    "Campur susu dan jus lemon, biarkan selama 5 minit.",
                    "Campur sekali susu, jus lemon, telur dan mentega yang di carikan.",
                    "Dalam Mangkuk berasingan, adunkan bahan kering iaitu tepung, garam, baking powder dan gula.",
                    "Kemudian tuang adunan basah kedalam mangkuk yang berisi bahan kering dia dalam langkah 4. Dan kacau hingga sebati.",
                    "Panaskan nonstick pan yang digriskan dengan sedikit minyak sayur, tuang 1/4 adunan  keatas kuali dan masak sehingga buih timbul di permukaan.",
                    "Masak sehingga keperangan di kedua2 belah bahagian."
                ]
            },
            "tips_and_guides": []
        }
    }
]