[
    {
        "title": "Cheese Tart Versi Klasik Resepi Premium",
        "page_url": "https://resepichenom.com/kategori/pastri?page=1",
        "recipe_url": "https://resepichenom.com/resepi/cheese-tart-versi-klasik-resepi-premium",
        "details": {
            "image_url": null,
            "ingredients": {},
            "instructions": {},
            "tips_and_guides": []
        }
    },
    {
        "title": "Cream Puff",
        "page_url": "https://resepichenom.com/kategori/pastri?page=1",
        "recipe_url": "https://resepichenom.com/resepi/cream-puff",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Cream_Puff_1_IG.JPG",
            "masa_penyediaan": "N/A",
            "masa_memasak": "40 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Krim Diplomat": [
                    "1 ¼ cawan/313ml susu full cream",
                    "2 kuning telur",
                    "1/4 cawan/55g gulaPuff pastry",
                    "1 sudu besar/8g tepung gandum",
                    "3 sudu besar/24g tepung jagung",
                    "¼ sudu kecil garam",
                    "1 sudu kecil esen vanila",
                    "2 sudu besar/28g mentega tak bergaram",
                    "1 cawan/240g non-dairy whipping cream"
                ],
                "Bahan Untuk Choux Pastry": [
                    "1 cawan/250g air",
                    "¼ cawan/56g mentega",
                    "¼ sudu kecil garam",
                    "1 sudu kecil esen vanila",
                    "1 sudu besar/12g gula",
                    "1 cawan/125g tepung gandum",
                    "3 hingga 4 biji telur saiz B (rujuk video)",
                    "NOTA: Boleh gandakan resepi choux pastry, sebab cream tu banyak cukup untuk 2 adunan."
                ]
            },
            "instructions": {
                "Untuk Pastry Cream": [
                    "Masukkan susu full-cream didalam periuk lalu panaskan dan susu tidak perlu mendidih.",
                    "Asingkan kuning telur ke dalam mangkuk dan masukkan tepung jagung, tepung gandum dan gula kastor. Gaul kesemua bahan sehingga sebati.",
                    "Tambah garam.",
                    "Tuang susu yang suam-suam panas sedikit demi sedikit ke dalam bahan. Kerapkan mengacau bahan semasa menuang susu dan kacau sehingga sekata dan larut.",
                    "Kemudian, tapis bahan adunan bagi mengelakkan dari sebarang ketulan, lalu panaskan ia di atas api yang sederhana perlahan dan kacau sehingga adunan menjadi pekat.",
                    "Masukkan esen vanilla/ekstrak vanilla. Teruskan mengacau adunan.",
                    "Tutup api apabila bahan adunan kelihatan pekat dan sudah mendidih.",
                    "Selepas itu, masukkan mentega tak bergaram dan kacau sehingga sebati.",
                    "Tuangkan kedalam mangkuk dan tapis jika adunan mempunyai ketulan.",
                    "Tutup mangkuk adunan mengunakan plastic wrap atau apa-apa dan sejukkan dalam peti sejuk selama 2-3 jam."
                ],
                "Untuk Diplomat Krim": [
                    "Masukkan non-dairy whipping cream kedalam mixer lalu putarkan ia sehingga kental dan kembang.",
                    "Masukkan whipping cream kedalam pastry cream sedikit dan gaul sekata.",
                    "Kemudian, masukkan adunan ke dalam lebihan whipping cream semula dan adun kesemuanya sehingga sekata.",
                    "Sejukkan semula adunan bahan kedalam peti sejuk."
                ],
                "Untuk Choux Pastry": [
                    "Panaskan kuali dan masukkan secawan air, mentega tak bergaram, gula dan sedikit garam. Masak sehingga bahan-bahan cair.",
                    "Masukkan esen vanilla dan tuang kesemua tepung gandum lalu kacau adunan 2-3 minit sehingga sebati menjadi doh.",
                    "Masukkan doh kedalam mesin pengadun bila sedikit sejuk dan pukul adunan sambil memasukkan sebiji demi sebiji telur sehingga ia menjadi sedikit lembut dan pekat.",
                    "Bila adunan kelihatan pekat dan licin serta tidak terlalu keras, masukkan adunan kedalam piping bag lalu pipekan diatas loyang yang telah disapu marjerin.",
                    "Letak sedikit air diatas adunan dengan menggunakan jari supaya kelihatan kemas dan tidak terlalu tajam.",
                    "Bakar pada suhu 160c dalam anggaran masa 40 minit sehingga pastry menjadi keperangan dan kembang."
                ],
                "Untuk Cream Puff": [
                    "Masukkan  krim diplomat kedalam piping bag.",
                    "Tebuk lubang kecil dibahagian bawah  pastry.",
                    "Isikan krim diplomat dengan pipekan krim sehingga penuh kedalam pastry.",
                    "Atau;",
                    "Potong bahagian atas pastry menggunakan pisau atau gunting.",
                    "Pipekan krim diplomat ditengah pastry sehingga penuh keluar keatas lalu tutup bahagian atas pastry.",
                    "Hiaskan cream puff dengan gula aising. Kemudian, cream puff siap untuk dihidang."
                ]
            },
            "tips_and_guides": [
                "Untuk pastry cream, teruskan kacau adunan diatas api dan jangan berhenti.",
                "Jika adunan choux pastry kelihatan masih keras, tambah telur.",
                "Boleh menggunakan nozzle didalam piping bag jika ada.",
                "Wajib panaskan ketuhar terlebih dahulu sebelum mula membakar cream puff.",
                "Untuk hiasan yang lebih stabil dan tahan lama, gunakan serbuk salji berbanding gula aising."
            ]
        }
    },
    {
        "title": "Blueberry Cheesetart",
        "page_url": "https://resepichenom.com/kategori/pastri?page=1",
        "recipe_url": "https://resepichenom.com/resepi/blueberry-cheesetart",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/Cheesetart_Blueberry_IG.jpg",
            "masa_penyediaan": "45 minit",
            "masa_memasak": "40 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Tart Shell": [
                    "250g tepung gandum",
                    "125g mentega tak bergaram",
                    "40g gula aising",
                    "secubit garam",
                    "1 sudu besar susu tepung",
                    "1 kuning telur",
                    "1 sudu kecil esen vanila"
                ],
                "Bahan Untuk Cream Cheese Filling": [
                    "500g krim keju",
                    "30g mentega tak bergaram",
                    "100g gula aising",
                    "1 biji telur (guna 3 sudu besar)",
                    "1 sudu kecil esen vanila",
                    "½ sudu besar jus lemon",
                    "Jem blueberry"
                ]
            },
            "instructions": {
                "Untuk Tart Shell": [
                    "Ayak gula aising.",
                    "Asingkan telur kuning dengan telur putih. Ambil bahagian telur kuning.",
                    "Masukkan tepung gandum, gula aising, secubit garam, dan mentega tak bergaram lalu putar atau gaul adunan sehingga sekata sehingga menjadi seperti serbuk roti.",
                    "Masukkan susu tepung, telur kuning dan esen vanilla. Putar atau gaul sehingga kesemua adunan menjadi sebati.",
                    "Tambah air sejuk jika adunan terlalu kering sehingga adunan boleh digumpal.",
                    "Rehatkan doh selama  jam dalam peti sejuk.",
                    "Sesudah itu, masukkan doh dalam acuan. Letakkan doh di tengah acuan lalu tekan dan ratakan ke bahagian tepi acuan sehingga rapat dan sekata.",
                    "Trim lebihan doh supaya kelihatan lebih kemas",
                    "Cucuk bahagian bawah tart menggunakan garfu untuk menggelakkan bahagian bawah tidak menggelembung semasa dibakar.",
                    "Bakar pada suhu 16c dalam masa selama 15-20 minit",
                    "Sesudah dibakar, keluarkan tart dari acuan dan sejukkan."
                ],
                "Untuk Cream Cheese Filling": [
                    "Masukkan cream cheese dan mentega tak bergaram kedalam bekas pengadun, lalu putar sehingga kedua bahan sebati.",
                    "Sambil putar, masukkan gula aising yang telah diayak, esen vanilla, telur, jus lemon (pilihan). Putar dalam anggaran masa 10 minit sehingga adunan menjadi pekat dan licin",
                    "Masukkan cream cheese dan jem blueberry secukupnya dalam piping bag."
                ],
                "Untuk Blueberry Cheesetart": [
                    "Pipe kan jem blueberry filling kedalam shell tart diikuti dengan cream cheese diatasnya.",
                    "Gunakan air dengan basahkan di hujung jari lalu basahkan tajam di hujung cream cheese (pilihan).",
                    "Bakar blueberry cheesetart pada suhu 170 selama 10 -15 minit sehingga cheese tidak melekat bila disentuh, lalu sejukkan seketika.",
                    "Masukkan jem blueberry kedalam piping bag dan gunting sedikit hujung muncung piping bag.",
                    "Hiaskan atas cheesetart dengan piping blueberry filling mengikut kreativiti.",
                    "Kemudian, blueberry cheesetart siap untuk dihidang dan dijamu selera."
                ]
            },
            "tips_and_guides": [
                "Mentega tak bergaram untuk adunan tart shell mestilah sejuk.",
                "Adunan tart shell boleh diputar menggunakan food processor atau digaul menggunakan tangan, asalkan adunan menjadi sekata.",
                "Adunan tart shell jangan diuli terlebih lama bagi mengelakkan pastry menjadi keras.",
                "Boleh gunakan alat penekan tart untuk lebih cepat dan mudah jika tidak mahu gunakan tangan,",
                "Tambahan jus lemon kedalam  cream cheese membantu untuk menghilangkan muak  cheese dan sedapkan lagi rasa cheesetart. Jadi, jus lemon adalah pilihan samada mahu ditambah kedalam, cheese tart ataupun tidak.",
                "Blueberry filling jangan masukkan terlalu banyak kedalam tart shell supaya tak melimpah keluar semasa dibakar.",
                "Gunting hujung piping bag cukup besar dalam  besarnya dari bulatan tart shell dan pipe kan secara meninggi cream cheese kedalam tart shell.",
                "Jika bakar cheesetart terlalu lama, tart shell akan menjadi merekah dan tidak cantik.",
                "Sebelum dihias blueberry cheesetart, pastikan cheesetart sudah sejuk bagi menggelakkan blueberry menjadi cair."
            ]
        }
    },
    {
        "title": "Portuguese Egg Tart",
        "page_url": "https://resepichenom.com/kategori/pastri?page=1",
        "recipe_url": "https://resepichenom.com/resepi/portuguese-egg-tart",
        "details": {
            "image_url": "https://resepichenom.com/images/recipes/98896404a05859bb4c362289dcb4f36e3c14cc79.jpeg",
            "masa_penyediaan": "30 minit",
            "masa_memasak": "20 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Pastry": [
                    "1 gulung puff pastry"
                ],
                "Bahan Untuk Sos Kastard": [
                    "3 sudu besar tepung jagung",
                    "1 3/4 cawan susu",
                    "1 cawan gula kastor",
                    "1 batang kulit kayu manis",
                    "1/2 sudu teh esen vanila",
                    "6 biji telur kuning, dari telur saiz A"
                ]
            },
            "instructions": {
                "Untuk Sos Kastard": [
                    "Masukkan telur kuning, tepung dan gula di dalam mangkuk. Kacau dengan whisk sehingga sebati.",
                    "Dalam periuk berasingan, panaskan susu dan kulit kayu manis sehingga panas tetapi tidak mendidih. Keluarkan kayu manis dan tuangkan susu dalam mangkuk yang berisi adunan telur tadi dan teruskan kacau dengan whisk.",
                    "Masukkan kembali adunan ke dalam periuk. Masukkan esen vanila kemudian  masak dengan api yang kecil sehingga pekat. Angkan dan sejukkan di dalam mangkuk. Lekapkan permukaan sos kastard dengan plastic wrap supaya permukaan sos kastard tidak mengeras. Letak di dalam peti ais supaya sos kastard sejuk."
                ],
                "Untuk Pastry": [
                    "Menggunakan ready made puff pastry yang sudah dikeluarkan pada suhu bilik. Gulungkan puff pastry berukuran anggaran saiz kertas A4 seperti bentuk swissroll. Potong puff pastry kepada bentuk bulat anggran tebal 1.5 cm.",
                    "Menggunakan roller, ratakan puff pastry tadi kepada bentuk bulat yg sesuai dimuatkan dia alam acuan pastry (dalam anggaran 2cm diameter).",
                    "Isikan dengan sos kastard separuh penuh. Bakar pada suhu 160 celcius selama anggaran 20 minit atau sehingga puff pastry masak sempurna dan ada kesan 'burn mark' pada custard.",
                    "Angkat dan sejukkan sebelum dihidang"
                ]
            },
            "tips_and_guides": []
        }
    },
    {
        "title": "Tart Telur",
        "page_url": "https://resepichenom.com/kategori/pastri?page=1",
        "recipe_url": "https://resepichenom.com/resepi/tart-telur",
        "details": {
            "image_url": "https://resepichenom.com/uploads/profile/99d7f34158722068.jpg",
            "masa_penyediaan": "15 minit",
            "masa_memasak": "30 minit",
            "jumlah_masa": "N/A",
            "hidangan": "? orang",
            "ingredients": {
                "Bahan Untuk Kulit": [
                    "100gm  mentega",
                    "40gm gula aising",
                    "180gm tepung gandum",
                    "1 biji telur saiz 'B'",
                    "1/2 s/teh esen vanilla"
                ],
                "Bahan Untuk Filling": [
                    "1/2 cwn susu cair",
                    "2 biji telur",
                    "1/2 cwn gula pasir",
                    "1/2 cwn air",
                    "1/2 s/mkn tepung kastard",
                    "1/2 s/teh esen vanilla",
                    "sedikit pewarna kuning"
                ]
            },
            "instructions": {
                "Untuk Kulit": [
                    "Pukul mentega dan gula sampai kembang.",
                    "Masukkan telur, gaul sebati.",
                    "Masukkan tepung sehingga menjadi doh yang lembut.",
                    "Ratakan setebal 1/2 cm dan terap dalam acuan tat (boleh dibeli kedai yg menjual bahan-bahan kek)",
                    "Cucuk dengan garfu supaya tidak kembang dan bakar selama 10minit pada suhu 180 C.",
                    "Keluarkan dari oven dan masukkan filling. Bakar lagi 15minit @ sehingga masak.",
                    "Biarkan dan keluarkan untuk dihidang."
                ],
                "Untuk Filling": [
                    "Campurkan kesemua bahan-bahan tadi dan gaul sebati."
                ]
            },
            "tips_and_guides": []
        }
    }
]